Repository: postgis/postgis
Catalog: doc/po/*/faq.xml.po
Languages: es, fr, it_it, ja, pt_br

source: In general, you will want to use the "intersects operator" (&amp;&amp;) which tests whether the bounding boxes of features intersect. The reason the &amp;&amp; operator is useful is because if a spatial index is available to speed up the test, the &amp;&amp; operator will make use of this. This can make queries much much faster.
es: En general, querras utilizar el operador "intersects" (&amp;&amp;) que comprueba que los limites de los objetos geograficos intersectan. La razón por la que el operador &amp;&amp; es útil, es por que si un indice espacial esta disponible para aumentar la velocidad de calculo, el operador &amp;&amp; lo utilizará. Esto puede hacer las consultas mucho mucho mas rápidas.
fr: En général, vous voulez utiliser l'"opérateur intersects" (&amp;&amp;) qui test si la boîte englobante de l'entité intersecte. La raison de l'utilité de l'opérateur &amp;&amp; est que si un index spatial est disponible pour accélérer le test, l'opérateur &amp;&amp; l'utilisera. Cela rend les requêtes beaucoup plus rapide.
it_it: In generale, vorrai considerare l'uso dell'operatore di intersezione (&amp;&amp;) che verifica se le bounding box degli elementi si intersecano. La ragione per cui l'operatore &amp;&amp;) è utile è perché questo operatore ne farà uso, accelerando di molto le query.
ja: 一般的に、フィーチャーのバウンディングボックスがインタセクト (交差)しているかをテストするインタセクト演算子 (&amp;&amp;)を使います。&amp;&amp;演算子が便利な理由は、速度向上のために空間インデクスが付けられているなら、&amp;&amp;演算子は空間インデクスを使うからです。これによって、クエリの速度はとてもとても速くなります。
pt_br: Em geral, você vai querer utilizar os operadores de interseção (&amp;&amp;) que testa se os retângulos envolventes de feições se intersecionam. A razão que torna o operador &amp;&amp; útil é que existe um índice geoespacial para acelear a resolução do teste, que será utilizado pelo operador. Isto pode tornar as pesquisas muito mais rápidas.

source: You will also make use of spatial functions, such as Distance(), ST_Intersects(), ST_Contains() and ST_Within(), among others, to narrow down the results of your search. Most spatial queries include both an indexed test and a spatial function test. The index test serves to limit the number of return tuples to only tuples that <emphasis>might</emphasis> meet the condition of interest. The spatial functions are then use to test the condition exactly.
es: También puedes utilizar las funciones espaciales, tales como Distance(), ST_Intersects(), ST_Contains() y ST_Within(), y muchas otras, para obtener los resultados de tu búsqueda. Muchas de las consultas espaciales, incluyen tests de indices y funciones espaciales. El test de indices sirve para limitar el número de tuplas devuelto a las tupas que <emphasis>deben</emphasis> cumplir las condiciones que nos interesan. Las funciones espaciales utilizadas para probar la condición exacta.
fr: Vous allez aussi utiliser les fonctions spatiales telles que Distance(), ST_Intersects(), ST_Contains() et ST_Within(), entre autres, pour affiner les résultats de votre recherche. La plupart des requêtes spatiales incluent à la fois un test sur les indexes et un test de fonction spatiale. Le test d'index sert à limiter le nombre de tuples pour analyser uniquement les tuples qui <emphasis>pourraient</emphasis> satisfaire les conditions posées. Les fonctions spatiales sont ensuite utilisées pour tester la condition exacte.
it_it: Utilizzerai anche funzioni spaziali quali Distance(), ST_Intersects(), ST_Contains() and ST_Within(), tra le altre, per ridurre l'insieme dei risultati della ricerca. Molte interrogazioni spaziali comprendono sia un test legato a un indice, che un test spaziale. Il test legato all'indice serve a limitare il numero di tuple a quelle che <emphasis>potrebbero</emphasis> rispondere alle condizioni richieste. Le funzioni spaziali vanno poi a verificare in modo più esatto le condizioni.
ja: また、検索結果をより狭めるために、Distance(), ST_Intersects(), ST_Contains(), ST_Within() などといった空間関数を使うことでしょう。ほとんどの空間クエリは、インデクスのテストと空間関数のテストを含みます。インデクスのテストで返ってくるタプルを、求める条件に<emphasis>合致するかもしれない</emphasis>タプルのみとして、タプルの数を制限します。それから、空間関数で確実な条件のテストを行います。
pt_br: Você ainda pode usar funções geoespaciais, como ST_Distance(), ST_Intersects(), ST_Contains() e ST_Within(), entre outras, para filtrar ainda mais os resultados de sua pesquisa. A maior parte das pesquisas geoespaciais incluem ambos testes: um teste indexado e um teste de função geoespacial. O teste indexado serve para limitar o número de tuplas para as que <emphasis>podem</emphasis> ter a condição de interesse. As funções geoespaciais servem para testar a condição exatamente como esperado.

source: How do I speed up spatial queries on large tables?
es: ¿Como puedo aumentar la velocidad de las consultas espaciales en tagalas grandes?
fr: Comment est-ce que je peux accélérer les requêtes spatiales sur des grandes tables ?
it_it: Come posso accelerare le query spaziali su grandi tabelle?
ja: 大きなテーブルでの空間クエリの速度向上はどうするのですか?
pt_br: Como acelero pesquisas geoespaciais em grandes tabelas?

source: Fast queries on large tables is the <emphasis>raison d'etre</emphasis> of spatial databases (along with transaction support) so having a good index is important.
es: Consultas rápidas en tablas grandes es la <emphasis>razón de ser </emphasis> de las bases de datos espaciales (con soporte de transacciones), así que tener buenos indices es importante.
fr: Les requêtes rapides sur de grosse table est la <emphasis>raison d'etre</emphasis> des bases de donnes spatiales (avec la gestion des transactions) donc avoir un bon index est important.
it_it: La velocità delle query su tabelle di grandi dimensioni è la <emphasis>raison d'etre</emphasis> dei database spaziali (assieme al supporto delle transazioni), per cui avere un buon indice è importante.
ja: 大きなテーブルの速いクエリは、空間データベースの<emphasis>レゾンデートル</emphasis> (トランザクションサポートもそうですが)で、良いインデクスは重要です。
pt_br: Pesquisas rápidas em tabelas grandes é a <emphasis>raison d'etre</emphasis> de banco de dados geoespaciais (bem como suporte a transações), então ter um bom índice é importante.

source: To build a spatial index on a table with a <varname>geometry</varname> column, use the "CREATE INDEX" function as follows:
es: Para construir un indice en una tabla con una columna <varname>geometry</varname>, utiliza la función "CREATE INDEX" como en este ejemplo:
fr: Pour créer un index spatial sur une table avec un champ <varname>geometry</varname>, utilisez la fonction "CREATE INDEX" comme ci-après :
it_it: Per creare un indice spaziale per una tabella con colonna <varname>geometry</varname> , utilizza la funzione "CREATE INDEX" secono le istruzioni seguenti:
ja: <varname>geometry</varname>カラムを持つテーブルでの空間インデクスの構築は、"CREATE INDEX"を使って、次のようにします。
pt_br: Para criar um índice espacial em uma tabela com uma coluna <varname>geometry</varname>, utilize a função "CREATE INDEX" que segue abaixo:

source: CREATE INDEX [indexname] ON [tablename] USING GIST ( [geometrycolumn] );
ja: CREATE INDEX [インデクス名] ON [テーブル名] USING GIST ( [ジオメトリカラム] );

source: The "USING GIST" option tells the server to use a GiST (Generalized Search Tree) index.
es: La opción "USING GIST" le dice al servidor que utilice un indice GiST (Arbol de búsqueda generalizado).
fr: L'option "USING GIST" dit au serveur d'utiliser un index GiST (Generalized Search Tree).
it_it: L'opzione "USING GIST" dice al server di utilizzare un indice GiST (Generalized Search Tree).
ja: "USING GIST"オプションによって、サーバにGiST (Generalized Search Tree)インデクスを作るよう指示が渡ります。
pt_br: A opção "USING GIST" diz ao servidor que utilize um indice GIST (Generalized Search Tree).

source: GiST indexes are assumed to be lossy. Lossy indexes uses a proxy object (in the spatial case, a bounding box) for building the index.
es: Los indices GiST se supone que son "lossy". Los indices "lossy" utilizan un objeto proxy (en el caso espacial, las cajas) para construir el indice.
fr: Les indexes GiST sont supposés sans perte. Les indexes avec pertes utilisent un objet proxy (dans le cas du spatial, une boîte englobante) pour construire l'index.
ja: GiSTインデクスは、不可逆であると仮定します。不可逆インデクスの構築には、代理オブジェクト (空間インデクスの場合はバウンディングボックス)を使います。
pt_br: Índeces GIST são assumidamente lossy. Índices lossy usam um objeto de busca (em casos espaciais, uma bounding box) para contruir o índice.

source: You should also ensure that the PostgreSQL query planner has enough information about your index to make rational decisions about when to use it. To do this, you have to "gather statistics" on your geometry tables.
es: También debes estar seguro que el planificador de consultas de PostgreSQL tiene suficiente información sobre tus indices para tomar una decisión racional de cuando utilizarlos. Para ello, tienes que "recopilar las estadísticas" de tus tablas geométricas.
fr: Vous devriez vous assurer également que le planificateur PostgreSQL possède suffisamment d'information sur votre index pour prendre des décisions rationnelles sur son utilisation. Pour cela, il faudra "calculer les statistiques" sur vos tables géométriques.
ja: PostgreSQLのクエリプランナがインデクスを作るべきかについて合理的な決定を行うよう、十分な情報を確実に持てるようにすべきです。そのために、ジオメトリテーブル上で"gather statistics"を実行しなければなりません。
pt_br: Você também deveria garantir que o plano de acesso do PostgreSQL tem informações suficientes sobre seu índice para fazer decisões racionais sobre quando utilizá-lo. Para fazer isso, você deve atualizar as estatísticas nas suas tabelas geométricas.

source: For PostgreSQL 8.0.x and greater, just run the <command>VACUUM ANALYZE</command> command.
es: Para PostgreSQL 8.0.x o superior, solo tienes que ejecutar el comando <command>VACUUM ANALYZE</command>.
fr: Pour les versions de PostgreSQL 8.0.x et les versions supérieures, lancez simplement la commande <command>VACUUM ANALYZE</command>.
it_it: Per PostgreSQL 8.0.x e versioni superiori, è sufficiente eseguire il comando <command>VACUUM ANALYZE</command>.
ja: PostgreSQL 8.0.x以上では、<command>VACUUM ANALYZE</command>コマンドを実行するだけです。
pt_br: Para o PostgreSQL 8.0.x ou posterior, apenas executeo o comando <command>VACUUM ANALYZE</command>.

source: For PostgreSQL 7.4.x and below, run the <command>SELECT UPDATE_GEOMETRY_STATS()</command> command.
es: Para PostgreSQL 7.4.x o anteriores, ejecuta el comando <command>SELECT UPDATE_GEOMETRY_STATS()</command>.
fr: Pour PostgreSQL 7.4.x et antérieur, lancez la commande <command>SELECT UPDATE_GEOMETRY_STATS()</command>
it_it: Per PostgreSQL 7.4.x e versioni precedenti, eseguite il comando <command>SELECT UPDATE_GEOMETRY_STATS()</command>.
ja: PostgreSQL 7.4.x以下では、<command>SELECT UPDATE_GEOMETRY_STATS()</command>を実行します。
pt_br: Para o PostgreSQL 7.4.x ou anterior, execute o comando <command>SELECT UPDATE_GEOMETRY_STATS()</command>.

source: Why aren't PostgreSQL R-Tree indexes supported?
es: ¿Por que no están soportados los indices R-Tree de PostgreSQL?
fr: Pourquoi est-ce que les indexes R-Tree PostgreSQL ne sont pas supportés ?
it_it: Perché gli indici R-Tree di PostgreSQL non sono supportati?
ja: なぜPostgreSQLのR木インデクス機能を持たないのですか?
pt_br: Por que o índice do PostgreSQL R-Tree não é suportado?

source: Early versions of PostGIS used the PostgreSQL R-Tree indexes. However, PostgreSQL R-Trees have been completely discarded since version 0.6, and spatial indexing is provided with an R-Tree-over-GiST scheme.
es: En las primeras versiones de PostGIS se utilizaban los indices R-Tree de PostgreSQL. Sin embargo, desde la version 0.6 han sido descartados los indices R-Tree de PostgreSQL, y la indexación espacial esta provista de un esquema R-Tree-over-GiST.
fr: Les versions précédentes de PostGIS utilisaient des index de type R-Tree. Néanmoins, ces index R-Trees ont été supprimés depuis la version 0.6 et l'indexation spatiale est maintenant réalisée par un R-Tree-over-GiST.
it_it: Le prime versioni di PostGIS usavano gli indici R-Tree di PostgreSQL. Tuttavia questi sono stati completamente abbandonati a partire dalla versione 0.6, e l'indicizzazione spaziale viene fornita con un approccio R-Tree attraverso GiST.
ja: PostGISの、かつての版では、PostgreSQLのR木インデクスを使っていましたが、0.6版でPostgreSQLのR木は完全に捨てて、R-Tree-over-GiSTスキームによる空間インデクスを提供しています。
pt_br: Versões mais recentes do PostGIS no PostgreSQL usam indice R-Tree. Por outro lado, PostgreSQL R-Trees foi totalmente descontinuado desde a versão 0.6, e índice espacial é provido com um esquema R-Tree-over-GIST

source: Our tests have shown search speed for native R-Tree and GiST to be comparable. Native PostgreSQL R-Trees have two limitations which make them undesirable for use with GIS features (note that these limitations are due to the current PostgreSQL native R-Tree implementation, not the R-Tree concept in general):
es: Nuestros test han demostrado que la velocidad de búsqueda par indices nativos R-Tree y GiST son comparables. El indice nativo R-Tree de PostgreSQL tiene dos limitaciones no lo hacen apto para su uso con elementos GIS (estas limitaciones son debidas a la implementación nativa actual de R-Tree de PostgreSQL, no del concepto R-Tree en general):
fr: Nos tests ont montré que la vitesse de recherche des indexes R-Tree et GiST est comparable. Les R-Tree PostgreSQL ont deux limitations qui les rendent inintéressants pour une utilisation avec des objets SIG (notez que ces limitations sont dues à l'implémentation native des R-Tree dans PostgreSQL, pas au concept de R-Tree en général):
it_it: I nostri test hanno mostrato che la velocità di ricerca per gli indici nativi con R-tree e quelli con GiST sono paragonabili. Gli indici nativi di PostgreSQL hanno due limitazioni che li rendono non desiderabili quando si tratta di elementi GIS (si noti che queste limitazioni sono dovute all'attuale implementazione degli indici R-Tree da parte di PostgreSQL e non al concetto di R-Tree in generale):
ja: 私たちの試験では、R木とGiSTの検索速度は同程度であることが示されています。PostgreSQLのR木には、GISフィーチャーで使うためには好ましくない二つの制限があります (これらの制限は現在のPostgreSQLネイティブのR木実装についてであって、R木一般の話ではありません)。
pt_br: Nossos testes tem mostrado que a velocidade de busca para o índice nativo R-Tree e o GIST são comparáveis. O nativo R-Tree tem duas limitações que dele indesejável para utlizar com funcionalidades GIS (note que essa limitação é devido a atual implementação do PostgreSQL, não do conceito R-Tree em geral):

source: R-Tree indexes in PostgreSQL cannot handle features which are larger than 8K in size. GiST indexes can, using the "lossy" trick of substituting the bounding box for the feature itself.
es: Los indices R-Tree en PostgreSQL no pueden manejar elementos mayores de 8K de tamaño. Los indices GiST pueden, utilizando el truco "lossy" para substituir la caja del elemento en si mismo.
fr: Dans PostgreSQL, les index R-Tree ne peuvent pas gérer des objets qui sont plus grands que 8K en taille. Les index GiST le peuvent, en utilisant le truc "approximatif" de substituer la boîte d'encombrement à l'objet lui-même.
ja: PostgreSQLのR木インデクスは、8K以上のサイズのフィーチャーは扱えません。GiSTインデクスはフィーチャー自体の代わりにバウンディングボックスを用いる「不可逆」トリックを使っているので扱うことができます。
pt_br: Índices R-Tree no PostgreSQL não podem manipular funcionalidades que são maiores que 8K em tamanho. Já os índices GIST podem, utilizando o truque "lossy" de substituição da bounding pela própria funcionalidade.

source: R-Tree indexes in PostgreSQL are not "null safe", so building an index on a geometry column which contains null geometries will fail.
es: Los indices r-Tree de PostgreSQL no son seguros con valores nulos, así que construir un indice en una columna de geometrías que contiene valores nulos fallará.
fr: Dans PostgreSQL, les index R-Tree ne sont pas "null safe", donc construire un index sur une colonne geometry qui contient des géométries nulles échouera.
it_it: Gli indici R-Tree di PostgreSQL non sono "a prova di NULL", per cui creare un indice su una colonna di geometria che contenga valori nulli non funzionerà.
ja: PostgreSQLのR木インデクスは「NULLセーフ」ではなく、NULLジオメトリを含むジオメトリカラムではインデクス作成に失敗します。
pt_br: Índices R-Tree no PostgreSQL não são "null sage", então construir um índice em uma coluna geometry que contenha null, falhará.

source: Why should I use the <varname>AddGeometryColumn()</varname> function and all the other OpenGIS stuff?
es: ¿Por que debería utilizar la función <varname>AddGeometryColumn()</varname> y todas las herramientas OpenGIS?
fr: Pourquoi est-il mieux d'utiliser la fonction <varname>AddGeometryColumn()</varname> et toutes les autres fonctionnalités de PostGIS ?
it_it: Perché dovrei usare la funzione <varname>AddGeometryColumn()</varname> e tutti gli altri elementi OpenGIS?
ja: なぜ <varname>AddGeometryColumn()</varname>関数と他のOpsnGIS関数を使うべきなのですか?
pt_br: Porque eu devo utilizar a função <varname>AddGeometryColumn()</varname> e todas as outras coisas do OpenGIS?

source: If you do not want to use the OpenGIS support functions, you do not have to. Simply create tables as in older versions, defining your geometry columns in the CREATE statement. All your geometries will have SRIDs of -1, and the OpenGIS meta-data tables will <emphasis>not</emphasis> be filled in properly. However, this will cause most applications based on PostGIS to fail, and it is generally suggested that you do use <varname>AddGeometryColumn()</varname> to create geometry tables.
es: Si no quieres utilizar el soporte de funciones OpenGIS, no tienes por que hacerlo. Simplemente crea tablas como en versiones anteriores, definiendo tus columnas de geometrías en el comando CREATE. Todas tus geometrias tendrán un valor de -1 en el SRID, y las tablas de metadatos OpenGIS <emphasis>no</emphasis> se cumplimentaran correctamente. De todas cromas, esto hará que muchas de las aplicaciones basadas en PostGIS fallen, y generalmente se sugiere que debes utilizar <varname>AddGeometryColumn()</varname> para crear tablas geométricas.
fr: SI vous ne souhaitez pas utiliser les fonctions de l'OpenGIS, vous n'avez pas à le faire. Dans ce cas, créez simplement vos tables comme cela se faisait auparavant en spécifiant votre colonne géométrique lors du processus de création (CREATE). Toutes vos géométries auront alors -1 pour SRID et la table de métadonnées OpenGIS <emphasis>ne sera pas</emphasis> remplie correctement. Néanmoins, cela entraînera des erreurs pour la plupart des applications utilisant PostGIS et il est généralement conseillé d'utiliser <varname>AddGeometryColumn()</varname> pour créer votre table géométrique.
it_it: Se non volete utilizzare le funzioni di supporto per OpenGIS, non siete obbligati. E' sufficiente creare le tabelle come nelle versioni più vecchie, definendo le colonne per la geometria nel comando CREATE. Tutte le geometrie avranno uno SRID uguale a -1, e le tabelle con i metadati OpenGIS <emphasis>non</emphasis> saranno compilate correttamente. Tuttavia, ciò farà sì che la maggior parte delle applicazioni basate su PostGIS abbia problemi, e in genere è consigliabile usare <varname>AddGeometryColumn()</varname> per creare tabelle con la geometria.
ja: OpenGIS関数を使いたくないのでしたら、使う必要はありません。単純にジオメトリカラムをCREATEステートメントで定義する古いやり方で作成して下さい。全てのジオメトリはSRIDが-1になり、OpenGISメタデータテーブルは適切に<emphasis>書き込まれません</emphasis>。これによって、ほとんどのPostGISベースのアプリケーションでは失敗します。一般的には<varname>AddGeometryColumn()</varname>を用いることをお勧めします。
pt_br: Se você não quer utlizar o suporte à funções OpenGIS, você não precisa. Simplesmente crie tabelas como nas versões antigas, definindo as colunas geometry no comando CREATE. Todas suas geometrias terão SRIDs de -1, e as tabelas de metadados do OpenGIS <emphasis>não</emphasis> serão preenchidas apropriadamente. No entanto, causará falha na maioria das aplicações baseadas no PostGIS, e é geralmente aconselhado que utilize <varname>AddGeometryColumn()</varname> para criar tabelas geometry.

source: MapServer is one application which makes use of the <varname>geometry_columns</varname> meta-data. Specifically, MapServer can use the SRID of the geometry column to do on-the-fly reprojection of features into the correct map projection.
es: MapServer es una aplicación que hace uso de los metadatos de la tabla <varname>geometry_columns</varname>. Especificamente, MapServer puede utilizar el SRID de la columna de geometrías para hacer reproyecciones al vuelo de los elementos en la proyección correcta del mapa.
fr: MapServer est l'une des applications qui utilise les métadonnées de la table <varname>geometry_columns</varname>. Plus spécifiquement, MapServer peut utiliser le SRID spécifié dans la table géométrique afin d'effectuer des reprojections à la volée conforme à la projection de la carte.
it_it: MapServer è un'applicazione che fa uso dei medatati <varname>AddGeometryColumn()geometry_columns</varname>. In particolare, MapServer può utilizzare il valore SRID della colonna geometrica per eseguire riproiezioni cartografiche al volo.
ja: MapServerは<varname>geometry_columns</varname>メタデータを使うアプリケーションのひとつです。踏み込んでいえば、MpaServerはジオメトリカラムのSRIDを使って、正しい地図投影へのフィーチャーの自動投影変換を行います。
pt_br: MapServer é uma aplicação que faz uso de <varname>geometry_columns</varname> metadado. Especificamente, MapServer pode user SRID da coluna geometry para fazer reprojeção on-the-fly das funcionalidades dentro de uma correta projeção no mapa.

source: What is the best way to find all objects within a radius of another object?
es: ¿Cual es la mejor manera de encontrar objetos en el radio de otro objeto?
fr: Quelle est la meilleure méthode pour trouver les objets qui sont dans un certains rayons d'un autre objet ?
it_it: Qual è il modo migliore per trovare tutti gli oggetti entro un dato raggio da un altro oggetto?
ja: 半径内にあるオブジェクトを全て検索する最善の方法は何ですか?
pt_br: Qual é a melhor maneira de achar todos os objetos dentre um radius e outro objeto?

source: To use the database most efficiently, it is best to do radius queries which combine the radius test with a bounding box test: the bounding box test uses the spatial index, giving fast access to a subset of data which the radius test is then applied to.
es: Para utilizar la base de datos de la forma mas eficiente, lo mejor para hacer consultas por radio es combinar los test de radio y el test de cajas: los test de cajas utilizan los indices espaciales, dando un acceso rápido a los subconjuntos de datos a los cuales se les aplica los test de radio.
fr: Pour utiliser la base de données de la manière la plus efficace possible, il est préférable de faire des requêtes de plus proches voisins qui combinent le test de distance et un test sur une étendue ("bounding box") : la bounding box utilise l'indexation spatiale, donnant accès rapide à un sous-ensemble de données sur lequel le test de distance est ensuite appliqué.
it_it: Per utilizzare il database in modo efficiente, la cosa migliore è eseguire le query con un raggio assieme al test sulla bounding box: il test sulla bounding box ricorre all'indice spaziale, dando un accesso velocizzato a un sottoinsieme dei dati cui poi viene applicato il test sul raggio.
ja: データベースを最も効果的に使うには、半径検索とバウンディングボックス検索を組み合わせた半径検索を行うのが最も良いです。バウンディングボックス検索で空間インデクスを使用するので、半径検索が適用されるサブセットへのアクセスが早くなります。
pt_br: Para usar a base de dados mais eficientemente, é melhor fazer radius queries que combine com teste radius com teste bounding box: o teste bounding box usa índice espacial, dando rapidez no acesso para subconjunto de dados que o teste radius é aplicada.
