Repository: postgis/postgis
Catalog: doc/po/*/faq.xml.po
Languages: es, fr, it_it, ja, pt_br

source: The <varname>ST_DWithin(geometry, geometry, distance)</varname> function is a handy way of performing an indexed distance search. It works by creating a search rectangle large enough to enclose the distance radius, then performing an exact distance search on the indexed subset of results.
es: La función <varname>ST_DWithin(geometry, geometry, distance)</varname> es una forma practica de hacer consultas de búsqueda de distancia indexada. Funciona creando un rectángulo de búsqueda lo suficientemente grande para abarcar el radio de distancia, y después haciendo una búsqueda exacta de distancia en el indice del subconjunto de resultados.
fr: La fonction <varname>ST_DWithin(geometry, geometry, distance)</varname> est un moyen pratique pour effectuer un recherche indexée sur une distance. Cela fonctionne en créant une recherche rectangulaire suffisamment large pour contenir le rayon de distance, pour ensuite effectuer une recherche par distance exacte portant sur un sous-ensemble de résultats indexés.
it_it: La funzione <varname>ST_DWithin(geometry, geometry, distance)</varname> è un sistema pratico per eseguire una ricerca per distanza indicizzata. Funziona creando un rettangolo di ricerca grande abbastanza da racchiudere il raggio di distanza specificato, e poi eseguendo una ricerca per distanza precisa sul sottoinsieme dei risultati, che viene indicizzato.
ja: <varname>ST_DWithin(geometry, geometry, distance)</varname>関数は、インデクス付きの距離検索を実行する手軽な方法です。この関数は、距離半径を十分に含む大きさの検索矩形を作成して、 インデクス付きの結果サブセットに対して確実な距離検索を行います。
pt_br: A função <varname>ST_DWithin(geometry, geometry, distance)</varname> é uma forma conveniente de realizar uma busca distante no índice. Ele trabalha criando retângulo de busca suficiente para encobrir todo o raio, depois realiza uma busca exata da distância no subconjunto de resultados do índice.

source: For example, to find all objects with 100 meters of POINT(1000 1000) the following query would work well:
es: Por ejemplo, para encontrar todos los objetos a 100 metros del punto POINT(1000 1000), la siguiente consulta funcionara correctamente:
fr: Par exemple, pour trouver tous les objets qui sont dans les 100 mètres du POINT(1000 1000), la requête suivante fonctionne très bien :
it_it: Per esempio, per trovare tutti gli oggetti entro 100 metri dal punto POINT(1000 1000), la seguente query funzionerebbe bene:
ja: たとえば、POINT(1000 1000)から100メートル内の全てのオブジェクトを見つけるためには、次のクエリで動作します。
pt_br: Por exemplo, para encontrar todos os objetos com 100 metros de POINT(1000 1000) a query a seguir trabalharia corretamente:

source: How do I perform a coordinate reprojection as part of a query?
es: ¿Como puedo realizar una reproyección como parte de una consulta?
fr: Comment procéder à de la reprojection de coordonnées dans une requête ?
it_it: Come posso eseguire una riproiezione di coordinate come parte di una query?
ja: クエリの一部として投影変換を実現するにはどうしますか?
pt_br: Como posso fazer uma reprojeção de coordenadas como parte de uma query?

source: To perform a reprojection, both the source and destination coordinate systems must be defined in the SPATIAL_REF_SYS table, and the geometries being reprojected must already have an SRID set on them. Once that is done, a reprojection is as simple as referring to the desired destination SRID. The below projects a geometry to NAD 83 long lat. The below will only work if the srid of the_geom is not -1 (not undefined spatial ref)
es: Para realizar una reproyección, el sistema de coordenadas de las tablas origen y destino debe estar definido en la tabla SPATIAL_REF_SYS, y las geometrías reproyectadas deben tener definido un sistema de coordenadas SRID en ellas. Una vez hecho esto, una reprojección es tan simple como hacer una referencia al SRID deseado. La consulta siguen reproyecta una geometría a NAD 83 long lat. La consulta siguiente solo funcionará si el srid de la geometría no es -1 (referencia espacial no definida)
fr: Pour procéder à une reprojection, les systèmes de coordonnée source et destination doivent être définis dans la table SPATIAL_REF_SYS, et les géométries reprojetées doivent déjà posséder un SRID. Une fois ceci fait, une reprojection est aussi simple que de se référer au SRID de destination désiré. Ci-dessous on projette une géométrie vers long lat NAD 83. Ceci ne fonctionne que si le srid de the_geom n'est pas -1 (référence spatiale non définie)
it_it: Per eseguire una riproiezione, sia il sistema di riferimento di coordinate di origine che quello di destinazione devono essere definiti nella tabella SPATIAL_REF_SYS, e le geometrie da riproiettare devono già avere uno SRID assegnato. Fatto questo, la riproiezione è semplice come riferirsi allo SRID desiderato per la destinazione. L'esempio proietta una geometria in NAD 83 long lat. Il caso sotto funzionerà solamente se lo SRID di the_geom non è -1 (il riferimento spaziale non deve essere indefinito).
ja: 投影変換を行うには、変換元と変換先双方の座標系がSPATIAL_REF_SYSテーブルに定義されていて、 かつ投影変換されるジオメトリがそのSRIDを持っている必要があります。これが行われていると、投影変換は求める変換先SRIDを参照するのと同じぐらい簡単です。次のクエリは、ジオメトリをNAD 83経度緯度に投影しています。このクエリはthe_geomが-1 (空間参照系が定義されていない)でない場合のみ動作します。
pt_br: Para realizar uma reprojeção, ambos as coordenadas fonte e destino devem estar definidas na tabela SPATIAL_REF_SYS, e a geometria reprojetada deve já ter um SRID setado para ela. Uma vez isso feito, a reprojeção é taõ simples quanto referenciar um SRID de destino desejado. The below projects a geometry to NAD 83 long lat. Abaixo apenas trabalhará se o srid do the_geom não for -1 (não indefinido spatial ref)

source: I did an ST_AsEWKT and ST_AsText on my rather large geometry and it returned blank field. What gives?
es: He hecho un ST_AsEWKT y un ST_AsText en una geometría bastante grande y me devuelve un campo en blanco.¿Que a pasado?
fr: J'ai fait un ST_AsEWKT et un ST_AsText sur de grandes géométries et j'ai obtenu une réponse vide. Qu'est-il arrivé ?
it_it: Ho eseguito una ST_AsEWKT e ST_AsText su una geometria piuttosto grossa ed ho ottenuto un campo vuoto. Come mai?
ja: ST_AsEWKTとST_AsTextとを、かなり大きいジオメトリで実行すると、空のフィールドが返りました。どうしたら良いですか?
pt_br: Faço uma ST_AsEWKT e ST_AsText na minha maior geometria e isso me retorna em branco. O que acontece?

source: You are probably using PgAdmin or some other tool that doesn't output large text. If your geometry is big enough, it will appear blank in these tools. Use PSQL if you really need to see it or output it in WKT.
es: Probablemente estes utilizando PgAdmin o otra herramienta que no es capaz de mostrar texto largo. Si tu geometría es lo suficientemente grande, aparecerá en blanco en estas herramientas. Utiliza PSQL si realmente necesitas ver o extraer la geometría en WKT.
fr: Vous utilisez probablement PgAdmin ou un autre outils qui ne supportent pas les réponses longues. Si votre géométrie est très grosse, elle ne s'affichera pas dans ces outils. Utilisez PSQL si vous devez la visualiser ou exporter la en WKT.
it_it: Probabilmente stato usando PgAdmin o qualche altro strumento che non dà in uscita testi di grandi dimensioni. Se la vostra geometria è abbastanza grande, risulterà vuota in questi strumenti. Se dovete vederla o dovete vedere l'uscita in formato WKT potete usare PSQL,
ja: pgAdminまたは大きなテキストを表示しないその他のツールを使用しているのかも知れません。 ジオメトリが十分に大きい場合、ツールには空として表示されます。本当にWKTで見たり出力したりしなければならない場合は、PSQLを使用して下さい。
pt_br: Vocês está provavelmente utilizando PgAdmin ou outra ferramenta que não retorna grandes textos. Se sua geometria é muito grande, aparecerá vazio nessas ferramentas. Use PSQL se você realmente precisa ver isso ou retornar em WKT.

source: --To check number of geometries are really blank SELECT count(gid) FROM geotable WHERE the_geom IS NULL;
es: -- Para comprobar el numero de geometrías que están realmente en blanco SELECT count(gid) FROM geotable WHERE the_geom IS NULL;
fr: --Pour vérifier le nombre de géométries qui sont réellement vides SELECT count(gid) FROM geotable WHERE the_geom IS NULL;
it_it: --Per verificare il numero di geometrie che sono effettivamente vuote SELECT count(gid) FROM geotable WHERE the_geom IS NULL;
ja: -- 本当に空のジオメトリの数を検索します SELECT count(gid) FROM geotable WHERE the_geom IS NULL;
pt_br: Para verificar o de geometrias que realmente estão vazias: SELECT count(gid) FROM geotable WHERE the_geom IS NULL;

source: When I do an ST_Intersects, it says my two geometries don't intersect when I KNOW THEY DO. What gives?
es: Cuando hago un ST_Intersects, me dice que mis dos geometrías no se intersectan cuando SE QUE SI LO HACEN. ¿Que esta pasando?
fr: Quand je fais un ST_Intersects, il me répond que mes deux géométries ne s'intersectent pas alors que JE SAIS QUE C'EST LE CAS. Qu'arrive-t-il ?
it_it: Quando eseguo ST_Intersects, mi dice che le mie due geometrie non si intersecano, mentre SO CHE LO FANNO. Come mai?
ja: ST_Intersectsを使うと、二つのジオメトリがインタセクトしているのが分かっているのに、インタセクトしていないと言います。どうしたら良いですか?
pt_br: Quando eu faço um ST_Intersects, tenho o retorno que minhas duas geometrias não intersectam quando EU SEI QUE SIM. O que acontece?

source: This generally happens in two common cases. Your geometry is invalid -- check <xref linkend="ST_IsValid"/> or you are assuming they intersect because ST_AsText truncates the numbers and you have lots of decimals after it is not showing you.
es: Esto ocurre generalmente en dos casos comunes. Tu geometría no es valida -- check <xref linkend="ST_IsValid"/> o estas asumiendo que se interceptan por que ST_AsText recorta el numero de decimales y tienes un montón de decimales después que no se muestran.
fr: Cela arrive généralement dans deux configurations. Votre géométrie est invalide -- vérifier avec <xref linkend="ST_IsValid"/> ou vous pensez que vos géométries s'intersectent du fait que ST_AsText tronque les chiffres et vous avez après de nombreuses décimales qui ne sont pas affichées.
it_it: Ciò in genere accade in due casi frequenti. O la tua geometria non è valida (controlla <xref linkend="ST_IsValid"/>), oppure presumi che si intersechi perche ST_AsText esegue un troncamento dei numeri e hai molti decimali che non vengono mostrati.
ja: 二つの場合がよくあります。一つは、ジオメトリが不正な場合です。<xref linkend="ST_IsValid"/>で確認できます。もう一つは、ST_AsTextで数字を切り捨てていて、表示されている分より後にたくさんの小数が付いている場合です。
pt_br: Isso geralmente acontece em dois casos comuns. Sua geometri é inválida -- verifique <xref linkend="ST_IsValid"/> ou or você está assumindo que elas intesectam porque ST_AsText trucou os números e você tem muitos decimais que não estão sendo exibidos a você.

source: I am releasing software that uses PostGIS, does that mean my software has to be licensed using the GPL like PostGIS? Will I have to publish all my code if I use PostGIS?
es: Estoy desarrollando software que utiliza PostGIS, ¿quiere decir esto que mi software debe tener licencia GPL como PostGIS?¿Tengo que liberar todo mi código si utilizo PostGIS?
fr: Je vais sortir un logiciel qui utilise PostGIS, est-ce que cela veut dire que mon logiciel doit être sous licence GPL tel que PostGIS ? Vais-je devoir publier tout mon code source si j'utilise PostGIS ?
it_it: Sto rilasciando software che utilizza PostGIS. Significa che dovrà utilizzare per questo la licenza GPL come PostGIS? Dovrò pubblicare tutto il mio codice se uso PostGIS?
ja: PostGISを用いたソフトウェアをリリースしています。PostGISのようにGPLライセンスを使う必要があるのでしょうか?PostGISを使うとコードを全て公開しなければならないのでしょうか?
pt_br: Estou liberando software que usa PostGIS, o que significa que meu software foi licenciado utilizado a GPL como PostGIS? Terei que publicar todo o meu código se utilizar o PostGIS?

source: Almost certainly not. As an example, consider Oracle database running on Linux. Linux is GPL, Oracle is not: does Oracle running on Linux have to be distributed using the GPL? No. Similarly your software can use a PostgreSQL/PostGIS database as much as it wants and be under any license you like.
es: Casi seguro que no. Como ejemplo, considere la base de datos Oracle ejecutandose en Linux. Linux es GPL, Oracle no: ¿Oracle tiene que ser distribuido usando la GPL? No. De manera similar, su software puede usar una base de datos PostgreSQL / PostGIS tanto como lo desee y estar bajo la licencia que desee.
ja: ほぼ確実に違います。 例として、Linux上で動作するOracleを考えてみます。 LinuxはGPLでOracleは違いますが、Linuxで動作するOracleはGPLで配布しなければならないでしょうか?違います。あなたのソフトウェアはPostgreSQL/PostGISデータベースを好きなだけ使うことができ、ライセンスは好きなようにできます。

source: The only exception would be if you made changes to the PostGIS source code, and <emphasis>distributed your changed version</emphasis> of PostGIS. In that case you would have to share the code of your changed PostGIS (but not the code of applications running on top of it). Even in this limited case, you would still only have to distribute source code to people you distributed binaries to. The GPL does not require that you <emphasis>publish</emphasis> your source code, only that you share it with people you give binaries to.
es: La única excepción sería si realizó cambios en el código fuente de PostGIS y <emphasis> distribuyó su versión modificada </emphasis> de PostGIS. En ese caso, tendría que compartir el código de su PostGIS modificado (pero no el código de las aplicaciones que se ejecutan sobre él). Incluso en este caso limitado, solo tendría que distribuir el código fuente a las personas a las que distribuyó binarios. La GPL no requiere que <emphasis> publique </emphasis> su código fuente, solo que lo comparta con la gente a la que le da binarios.
ja: PostGISソースコードに変更を加えて、変更したPostGISを配布したときだけは例外です。この場合、変更したPostGISのコードを共有しなければなりません (PostGIS上で動作するアプリケーションのコードではありません)。この限られた場合でも、ソースコードはバイナリの配布相手にだけ配布します。GPLはソースコードの<emphasis>公開</emphasis>までは求めておらず、バイナリを配布した相手との共有を求めています。

source: The above remains true even if you use PostGIS in conjunction with the optional CGAL-enabled functions. Portions of CGAL are GPL, but so is all of PostGIS already: using CGAL does not make PostGIS any more GPL than it was to start with.
es: Lo anterior sigue siendo cierto incluso si utiliza PostGIS junto con las funciones opcionales habilitadas para CGAL. Algunas partes de CGAL son GPL, pero también lo es todo PostGIS: usar CGAL no hace que PostGIS sea más GPL de lo que era para comenzar.
ja: CGALを使った関数とともにPostGISを使ってでも、このことに違いはありません。CGALのライセンスの一つにGPLがありますが、PostGISの全てが既にGPLですので、CGALによってPostGISの元々のライセンスよりも厳しくなることはありません。

source: OpenGeo has a step by step tutorial guide workshop <ulink url="http://workshops.boundlessgeo.com/postgis-intro/">Introduction to PostGIS</ulink>. It includes packaged data as well as intro to working with OpenGeo Suite. It is probably the best tutorial on PostGIS.
fr: OpenGeo a un tutoriel pas à pas sous forme d'atelier <ulink url="http://workshops.boundlessgeo.com/postgis-intro/">Introduction à PostGIS</ulink>. Il comprend des jeux données ainsi que l'intro pour travailler avec OpenGeo Suite. C'est probablement le meilleur tutoriel sur PostGIS.
pt_br: OpenGeo tem uma oficina passo a passo <ulink url="http://workshops.boundlessgeo.com/postgis-intro/">Introdução ao PostGIS</ulink>. Inclui dados para testes e uma introdução sobre como trabalhar com a OpenGeo Suite. Possivelmente o melhor tutorial sobre PostGIS.
