Repository: postgis/postgis
Catalog: doc/po/*/faq.xml.po
Languages: es, fr, it_it, ja, pt_br

source: -- To tell just how large your geometry is do a query of the form --which will tell you the most number of points you have in any of your geometry columns SELECT MAX(ST_NPoints(geom)) FROM sometable;
es: -- Para saber como es de larga tu geometría haz una consulta de forma -- que te de el mayor numero de puntos que tienes en cualquier columna de geometrías SELECT MAX(ST_NPoints(geom)) FROM sometable;
fr: -- Pour connaître la taille de votre géométrie faîtes une requête de ce type -- qui vous indiquera le plus grand nombre de points vous avez dans vos géométries SELECT MAX(ST_NPoints(geom)) FROM sometable;
it_it: -- Per conoscere giusto la dimensione di una geometria, è possibile eseguire una query in una forma --che vi dirà il più elevato numero di punti in una colonna di geometria SELECT MAX(ST_NPoints(geom)) FROM sometable;
ja: -- ジオメトリがどれぐらい大きいかを調べるには -- ジオメトリカラムの中でジオメトリごとに、それが持つポイントの数を -- 尋ねるかたちのクエリを実行します SELECT MAX(ST_NPoints(geom)) FROM sometable;
pt_br: -- Para ter uma ideia do tamanho de sua geometria, faça a query que vai lhe dizer o numero de pontos em suas colunas SELECT MAX(ST_NPoints(geom)) FROM tabela;

source: What kind of geometric objects can I store?
es: ¿Qué tipo de objetos geométricos puedo almacenar?
fr: Quelles sont les objets géométriques que je peux sauvegarder ?
it_it: Quale tipo di oggetti geometrici posso memorizzare?
ja: どの種類のジオメトリオブジェクトを格納できますか?
pt_br: Quais tipos de objetos geométricos posso armazenar?

source: You can store Point, LineString, Polygon, MultiPoint, MultiLineString, MultiPolygon, and GeometryCollection geometries. In PostGIS 2.0 and above you can also store TINS and Polyhedral Surfaces in the basic geometry type. These are specified in the Open GIS Well Known Text Format (with Z, M, and ZM extensions). There are three data types currently supported. The standard OGC geometry data type which uses a planar coordinate system for measurement, the geography data type which uses a geodetic coordinate system, with calculations on either a sphere or spheroid. The newest family member of the PostGIS spatial type family is raster for storing and analyzing raster data. Raster has its very own FAQ. Refer to <xref linkend="RT_FAQ"/> and <xref linkend="RT_reference"/> for more details.
es: Puede almacenar geometrías Point, LineString, Polygon, MultiPoint, MultiLineString, MultiPolygon y GeometryCollection. En PostGIS 2.0 y superior también se pueden almacenar TINS y superficies poliédricas en el tipo de geometría básica. Éstos se especifican en el Formato de texto bien conocido de GIS abierto (con extensiones Z, M y ZM). Actualmente hay tres tipos de datos soportados. El tipo de datos de geometría OGC estándar que utiliza un sistema de coordenadas planar para la medición, el tipo de datos geográficos que utiliza un sistema de coordenadas geodésicas, con cálculos en una esfera o en esferoide. El más reciente miembro de la familia de tipo espacial en PostGIS es raster para almacenar y analizar los datos raster. Raster tiene su propia FAQ. Refierase a <xref linkend="RT_FAQ"/> y <xref linkend="RT_reference"/> para más detalle.
fr: Vous pouvez stocker des géométries Point, LineString, Polygon, MultiPoint, MultiLineString, MultiPolygon et GeometryCollection. Dans PostGIS 2.0 et ultérieur, vous pouvez aussi stocker des TINS et des surfaces polyhédrales ( Polyhedral Surfaces ) dans le type de base geometry. Ces types sont spécifiés dans le format Open GIS Well Known Text ( avec les extensions Z, M et ZM). Il y a trois types de données actuellement supportés. Le type geometry standard OGC utilise un système de coordonnées planaire pour les valeurs. Le type geography utilise un système de coordonnées géodésique, avec les calculs sur une sphère ou un sphéroïde. Le membre le plus récent de la famille des types de données spatiales de PostGIS est le raster pour stocker et analyser des données raster. Raster possède sa propre FAQ. Voir <xref linkend="RT_FAQ"/> et <xref linkend="RT_reference"/> pour plus de détails.
ja: ポイント、ラインストリング、ポリゴン、マルチポイント、マルチラインストリング、マルチポリゴン、ジオメトリコレクションです。PostGIS 2.0以上では、基本ジオメトリタイプとしてTINと多面体サーフェスも格納できます。これらはOpen GIS Well Known Text形式(XYZ, XYM, XYZM拡張付き)で指定されます。現在サポートされているのは3つのデータ型です。計測に平面座標系を使う標準OGCジオメトリデータ型があります。また、地理座標系を使い、球面または回転楕円体面上の計算を行うジオグラフィデータ型があります。最新のPostGIS空間型群に追加されたのが、ラスタデータの格納と解析に使われるラスタ型です。ラスタ型単独で「よくある質問」を用意しています。詳細については<xref linkend="RT_FAQ"/>と<xref linkend="RT_reference"/>をご覧ください。
pt_br: Você pode armazenar pontos, linhas, polígonos, multipontos, multilinhas, multipolígonos e coleções geométricas. No PostGIS 2.0 e além você também pode armazenar TINS e superfícies poliédricas no tipo básico de geometria. Esses dados estão especificados no Open GIS Well Known Text Format (com extensões Z,M e ZM). Há três tipos de dados que são suportados atualmente. A geometria OGC padrão que utiliza um sistema de coordenadas planas para medidas, o tipo de dados de geografia que utiliza o sistema geodésico de coordenadas, com cálculos na esfera ou esferoide. O mais novo membro da família PostGIS tipo espacial é o raster para armazenar e analisar os dados do raster. existe um FAQ próprio para o raster. Disponível em <xref linkend="RT_FAQ"/> e <xref linkend="RT_reference"/> para mais detalhes.

source: I'm all confused. Which data store should I use geometry or geography?
es: Estoy confundido. ¿Que tipo de datos debo utilizar?¿geométricos o geográficos?
fr: Je suis perdu. Dois-je utiliser un champs de type "geometry" ou "geography" ?
it_it: Sono confuso. Quale tipo di dati dovrei usare, quello geometrico o quello geografico?
ja: たいへん混乱しました。ジオメトリとジオグラフィのどちらを使うべきでしょうか?
pt_br: Estou confuso. Qual tipo de dados devo utilizar, geometria ou geografia?

source: Short Answer: geography is a newer data type that supports long range distances measurements, but most computations on it are slower than they are on geometry. If you use geography, you don't need to learn much about planar coordinate systems. Geography is generally best if all you care about is measuring distances and lengths and you have data from all over the world. Geometry data type is an older data type that has many more functions supporting it, enjoys greater support from third party tools, and operations on it are generally faster -- sometimes as much as 10 fold faster for larger geometries. Geometry is best if you are pretty comfortable with spatial reference systems or you are dealing with localized data where all your data fits in a single <link linkend="spatial_ref_sys">spatial reference system (SRID)</link>, or you need to do a lot of spatial processing. Note: It is fairly easy to do one-off conversions between the two types to gain the benefits of each. Refer to <xref linkend="PostGIS_TypeFunctionMatrix"/> to see what is currently supported and what is not.
es: Respuesta corta: geography es un tipo de datos más reciente que admite mediciones de distancias de largo alcance, pero la mayoría de los cálculos en él son más lentos de lo que son en geometry. Si utiliza la geography, no necesita aprender mucho sobre sistemas de coordenadas planas. Geography es generalmente mejor si lo único que le importa es medir distancias y longitudes y tiene datos de todo el mundo. El tipo de datos geometry es un tipo de datos antiguo que tiene muchas más funciones que lo soportan, disfruta de un mayor soporte de herramientas de terceros, y las operaciones en él son generalmente más rápidas --a veces hasta 10 veces más rápidas para geometrías más grandes. Geometry es mejor si se siente cómodo con los sistemas de referencia espacial o si se trata de datos localizados en los que todos sus datos encajan en un solo <link linkend="spatial_ref_sys"> sistema de referencia espacial (SRID)</link>, o si usted necesita hacer un montón de procesamiento espacial. Es bastante fácil de hacer one-off entre los dos tipos de conversiones para obtener los beneficios de cada uno. Consulte <xref linkend="PostGIS_TypeFunctionMatrix"/> para ver lo que actualmente se soporta y lo que no.
fr: Réponse courte : geography est un type de données récent qui supporte les calculs de distance sur de grandes étendues, mais la plupart des calculs l'utilisant sont plus lent que ceux avec le type geometry. Si vous utilisez geography, vous n'avez pas besoin de vous préoccuper de systèmes de coordonnées planaires. Geography est en général meilleur si tout ce qui vous importe est de mesurer des distances et des longueurs et que vous avez des données couvrant le monde entier. Le type de données geometry est plus ancien et a beaucoup plus de fonctions disponibles, un plus grand support des outils externes, et des calculs qui sont généralement plus rapide -- parfois jusqu'à 10 fois plus rapide pour de grosses géométries . Geometry est meilleur si vous connaissez les systèmes de référence spatiale ou si vous avez de la donnée locale qui tient toute dans un seul <link linkend="spatial_ref_sys">système de référence spatial ( SRID)</link>, ou que vous faites beaucoup de traitement spatiaux. Note : il est assez simple de faire des conversions entre les deux types pour bénéficier des avantages de chacun. Se référer à <xref linkend="PostGIS_TypeFunctionMatrix"/> pour voir ce qui est actuellement supporté et ce qui ne l'est pas pour chaque type.
ja: 短い答: ジオグラフィは長距離の測定をサポートする新しいデータ型ですが、計算速度は現在のところジオメトリの計算より遅いです。ジオグラフィを使う場合は、平面座標系についてあまり多く学習する必要がありません。行うことが距離や長さの計測に限定され、かつ世界中からのデータを持っている場合は、一般的にジオグラフィが最善です。ジオメトリは古いデータ型で、サポートする関数が多く、サードパーティからの多大なサポートが得られます。計算速度も早く、大きなジオメトリでは10倍違います。空間参照系に慣れているか、<link linkend="spatial_ref_sys">空間参照系 (SRID)</link>が単一で済むような局所的なデータを扱っているか、あるいは、空間処理を多く行う必要がある場合には、ジオメトリが最善です。ご注意: 簡単に二つの型の相互変換を行ってそれぞれの利点を得ることができます。現在サポートされているもの、サポートされていないものについては<xref linkend="PostGIS_TypeFunctionMatrix"/>を参照して下さい。
pt_br: Resposta curta: geografia é um novo tipo de dados que suporta medições de distância de longo alcance, mas a maioria dos cálculos sobre ele estão atualmente mais lento do que são na geometria. Se você usar geografia -- você não precisará aprender muito sobre sistemas de coordenadas planar. Geografia é geralmente melhor se tudo o que importa é a medição de distâncias e comprimentos e você tem dados de todo o mundo. Tipo de dado geometria é um tipo mais antigo de dados que possui mais funções que o suportam, goza de maior apoio de ferramentas de terceiros, e as operações nele contidas são geralmente mais rápidas -- às vezes até 10 vezes mais rápido para geometrias maiores. Geometria é melhor se você se sentir confortável com sistemas de referência espacial ou se estiver lidando com dados localizados onde todos seus dados se encaixam em um único <link linkend="spatial_ref_sys">Sistema Espacial de Referência (SRID)</link>, ou você precisará fazer muito processamento espacial. Nota: É bastante fácil de fazer conversões pontuais entre dois tipos para ganhar os benefícios de cada. Consulte <xref linkend="PostGIS_TypeFunctionMatrix"/> para ver o que é e não é suportado.

source: Long Answer: Refer to our more lengthy discussion in the <xref linkend="PostGIS_GeographyVSGeometry"/> and <link linkend="PostGIS_TypeFunctionMatrix">function type matrix</link>.
es: Respuesta larga: Te invitamos a nuestro largo debate en <xref linkend="PostGIS_GeographyVSGeometry"/> y <link linkend="PostGIS_TypeFunctionMatrix">Matriz funciones tipos</link>.
fr: Réponse plus longue ; référez vous à notre longue discussion sur <xref linkend="PostGIS_GeographyVSGeometry"/> et <link linkend="PostGIS_TypeFunctionMatrix">matrice de type de fonction</link>.
it_it: Risposta lunga: ti rimandiamo alla discussione più estesa <xref linkend="PostGIS_GeographyVSGeometry"/> e <link linkend="PostGIS_TypeFunctionMatrix">matrice dei tipi di funzione</link>.
ja: 長い答: <xref linkend="PostGIS_GeographyVSGeometry"/>と<link linkend="PostGIS_TypeFunctionMatrix">function type matrix</link>とを参照して下さい。
pt_br: Resposta longa: Se refere a nossa mais longa discurssão no <xref linkend="PostGIS_GeographyVSGeometry"/> e <link linkend="PostGIS_TypeFunctionMatrix"> tipo de função matriz</link>.

source: I have more intense questions about geography, such as how big of a geographic region can I stuff in a geography column and still get reasonable answers. Are there limitations such as poles, everything in the field must fit in a hemisphere (like SQL Server 2008 has), speed etc?
es: Tengo preguntas mas complejas sobre el typo geógrafo, como por ejemplo, como de grande es la región que puedo almacenar en una columna geográfica y tener respuestas razonables. ¿Hay limitaciones como por ejemplo los polos, todo el contenido del campo debe estar en un hemisferio (como ocurre con con SQL Server 2008), velocidad etc?
fr: J'ai d'autres questions plus avancées sur le type geography, comme la taille d'une région géographique que je peux mettre dans une colonne geography pour continuer à avoir des requêtes performantes. Ou bien s'il y a des limitations, comme aux pôles, ou si toutes les données doivent tenir dans un hémisphère (comme dans SQL server 2008), ou bien sur la vitesse d'exécution, etc.
it_it: Ho altre domande più profonde sulla geografia, ad esempio qual è la massima dimensione di una regione geografica che posso inserire in una colonna di tipo geography per continuare ad avere risultati ragionevoli. Ci sono limitazioni ai poli, tutto deve essere in un unico emisfero (come per SQL Server 2008)?
ja: もっとジオグラフィについて聞きたいです。 たとえば、ジオグラフィカラムにデータを入れて合理的な答えが得られる領域範囲はどれぐらいでしょうか、とか。極、全データが半球上になければならないのでしょうか(SQL Server 2008はそう)、速度等の制限はあるのでしょうか、とか。
pt_br: Tenho questões mais aprofundadas sobre geography, tais como quão grande a geografia de uma região pode ser adicionada em uma coluna geography e continua razoavelmente responsiva. Existem limitações tais como pólos, tudo no campo deve caber em um hemisfério (como SQL Server 2008 tem), velocidade etc?

source: Your questions are too deep and complex to be adequately answered in this section. Please refer to our <xref linkend="PostGIS_Geography_AdvancedFAQ"/>.
es: Tu pregunta es demasiado compleja y extensa, para obtener una respuesta en esta sección. Puedes ver la respuesta en <xref linkend="PostGIS_Geography_AdvancedFAQ"/>.
fr: Vos questions sont trop complexes et trop importantes pour être suffisamment détaillées ici. Référez vous à notre <xref linkend="PostGIS_Geography_AdvancedFAQ"/>.
it_it: Le tue domande sono troppo profonde e complesse per avere una risposta in questa sezione del documento. Ti rimandiamo alle nostre <xref linkend="PostGIS_Geography_AdvancedFAQ"/>.
ja: その質問は相当深く複雑で、このセクションで十分に答えられません。<xref linkend="PostGIS_Geography_AdvancedFAQ"/>を参照して下さい。
pt_br: Suas perguntas são profundas e complexas para serem respondindas de forma adequada nesta seção. Por favor, refira-se ao documento <xref linkend="PostGIS_Geography_AdvancedFAQ"/>.

source: How do I insert a GIS object into the database?
es: ¿Como puedo insertar objetos SIG en la base de datos?
fr: Comment est-ce que j'insère un objet SIG dans une base de données ?
it_it: Come posso inserire un oggetto GIS nel database?
ja: GISオブジェクトをデータベースに挿入するにはどうしますか?
pt_br: Como insiro um objeto GIS dentro do banco de dados?

source: First, you need to create a table with a column of type "geometry" or "geography" to hold your GIS data. Storing geography type data is a little different than storing geometry. Refer to <xref linkend="Geography_Basics"/> for details on storing geography.
es: Primero, necesitas crear una tabla con una columna de tipo "geometría" o "geografía" para almacenar tus datos SIG. Almacenar datos de tipo geográfico es un poco diferente que almacenar geometrías. Para obtener detalles de como se almacenan los tipos geográficos ves a <xref linkend="Geography_Basics"/>.
fr: D'abords, vous devez créer une table avec une colonne de type "geometry" ou "geography" pour stocker vos données SIG. Stocker des données de type géographique est un petit différent que stocker des géométries. Référez vous à la page <xref linkend="Geography_Basics"/> pour les détails sur le stockage géographique.
it_it: Anzitutto devi creare una tabella con una colonna di tipo "geometry" o "geography" per contenere i dati GIS. Memorizzare i dati di tipo geografico e un po' diverso dal memorizzare dati geometrici. Ti rimandiamo a <xref linkend="Geography_Basics"/> per i dettagli sulla gestione dei dati geografici.
ja: まず、GISデータを保持するために"geometry"または"geogprahy"カラムを持つテーブルを作成します。ジオグラフィデータ型の格納は、ジオメトリデータ型とは若干異なります。ジオグラフィの格納については<xref linkend="Geography_Basics"/>を参照して下さい。
pt_br: Primeiramente, você precisa criar uma tabela com uma coluna do tipo "geometry" ou "geography" para armazenar seus dados GIS. O armazenamento do dado do tipo "geography" é um pouco diferente do tipo "geometry". Consulte o documento <xref linkend="Geography_Basics"/> para detalhes.

source: For geometry: Connect to your database with <filename>psql</filename> and try the following SQL:
es: Para geometrías: Conéctate a tu base de datos con <filename>psql</filename> e intenta ejecutar el siguiente comando SQL:
fr: Pour les géométries : connectez vous à votre base de données avec <filename>psql</filename> et tentez la commande SQL suivante :
it_it: Per la geometria: collegati al database con <filename>psql</filename> e prova a eseguire il seguente codice SQL:
ja: ジオメトリについては、psqlでデータベースに接続して、次のSQLを試してみて下さい。
pt_br: Para geometrias: conecte seu banco de dados com <filename>psql</filename> e tente o seguinte SQL:

source: If the geometry column definition fails, you probably have not loaded the PostGIS functions and objects into this database or are using a pre-2.0 version of PostGIS. See the <xref linkend="PGInstall"/>.
es: Si falla la definición de la columna de geometría, es probable que no haya cargado las funciones y los objetos de PostGIS en esta base de datos o que esté utilizando una versión de PostGIS anterior a la 2.0. Vea el <xref linkend="PGInstall"/>.
fr: Si la définition d'une colonne de géométrie échoue, vous n'avez probablement pas chargé les fonctions et les objets de PostGIS dans la base de données, ou vous utilisez une version de PostGIS antérieure à la 2.0. Voir
ja: ジオメトリカラムの追加に失敗する場合は、もしかしたらPostGISの関数とオブジェクトをデータベースにロードしていないか、2.0より前の版のPostGISなのかも知れません。<xref linkend="PGInstall"/>を参照して下さい。
pt_br: Se a definição da coluna geométrica falhar, você provavelmente não carregou as funções do PostGIS em seu banco de dados ou está usando uma versão pré-2.0. Veja: <xref linkend="PGInstall"/>.

source: Then, you can insert a geometry into the table using a SQL insert statement. The GIS object itself is formatted using the OpenGIS Consortium "well-known text" format:
es: Entonces, podrás insertar geometrías en la tabla utilizando la sentencia SQL insert. El objeto SIG tiene el formato OpenGIS Consortium "well-known text":
fr: Puis, vous pouvez insérer une géométrie dans la table en utilisant une requête SQL insert. L'objet SIG lui même est formaté en utilisant le format "well-known text" de l'OpenGIS Consortium.
it_it: Fatto questo, puoi inserire una geometria nella tabella utilizzando un comando di INSERT SQL. L'oggetto GIS vero e proprio è formattato utilizzando le specifiche "well-known text" dell'OpenGIS Consortium:
ja: これで、SQLのINSERTステートメントを使って、ジオメトリをテーブルに挿入することができます。GISオブジェクト自体は、OpenGISコンソーシアムの"well-known text"形式を使っています。
pt_br: Após a criação da tabela, você pode inserir uma geometria através de um comando SQL INSERT. O objeto GIS em si é formatado utilizando o formato OGC WKT ("well known text"):

source: For more information about other GIS objects, see the <link linkend="RefObject">object reference</link>.
es: Para mas información sobre otros objetos SIG, mira en <link linkend="RefObject">object reference</link>.
fr: Pour plus d'information sur les objets SIG, lisez le chapitre <link linkend="RefObject">object reference</link>.
it_it: Per ulteriori informazioni su altri oggetti GIS, si rimanda alla <link linkend="RefObject">guida di riferimento sugli oggetti</link>.
ja: 他のGISオブジェクトの詳細については<link linkend="RefObject">object reference</link>をご覧ください。
pt_br: Para maiores informações sobre outros objetos GIS, veja a <link linkend="RefObject">referência de objetos</link>.

source: To view your GIS data in the table:
es: Para ver datos SIG en la tabla:
fr: Pour voir vos données SIG dans la table :
it_it: Per visualizzare i dati GIS nella tabella:
ja: テーブル内にあるGISデータを表示するには、次のようにします。
pt_br: Para visualizar seus dados GIS na tabela:

source: The return value should look something like this:
es: El resultado devuelto debería parecerse a algo así:
fr: La valeur retournée doit ressembler à çà :
it_it: Il valore restituito dovrebbe essere qualcosa tipo:
ja: 返り値は次のようなかんじになります。
pt_br: O valor de retorno deve se parecer com algum assim:

source: How do I construct a spatial query?
es: ¿Como puedo construir una consulta espacial?
fr: Comment est-ce que je construis une requête spatiale ?
it_it: Come posso creare una query spaziale?
ja: 空間クエリを作成するにはどうするのですか?
pt_br: Como construo uma pesquisa geoespacial?

source: The same way you construct any other database query, as an SQL combination of return values, functions, and boolean tests.
es: De la misma manera que construyes cualquier consulta en la base datos, como una combinación de valores, funciones y test boleanos a devolver en SQL.
fr: De la même manière vous construisez n'importe quelle requête de base de données, comme une combinaison SQL de valeurs retournées, fonctions et tests booléens.
it_it: Nello stesso modo in cui creeresti qualsiasi altra query per il database, come combinazione SQL di valori, funzioni e test booleani.
ja: 他のデータベースクエリを作るのと同じで、返り値、関数、テストのSQLの組み合わせです。
pt_br: Da mesma forma como você constrói qualquer pesquisa no banco de dados, com SQL em uma combinação de valores de retorno, funções e testes de álgebra booleana.

source: For spatial queries, there are two issues that are important to keep in mind while constructing your query: is there a spatial index you can make use of; and, are you doing expensive calculations on a large number of geometries.
es: Para las consultas espaciales, hay dos problemas importantes que hay que tener en cuenta mientras se construyen las consultas: ¿Hay indices espaciales que puedo utilizar? y ¿Estoy haciendo cálculos pesados en un gran numero de geometrias?
fr: Pour les requêtes spatiales, il y a deux problèmes qui sont important à garder à l'esprit lors de la construction de vos requêtes : y a t'il un index spatial que vous pouvez utiliser et faîtes vous des calculs couteux sur un grand nombre de géométries.
it_it: Per le query spaziali, è bene tenere a mente due aspetti: se esiste un indice spaziale che puoi utilizzare, e se stai eseguendo calcoli impegnativi su un grande numero di geometrie.
ja: 空間クエリでは、クエリを作成する際に心を平静に保つための重要な二つの問題があります。 一つは、使用することができる空間インデクスがあるか、です。もう一つは、多数のジオメトリを相手に計算量の多い計算を行っているか、です。
pt_br: Para pesquisas geoespaciais, existem duas questões que são importantes de se ter em mente durante sua construção: existe um índice geoespacial que você pode utilizar; e, você está realizando cálculos computacionalmente caros em um número grande de geometrias.
