Repository: postgis/postgis
Catalog: doc/po/*/faq.xml.po
Languages: es, fr, it_it, ja, pt_br

source: PostGIS Frequently Asked Questions
es: Preguntas frecuentes sobre PostGIS
fr: Foire Aux Questions PostGIS
it_it: Domande frequenti (F.A.Q) su PostGIS
ja: PostGIS よくある質問
pt_br: Perguntas frequentes PostGIS

source: Where can I find tutorials, guides and workshops on working with PostGIS
es: Donde puedo encontrar tutoriales, guías y talleres de trabajo con PostGIS
fr: Où puis-je trouver des tutoriaux, des guides et des travaux pratiques pour travailler avec PostGIS
ja: PostGISでの作業に関するチュートリアル、ガイド、ワークショップはどこにありますか?
pt_br: Onde posso encontrar tutoriais, guias e oficinas sobre como trabalhar com o PostGIS

source: BostonGIS also has a <ulink url="http://www.bostongis.com/PrinterFriendly.aspx?content_name=postgis_tut01">PostGIS almost idiot's guide on getting started</ulink>. That one is more focused on the windows user.
es: BostonGIS también tiene un <ulink url="http://www.bostongis.com/PrinterFriendly.aspx?content_name=postgis_tut01">PostGIS casi de idiotas guía sobre cómo empezar</ulink>. Que está más centrado en el usuario de Windows.
fr: BostonGIS a aussi un <ulink url="http://www.bostongis.com/PrinterFriendly.aspx?content_name=postgis_tut01">Guide pour démarrer avec PostGIS pour les quasi-idiots</ulink>. Ce dernier est plutôt orienté vers les utilisateurs Windows.
ja: BostonGISにも<ulink url="http://www.bostongis.com/PrinterFriendly.aspx?content_name=postgis_tut01">PostGIS almost idiot's guide on getting started</ulink>があります。Windowsユーザに、より軸足を置いています。
pt_br: BostonGIS também tem <ulink url="http://www.bostongis.com/PrinterFriendly.aspx?content_name=postgis_tut01">Um guia para quase idiotas para começar com PostGIS</ulink>. Este é mais focado em usuários Windows.

source: My applications and desktop tools worked with PostGIS 1.5,but they don't work with PostGIS 2.0. How do I fix this?
es: Mis aplicaciones y herramientas funcionaban con PostGIS 1.5, pero no funcionan con PostGIS 2.0. ¿Como puedo solucionarlo?
fr: Mon application et mes outils fonctionnaient avec PostGIS 1.5, cependant ils ne marchent plus avec PostGIS 2.0. Comment réparer cela ?
it_it: Le mie applicazioni e i miei strumenti desktop funzionavano con PostGIS 1.5, ma non funzionano con PostGIS 2.0. Come posso risolvere la cosa?
ja: PostGIS 1.5で動作していたアプリケーションやデスクトップツールがPostGIS 2.0では動作しなくなりました。解消するにはどうすればよいでしょうか?
pt_br: Minhas aplicações e ferramentas desktop funcionavam com PostGIS 1.5, mas não funcionam com o PostGIS 2.0. Como corrigir isto?

source: A lot of deprecated functions were removed from the PostGIS code base in PostGIS 2.0. This has affected applications in addition to third-party tools such as Geoserver, MapServer, QuantumGIS, and OpenJump to name a few. There are a couple of ways to resolve this. For the third-party apps, you can try to upgrade to the latest versions of these which have many of these issues fixed. For your own code, you can change your code to not use the functions removed. Most of these functions are non ST_ aliases of ST_Union, ST_Length etc. and as a last resort, install the whole of <varname>legacy.sql</varname> or just the portions of <varname>legacy.sql</varname> you need.
es: Muchas funciones rechazadas se han eliminado del código fuente de PostGIS en PostGIS 2.0. Esto ha afectado a aplicaciones o herramientas de terceros como Geoserver, Mapserver, QuanrumGIS y OpenJump por mencionar algunas. Hay varias formas de resolver esto. Para las aplicaciones de terceros, puedes intentar actualizar a la ultima version de la aplicación que tiene muchos de estos errores resueltos. Para tu propio código, puedes cambiar tu código para que no utilice las funciones eliminadas. Muchas de estas funciones no son ST_aliases de ST_Union, ST_Length etc. y como ultimo recurso instala el fichero <varname>legacy.sql</varname> completo o solo las partes del fichero <varname>legacy.sql</varname> que necesites.
fr: Beaucoup de fonctions obsolètes ont été supprimées du code de PostGIS dans PostGIS 2.0. Cela a affecté des applications en sus d'outils tiers comme GeoServer, MapServer, QuantumGIS et OpenJump pour n'en citer que quelques uns. Il y a plusieurs façons de résoudre ceci. Pour les applications tierces, vous pouvez essayer de passer aux dernières versions de celles qui ont vu beaucoup de ces problèmes résolus. Pour votre propre code, vous pouvez le modifier pour ne pas utiliser les fonctions supprimées. La plupart de ces fonctions ne sont pas des alias ST_ de ST_Union, ST_Length etc. et en dernier recours, installez la totalité de <varname>legacy.sql</varname> ou juste les parties de <varname>legacy.sql</varname> dont vous avez besoin.
it_it: Diverse funzioni obsolete sono state eliminate dal codice PostGIS nella versione 2.0. Ciò ha avuto un effetto sulle applicazioni, oltre che su strumenti di terze parti quali Geoserver, MapServer, QuantumGIS e OpenJump, per citarne alcuni. Ci sono un paio di modi per risolvere il problema. Per le applicazioni di terze parti, potere provare ad aggiornarle alla versione più recente, in cui molti di questi problemi sono stati sistemati. Per il codice da che hai sviluppato tu, puoi modificare il codice in modo da non utilizzare le funzioni eliminate. [TO BE COMPLETED HAVING CLARIFIED ISSUE]
ja: PostGIS 2.0で、多数の非推奨関数がPostGISコードから削除されました。これは、GeoServer, MapServer, QuantumGIS, OpenJump等のサードバーティツールに加えて、アプリケーションにも影響が出ます。これを解決する方法が二つあります。サードパーティアプリケーションの場合は、これらの問題の多くが解決されている最新版にアップグレードしてみることで対応できます。 ご自身のコードの場合は、削除された関数を使わないようにソースを変更することで対応できます。 削除された関数のほとんどは、ST_Unino, ST_Length等のエイリアスで、ST_を取ったものです。最後の手段として<varname>legacy.sql</varname>の全体または<varname>legacy.sql</varname>の必要な部分をインストールします。
pt_br: Muitas funcionalidades obsoletas foram removidos da base de código do PostGIS na versão 2.0. Isto afetou aplicações e em especial, ferramentas de terceiros, como Geoserver, MapServer, QuantumGIS e OpenJump, para citar alguns casos. Existem algumas maneiras de resolver isto. Para aplicações de terceiros, você pode tentar atualizar para as versões mais atuais, muitas das quais corrigiram estes problemas. Para seu próprio código, você pode alterá-lo para não utilizar as funções removidas. A maior parte destas funções não possuem o prefixo ST_ de ST_Union, ST_Length, etc. Como um último recurso, você pode instalar todo o script legado <varname>legacy.sql</varname> ou apenas as porções de <varname>legacy.sql</varname> que você precisa.

source: The <varname>legacy.sql</varname> file is located in the same folder as postgis.sql. You can install this file after you have installed postgis.sql and spatial_ref_sys.sql to get back all the 200 some-odd old functions we removed.
es: El fichero <varname>legacy.sql</varname> esta ubicado en la misma carpeta que postgis.sql. Puedes instalar este fichero después de haber instalado postgis.sql y spatial_ref_sys.sql para volver a tener disponibles las mas o menos 200 funciones que hemos eliminado.
fr: Le fichier <varname>legacy.sql</varname> est situé dans le même répertoire que postgis.sql. Vous pouvez installer ce fichier après avoir installé postgis.sql et spatial_ref_sys.sql pour retrouver toutes les 200 et quelques anciennes fonctions que nous avons supprimées.
it_it: Il file <varname>legacy.sql</varname> è ubicato nella stessa cartella di postgis.sql. Puoi installare questo file dopo aver installato postgis.sql e spatial_ref_sys.sql per recuperare le circa 200 vecchie funzioni che abbiamo eliminato.
ja: <varname>legacy.sql</varname>ファイルはpostgis.sqlのインストール先と同じフォルダにあります。postgis.sqlとspatial_ref_sys.sqlをインストールした後、このファイルをインストールすると、削除した200余の関数を復帰させられます。
pt_br: O arquivo <varname>legacy.sql</varname> está localizado na mesma pasta em que o arquivo postgis.sql. Você pode instalar este arquivo após a instalação do postgis.sql e spatial_ref_sys.sql, para ter de volta todas 200 funções que foram removidas.

source: When I load OpenStreetMap data with osm2pgsql, I'm getting an error failed: ERROR: operator class "gist_geometry_ops" does not exist for access method "gist" Error occurred. This worked fine in PostGIS 1.5.
es: Cuando cargo los datos de OpenStreetMap con osm2pgsql, estoy obteniendo un error fallido: ERROR: la clase de operador "gist_geometry_ops" no existe para el método de acceso "GIST" error ocurrido. Esto funcionó bien en PostGIS 1.5.
fr: Lorsque je charge des données OpenStreetMap avec osm2pgsql, je reçois une erreur : ERROR: operator class "gist_geometry_ops" does not exist for access method "gist" Error occurred. Tout marchait correctement avec PostGIS 1.5.
ja: osm2pgsqlを使ってOpenStreetMapデータをロードするときに、failed: ERROR: operator class "gist_geometry_ops" does not exist for access method "gist"というエラーが発生しました。PostGIS 1.5では正しく動作していました。
pt_br: Quando eu carregado dados do OpenStreetMap com o osm2pgsql, estou recebendo o erro: ERROR: operator class "gist_geometry_ops" does not exist for access method "gist" Error occurred. Isto funcionava perfeitamente no PostGIS 1.5.

source: In PostGIS 2, the default geometry operator class gist_geometry_ops was changed to gist_geometry_ops_2d and the gist_geometry_ops was completely removed. This was done because PostGIS 2 also introduced Nd spatial indexes for 3D support and the old name was deemed confusing and a misnomer.
es: En PostGIS 2, la clase de operador de geometría predeterminada gist_geometry_ops fue cambiado a gist_geometry_ops_2d y el gist_geometry_ops fue eliminado por completo. Esto se hizo porque PostGIS 2 también presenta Nd índices espaciales de soporte 3D y el nombre antiguo fue considerada confuso y erróneo.
fr: Dans PostGIS 2, la classe d'opérateur de geometry par défaut gist_geometry_ops a été changé en gist_geometry_ops_2d et gist_geometry_ops a été totalement supprimé. Cela a été fait car PostGIS 2 a aussi introduit les indexes Nd pour le support 3D et l'ancien nom a été considéré comme trompeur.
ja: PostGIS 2では、デフォルトのジオメトリ演算子クラスがgist_geometry_opsからgist_geometry_ops_2dに変更され、gist_geometry_opsは完全に削除されました。PostGIS 2は3次元対応のためN次元空間インデクスを導入しました。古い名前は混乱させるものであり、誤称であると考えました。
pt_br: No PostGIS 2, o operador de geometria padrão gist_geometry_ops foi alterado para gist_geometry_ops_2d e o gist_geometry_ops foi completamente removido. Isto foi feito pois o PostGIS 2 também introduziu indíces espacials n-dimensionais para suporte a 3D e o nome antigo não era uma boa escolha.

source: Some older applications that as part of the process create tables and indexes, explicitly referenced the operator class name. This was unnecessary if you want the default 2D index. So if you manage said good, change index creation from:
es: Algunas aplicaciones antiguas que como parte del proceso crean tablas e índices, se hace referencia explícitamente al nombre de clase del operador. Esto no era necesario si desea el índice predeterminado 2D. Así que si maneja la buena pronunciación, cambie la creación de índices de:
fr: Certaines applications anciennes créant des tables et des indexes dans leur fonctionnement référençaient directement l'ancienne classe d'opérateur. Cela n'était pas nécessaire si vous vouliez l'index 2D par défaut. Donc si vous souhaitez faire les chose correctement, changer la création d'index de :
ja: 古いアプリケーションには、処理の一部として、テーブルやインデクスを生成する際に、明示的に演算子クラス名を参照しているものがありました。デフォルトの2次元インデクスが欲しい場合には重要ではありません。エラーが内容に管理するために、インデクス生成を次に示す悪い例から良い例に変えて下さい。
pt_br: Algumas aplicações mais antigas, criavam tabelas e índices, explicitamente escolhendo o nome do operador. Isto era desnecessário se você quisesse o índice padrão 2D. Altere a criação do índice de:

source: BAD:
es: MAL:
fr: MAUVAIS :
ja: 悪い例
pt_br: ERRADO:

source: To GOOD:
es: a BIEN:
fr: vers la BONNE version :
ja: 良い例
pt_br: CORRETO:

source: The only case where you WILL need to specify the operator class is if you want a 3D spatial index as follows:
es: El único caso donde usted tendrá que especificar la clase de operador es si usted desea un índice espacial 3D como el siguiente:
fr: Le seul cas où vous DEVEZ spécifier la classe d'opérateur est si vous voulez un index spatial 3D comme dans l'exemple suivant :
ja: 演算子クラスを指定する必要が出るのは、3次元空間が求められる場合です。次のようにします。
pt_br: O único caso onde você precisará especificar a classe do operador é se você quer um índice espacial 3D:

source: If you are unfortunate to be stuck with compiled code you can't change that has the old gist_geometry_ops hard-coded, then you can create the old class using the <filename>legacy_gist.sql</filename> packaged in PostGIS 2.0.2+. However if you use this fix, you are advised to at a later point drop the index and recreate it without the operator class. This will save you grief in the future when you need to upgrade again.
es: Si usted es desafortunado para ser atrapado con código compilado que no se puede cambiar que tiene el antiguo gist_geometry_ops de código duro, entonces usted puede crear la antigua clase utilizando el <filename>legacy_gist.sql</filename> empaquetado en PostGIS 2.0.2 +. Sin embargo, si utiliza esta corrección, se le aconseja que en un punto posterior elimine el índice y lo recree sin la clase de operador. Esto le ahorrará problemas en el futuro cuando necesite actualizar de nuevo.
fr: Si vous êtes assez malchanceux pour être coincé avec un code compilé que vous ne pouvez changer et qui a l'ancien gist_geometry_ops codé en dur, alors vous pouvez recréer l'ancienne classe en utilisant <filename>legacy_gist.sql</filename> fourni avec PostGIS 2.0.2+. Cependant si vous utilisez cette rustine, il est conseillé par la suite de supprimer l'index et de le recréer sans la classe d'opérateur. Cela vous évitera des soucis à l'avenir lorsque vous devrez refaire une mise à jour.
ja: 不幸にもgist_geometry_opsがハードコーディングされていて変更不可なコンパイルされたコードを突きつけられているなら、PostGIS 2.0.2以上に同梱されている<filename>legacy_gist.sql</filename>を使用して、古いクラスを生成することができます。しかしながら、この方法を使う場合は、後ほどインデクスを削除して、演算子クラスを指定せずに再生成させるべきです。将来再びアップデートする必要がある時に泣いてしまうことを抑制します。
pt_br: Se você infelizmente está preso com código compilado que você não pode alterar e usa o operador gist_geometry_ops, você pode criar a classe antiga usando <filename>legacy_gist.sql</filename> empacotado na instalação do PostGIS 2.0.2 ou maior. Contudo, se você utilizar esta "correção", é recomendado que você, após a criação do índice, delete-o, e recrie-o sem a classe do operador. Isto vai te salvar no futuro quando precisar realizar o upgrade.

source: I'm running PostgreSQL 9.0 and I can no longer read/view geometries in OpenJump, Safe FME, and some other tools?
es: ¿Esto utilizando la version PostgreSQL 9.0 y no puedo leer/escribir geometrías en OpenJump, Safe FME, y otras herramientas?
fr: J'utilise PostgreSQL 9.0 et je ne peux plus accéder à la géométries de mes objets dans OpenJump, Safe FME ou tout autre logiciel
it_it: Sto usando PostgreSQL 9.0 e non posso più leggere le geometrie in OpenJump, Safe FME e altri strumenti. Come mai?
ja: PostgreSQL 9.0を使っていますが、OpenJump、Safe FME等のツールでジオメトリの読み取りや表示ができなくなってしまいましたが?
pt_br: Estou rodando PostgreSQL 9.0 e não mais posso ler/visualizar geometrias no OpenJump, Safe FME e outras ferramentas?

source: In PostgreSQL 9.0+, the default encoding for bytea data has been changed to hex and older JDBC drivers still assume escape format. This has affected some applications such as Java applications using older JDBC drivers or .NET applications that use the older npgsql driver that expect the old behavior of ST_AsBinary. There are two approaches to getting this to work again.
es: En PostgreSQL 9.0+, la codificación por defecto ha sido cambiada a hex y algunos drivers antiguos de JDBC siguen asumiendo el formato espacio. Esto ha afectado a algunas aplicaciones como aplicaciones Java utilizando viejos drivers JDBC o aplicaciones .NET que utilizan el driver npgsql antiguo que espera el comportamiento de ST_AsBinary antiguo. Hay dos soluciones para corregir esto.
fr: Dans PostgreSQL 9.0+, l'encodage par défaut pour la donnée bytea a été changé vers l'hexadécimal et les anciens pilotes JDBC assument toujours l'ancien format avec échappement. Cela affecte certaines applications telles que les applications Java utilisant des anciens pilotes JDBC, ou des applications .NET qui utilisent le vieux pilote npgsql, qui attend l'ancien comportement de ST_AsBinary. Il y a deux approches pour rétablir un bon fonctionnement dans cette situation.
it_it: In PostgreSQL 9.0+, la codifica di default per i dati di tipo bytea è stata modificata in esadecimale e i vecchi driver JDBC considerano sempre il formato di escape. Ciò ha avuto un effetto su alcune applicazioni, quali le applicazioni Java con i driver JDBC più vecchi o le applicazioni .NET che utilizzano il vecchio driver npgsql, che si aspetta di incontrare il vecchio comportamento di ST_AsBinary. Ci sono due approcci per far funzionare nuovamente il tutto.
ja: PostgreSQL 9.0以上では、byteaデータのデフォルトのエンコーディングがhexに変更されました。古いJDBCドライバはエスケープ形式を仮定しています。古いJDBCドライバを使ったJavaアプリケーションや古いNpgsqlドライバを使った.Netアプリケーションといった、ST_AsBinaryの古い挙動を期待するアプリケーションが影響を受けます。再び動作させるには二つの方法があります。
pt_br: No PostgreSQL 9.0+, o encoding padrão para dados bytea foi alterado para hex e outros drivers JDBC ainda assumem o formato escapado. Isto afetou aplicações Java utilizando drivers antigos JDBC ou aplicações .NET que usam drivers antigos npgsql e esperam o comportamento antigo de ST_AsBInary. Existem duas formas de resolver este problema.

source: You can upgrade your JDBC driver to the latest PostgreSQL 9.0 version which you can get from <ulink url="http://jdbc.postgresql.org/download.html">http://jdbc.postgresql.org/download.html</ulink>
es: Puedes actualizar el driver JDBC a la ultima version PostgreSQL 9.0 que puedes obtener en <ulink url="http://jdbc.postgresql.org/download.html">http://jdbc.postgresql.org/download.html</ulink>
fr: Vous pouvez mettre à jour votre pilote JDBC vers sa version PostgreSQL 9.0 que vous pouvez obtenir depuis <ulink url="http://jdbc.postgresql.org/download.html">http://jdbc.postgresql.org/download.html</ulink>
it_it: Puoi aggiornare il driver JDBC alla versione PostgreSQL 9.0 più recente dal sito <ulink url="http://jdbc.postgresql.org/download.html">http://jdbc.postgresql.org/download.html</ulink>
ja: JDBCドライバを最新のPostgreSQL 9.0版にアップグレードします。<ulink url="http://jdbc.postgresql.org/download.html">http://jdbc.postgresql.org/download.html</ulink>からダウンロードできます。
pt_br: Você pode atualizar seu driver JDBC para a última versão do PostgreSQL 9.0, que você obter em <ulink url="http://jdbc.postgresql.org/download.html">http://jdbc.postgresql.org/download.html</ulink>.

source: If you are running a .NET app, you can use Npgsql 2.0.11 or higher which you can download from <ulink url="http://pgfoundry.org/frs/?group_id=1000140">http://pgfoundry.org/frs/?group_id=1000140</ulink> and as described on <ulink url="http://fxjr.blogspot.com/2010/11/npgsql-2011-released.html">Francisco Figueiredo's NpgSQL 2.0.11 released blog entry</ulink>
es: Si estas utilizando una aplicación en .NET, puedes utilizar Npgsql 2.0.11 o superior, que puedes descargar desde <ulink url="http://pgfoundry.org/frs/?group_id=1000140">http://pgfoundry.org/frs/?group_id=1000140</ulink> y se describe en <ulink url="http://fxjr.blogspot.com/2010/11/npgsql-2011-released.html">Francisco Figueiredo's NpgSQL 2.0.11 released blog entry</ulink>
fr: Si vous faites tourner une application .NET, vous pouvez utiliser Npgsql 2.0.11 ou supérieure, que vous pouvez télécharger de <ulink url="http://pgfoundry.org/frs/?group_id=1000140">http://pgfoundry.org/frs/?group_id=1000140</ulink>, et voir la description donnée sur l'entrée de blog de <ulink url="http://fxjr.blogspot.com/2010/11/npgsql-2011-released.html">Francisco Figueiredo sur NpgSQL 2.0.11</ulink>
it_it: Se stai usando un'applicazione .NET, puoi utilizzare Npgsql 2.0.11 o versioni superiori, scaricandolo da <ulink url="http://pgfoundry.org/frs/?group_id=1000140">http://pgfoundry.org/frs/?group_id=1000140</ulink> e seguendo le istruzioni descritte nel <ulink url="http://fxjr.blogspot.com/2010/11/npgsql-2011-released.html">blog di Francisco Figueiredo su NpgSQL 2.0.11 </ulink>
ja: .Netアプリケーションについては、Npgsql 2.0.11以上を使います。<ulink url="http://pgfoundry.org/frs/?group_id=1000140">http://pgfoundry.org/frs/?group_id=1000140</ulink>からダウンロードできます。また、<ulink url="http://fxjr.blogspot.com/2010/11/npgsql-2011-released.html">Francisco Figueiredo's NpgSQL 2.0.11 released blog entry</ulink>に説明があります。
pt_br: Se você está utilizando uma aplicação .NET, você pode usar o driver Npgsql 2.0.11 ou melhor, que você fazer o download em <ulink url="http://pgfoundry.org/frs/?group_id=1000140">http://pgfoundry.org/frs/?group_id=1000140</ulink> e descrito em <ulink url="http://fxjr.blogspot.com/2010/11/npgsql-2011-released.html">Francisco Figueiredo's NpgSQL 2.0.11 released blog entry</ulink>.

source: If upgrading your PostgreSQL driver is not an option, then you can set the default back to the old behavior with the following change:
es: Si actualizar tu driver PostgreSQL no es una opción, entonces se puede establecer el valor predeterminado otra vez al viejo comportamiento con el siguiente cambio:
fr: Si mettre à jour votre pilote PostgreSQL n'est pas une option, alors vous pouvez définir la valeur par défaut à l'ancien comportement avec la modification suivante :
it_it: Se non è possibile aggiornare il tuo driver PostgreSQL, puoi ripristinare il comportamento precedente con la seguente modifica:
ja: PostgreSQLドライバのアップグレードが選択できないなら、デフォルトで古い挙動をするようにします。次のようにします。
pt_br: Se realizar um upgrade dos drivers PostgreSQL não é uma opção, então você pode setar o valor padrão para o comportamento antigo, usando a seguinte mudança:

source: I tried to use PgAdmin to view my geometry column and it is blank, what gives?
es: He intentado utilizar PgAdmin para ver mis columnas de geometría y esta en blanco, ¿qué ocurre?
fr: J'ai essayé d'utiliser PgAdmin pour visualiser mon champ géométrique mais elle est vide, qu'arrive-t-il ?
it_it: Ho provato a usare PgAdmin per visualizzare la mia colonna della geometria e questa risulta vuota. Perché?
ja: pgAdminを使ってジオメトリカラムを表示しようとしたら空っぽでした。何か方法はありませんか?
pt_br: Tentei usar o PgAdmin para visualizar minhas colunas geométricas e ela está em branco?

source: PgAdmin doesn't show anything for large geometries. The best ways to verify you do have data in your geometry columns are?
es: PgAdmin no muestra nada en geometrías muy largas. La mejor forma de verificar tienes datos en tus columnas de geometrías es:
fr: PgAdmin ne montre rien concernant les grandes géométries. Quelles sont les meilleurs solutions pour vérifier que mes champs géométriques contiennent des données ?
it_it: PgAdmin non mostra nulla nel caso di grandi geometrie. I modi migliori per verificare che vi siano dati presenti nelle vostre colonne di geometria sono:
ja: pgAdminは大きなジオメトリを表示しません。ジオメトリカラムがそうなっていないかを確かめる最善の方法は次の通りです。
pt_br: PgAdmin não mostra nada para grandes colunas. A melhor maneira de garantir que você tem dados em suas colunas geométricas são

source: -- this should return no records if all your geom fields are filled in SELECT somefield FROM mytable WHERE geom IS NULL;
es: -- Esto debería devolver ningún registro si todos los campos geom están llenos SELECT somefield FROM mytable WHERE geom IS NULL;
fr: -- Cela ne devrait retourner aucun résultat si tous les champs geom sont renseignés dans SELECT le_champ FROM ma_table WHERE geom IS NULL
ja: -- 全てのgeomカラムに値が入っている場合にはレコードが返りません SELECT somefield FROM mytable WHERE geom IS NULL;
pt_br: -- isso deve retornar a zero registros se todos seus campos geométricos estão preenchidos SELECT somefield FROM mytable WHERE geom IS NULL;
