Repository: postgis/postgis
Catalog: doc/po/*/faq_raster.xml.po
Languages: de, es, it_it, ja, pt_br

source: PostGIS Raster Frequently Asked Questions
de: Häufige Fragen zu PostGIS Raster
es: Preguntas frecuentes sobre PostGIS Raster
it_it: Domande frequenti su PostGIS raster
ja: PostGISラスタ よくある質問
pt_br: Perguntas frequentes PostGIS Raster

source: I'm getting error <code>ERROR: RASTER_fromGDALRaster: Could not open bytea with GDAL. Check that the bytea is of a GDAL supported format.</code> when using ST_FromGDALRaster or <code>ERROR: rt_raster_to_gdal: Could not load the output GDAL driver</code> when trying to use ST_AsPNG or other raster input functions.
de: Ich erhalte die Fehlermeldung <code>ERROR: RASTER_fromGDALRaster: Could not open bytea with GDAL. Check that the bytea is of a GDAL supported format.</code> wenn ich ST_FromGDALRaster verwende, oder <code>ERROR: rt_raster_to_gdal: Could not load the output GDAL driver</code> wenn Ich ST_AsPNG oder andere Rastereingabefunktionen verwende.
es: Estoy recibiendo error <code>ERROR: RASTER_fromGDALRaster: No se pudo abrir bytea con GDAL. Compruebe que el bytea es de un formato compatible con GDAL.</code> Cuando se utiliza ST_FromGDALRaster <code>ERROR: rt_raster_to_gdal: No se pudo cargar el controlador de salida de GDAL</code> Al intentar usar ST_AsPNG u otras funciones de entrada de raster.
ja: ST_FromGDALRasterを使うと<code>ERROR: RASTER_fromGDALRaster: Could not open bytea with GDAL. Check that the bytea is of a GDAL supported format.</code>というエラーが出ます。また、ST_AsPNGや他の入力関数を使おうとすると<code>ERROR: rt_raster_to_gdal: Could not load the output GDAL driver</code>というエラーが出ます。
pt_br: Estou tendo erro <code>ERRO: RASTER_fromGDALRaster: Não pôde abrir bytea comGDAL. Certifique que o bytea é de um formato GDAL suportado.</code> quando usando ST_FromGDALRaster ou <code>ERRO: rt_raster_to_gdal: Não pôde carregar a saída GDAL do dispositivo</code> quando tentou usar ST_AsPNG ou outras funções de entrada raster.

source: As of PostGIS 2.1.3 and 2.0.5, a security change was made to by default disable all GDAL drivers and out of db rasters. The release notes are at <ulink url="http://postgis.net/2014/05/19/postgis-2.0.6_and_2.1.3">PostGIS 2.0.6, 2.1.3 security release</ulink>. In order to reenable specific drivers or all drivers and reenable out of database support, refer to <xref linkend="install_short_version"/>.
de: Seit PostGIS 2.1.3 und 2.0.5 sind alle GDAL Treiber und out-db Raster aus Sicherheitsgründen standardmäßig deaktiviert. Die Release Notes sind unter <ulink url="http://postgis.net/2014/05/19/postgis-2.0.6_and_2.1.3">PostGIS 2.0.6, 2.1.3 security release</ulink>. Um bestimmte oder alle Treiber und out-db Unterstützung zu aktivieren, siehe <xref linkend="install_short_version"/>.
es: A partir de PostGIS 2.1.3 y 2.0.5, se hizo un cambio de seguridad por defecto se deshabilitaron todos los controladores GDAL y salida de raster db. <ulink url="http://postgis.net/2014/05/19/postgis-2.0.6_and_2.1.3">PostGIS 2.0.6, 2.1.3 security release</ulink>. Para rehabilitar controladores específicos o todos los controladores y rehabilitar el soporte de base de datos, consulte <xref linkend="install_short_version"/>.
ja: PostGIS 2.1.3と2.0.5では、セキュリティ変更が行われ、全てのGDALドライバとデータベース外ラスタは、デフォルトでは使えなくなりました。リリースノートは<ulink url="http://postgis.net/2014/05/19/postgis-2.0.6_and_2.1.3">PostGIS 2.0.6, 2.1.3 security release</ulink>にあります。特定のドライバまたは全てのドライバを再有効化する方法と、データベース外ラスタ機能を再有効化する方法については、<xref linkend="install_short_version"/>をご覧下さい。
pt_br: Assim como PostGIS 2.1.3 e 2.0.5, uma alteração de segurança foi feita em todos os drivers GDAL e db raters. Essas notas de liberação estão em <ulink url="http://postgis.net/2014/05/19/postgis-2.0.6_and_2.1.3">PostGIS 2.0.6, 2.1.3 liberação de segurança</ulink>. Com o propósito de reativar drivers específicos ou todos os drivers e reativar fora do suporte do banco de dados, consulte <xref linkend="install_short_version"/>.

source: Where can I find out more about the PostGIS Raster Project?
de: Wo kann ich detailierte Information über das Raster-Projekt von PostGIS finden?
es: ¿Dónde puedo encontrar más información sobre el Proyecto Raster PostGIS?
it_it: Dove posso trovare altre informazioni sul progetto PostGIS Raster?
ja: PostGISラスタプロジェクトに関するより多くの情報はどこにありますか?
pt_br: Onde posso saber mais sobre o projeto PostGIS Raster?

source: Refer to the <ulink url="http://trac.osgeo.org/postgis/wiki/WKTRaster">PostGIS Raster home page</ulink>.
de: Siehe <ulink url="http://trac.osgeo.org/postgis/wiki/WKTRaster">PostGIS Raster Homepage</ulink>.
es: Dirigirse a la <ulink url="http://trac.osgeo.org/postgis/wiki/WKTRaster">página inicial de PostGIS Raster</ulink>.
it_it: Visita la <ulink url="http://trac.osgeo.org/postgis/wiki/WKTRaster">home page</ulink> di PostGIS Raster.
ja: <ulink url="http://trac.osgeo.org/postgis/wiki/WKTRaster">PostGIS Raster home page</ulink>をご覧下さい。
pt_br: Consulte o sítio <ulink url="http://trac.osgeo.org/postgis/wiki/WKTRaster"> PostGIS Raster </ulink>.

source: Are there any books or tutorials to get me started with this wonderful invention?
de: Gibt es irgendwelche Bücher oder Übungen, die mir erklären wie Ich mit dieser wunderbare Erfindung loslegen kann?
es: ¿Existen libros o tutoriales para que pueda empezar con esta estupenda invención?
it_it: Ci sono libri o manuali che mi possano introdurre a questa meravigliosa invenzione?
ja: この素晴らしいものを始めるための書籍やチュートリアルはありますか?
pt_br: Existem livros ou tutoriais para aprender sobre esta maravilhosa invenção?

source: There is a full length beginner tutorial <ulink url="http://trac.osgeo.org/postgis/wiki/WKTRasterTutorial01"> Intersecting vector buffers with large raster coverage using PostGIS Raster</ulink>. Jorge has a series of blog articles on PostGIS Raster that demonstrate how to load raster data as well as cross compare to same tasks in Oracle GeoRaster. Check out <ulink url="http://gis4free.wordpress.com/category/postgis-raster/">Jorge's PostGIS Raster / Oracle GeoRaster Series</ulink>. There is a whole chapter (more than 35 pages of content) dedicated to PostGIS Raster with free code and data downloads at <ulink url="https://www.manning.com/books/postgis-in-action-second-edition">PostGIS in Action - Raster chapter</ulink>. You can <ulink url="http://www.postgis.us/page_buy_book">buy PostGIS in Action</ulink> now from Manning in hard-copy (significant discounts for bulk purchases) or just the E-book format. You can also buy from Amazon and various other book distributors. All hard-copy books come with a free coupon to download the E-book version.
es: Hya un largo y completo tutorial para principiantes <ulink url="http://trac.osgeo.org/postgis/wiki/WKTRasterTutorial01"> Intersección de búferes vectoriales con cobertura raster grandes usando PostGIS Raster</ulink>. Jorge tiene una serie de artículos de blog sobre PostGIS Raster que demuestran cómo cargar datos raster como también comparación cruzada con las mismas tareas en Oracle GeoRaster. Echa un vistazo a <ulink url="http://gis4free.wordpress.com/category/postgis-raster/">Jorge's PostGIS Raster / Oracle GeoRaster Series</ulink>. Hay un capítulo entero (más de 35 páginas de contenido) dedicada a PostGIS Raster con código libre y descargas de datos en <ulink url="https://www.manning.com/books/postgis-in-action-second-edition">PostGIS in Action - Raster chapter</ulink>. Usted puede <ulink url="http://www.postgis.us/page_buy_book">comprar PostGIS in Action</ulink> ahora desde Manning la copia impresa (descuentos significativos para compras a granel) o simplemente el formato de libro electrónico. También puede comprar desde Amazon y varios otros distribuidores de libros. Todos los libros de copia impresa vienen con un cupón gratis para descargar la versión de e-book.
pt_br: Existe um tutorial completo para iniciantes <ulink url="http://trac.osgeo.org/postgis/wiki/WKTRasterTutorial01"> Interseção de buffers de vetores com grande cobertura de varredura usando PostGIS Raster</ulink>. Jorge tem uma série de artigos no blog do PostGIS Raster que demonstram como carregar dados raster bem como comparar as mesmas tarefas no Oracle GeoRaster. Confira <ulink url="http://gis4free.wordpress.com/category/postgis-raster/"> Artigos de Jorge: PostGIS Raster / Oracle GeoRaster</ulink>. Há um capítulo inteiro (mais de 35 páginas de conteúdo) dedicado a PostGIS Raster com código livre e dados para download em <ulink url="https://www.manning.com/books/postgis-in-action-second-edition"> PostGIS em Ação - Capítulo Raster</ulink>. Você pode <ulink url="http://www.postgis.us/page_buy_book"> comprar a cópia impressa PostGIS em Ação </ulink> agora de Manning (descontos significativos para compras em massa) ou apenas o formato E-book. Você também pode comprar na Amazon e outros distribuidores de livros. Todos os manuais impressos vêm com um cupom para baixar a versão E-book.

source: How do I install Raster support in my PostGIS database?
de: Wie installiere Ich die Rasterunterstützung in meiner PostGIS Datenbank?
es: ¿Cómo instalo la funcionalidad Ráster en mi base de datos PostGIS?
it_it: Come installo il supporto Raster nel mio database PostGIS?
ja: PostGISデータベースにラスタ機能をインストールするにはどうすればよいでしょうか?
pt_br: Como instalar o suporte a raster no meu banco de dados PostGIS?

source: The easiest is to download binaries for PostGIS and Raster which are currently available for windows and latest versions of Mac OSX. First you need a working PostGIS 2.0.0 or above and be running PostgreSQL 8.4, 9.0, or 9.1. Note in PostGIS 2.0 PostGIS Raster is fully integrated, so it will be compiled when you compile PostGIS.
es: Lo más sencillo es descargar los ejecutables de PostGIS y Ráster que hay actualmente disponibles para Windows y las últimas versiones de Mac OSX. Se necesita un PostGIS 2.0.0, o superior, y estar usando PostgreSQL 8.4, 9.0, o 9.1. Tener en cuenta que en PostGIS 2.0 el Ráster está completamente integrado, así que se compilará cuando compile PostGIS.
it_it: Il modo più semplice è scaricare la versione binaria di PostGIS e della parte Raster, che sono attualmente disponibili per Windows e per le ultime versioni di Max OSX, partendo da una versione funzionante di PostGIS 2.0.0 o versioni superiori, con PostgreSQL 8.4, 9.0, o 9.1. Nota che in PostGIS 2.0 la parte Raster è completamente integrata, per cui dovrebbe essere compilata quando compilate PostGIS.
pt_br: A forma mais simples é realizar o download dos binários para o PostGIS e para o Raster, que estão disponíveis para Windows e últimas versões de Mac OSX. Primeiro você precisa de um PostGIS 2.0.0 ou maior e estar rodando PostgreSQL 8.4, 9.0 ou 9.1. No PostGIS 2.0, o PostGIS Raster está totalmente integrado, então ele também será compilado quando você compilar o PostGIS.

source: Instructions for installing and running under windows are available at <ulink url="http://gis4free.wordpress.com/2011/03/10/how-to-install-and-configure-postgis-raster-on-windows/">How to Install and Configure PostGIS raster on windows</ulink>
es: Las instrucciones para instalarlo y ejecutarlo desde Windows están disponibles en <ulink url="http://gis4free.wordpress.com/2011/03/10/how-to-install-and-configure-postgis-raster-on-windows/">Cómo instalar y configurar PostGIS Ráster en Windows</ulink>
it_it: Le istruzioni per installare ed eseguire il programma sotto Windows sono disponibili alla pagina <ulink url="http://gis4free.wordpress.com/2011/03/10/how-to-install-and-configure-postgis-raster-on-windows/">How to Install and Configure PostGIS raster on windows</ulink>
pt_br: Instruções para instalação no Windows estão disponíveis em <ulink url="http://gis4free.wordpress.com/2011/03/10/how-to-install-and-configure-postgis-raster-on-windows/">Como instalar e configurar o PostGIS Raster no Windows</ulink>

source: If you are on windows, you can compile yourself, or use the <ulink url="http://postgis.net/windows_downloads">pre-compiled PostGIS Raster windows binaries</ulink>. If you are on Mac OSX Leopard or Snow Leopard, there are binaries available at <ulink url="http://www.kyngchaos.com/software/postgres">Kyng Chaos Mac OSX PostgreSQL/GIS binaries</ulink>.
es: Si esta en windows, puede compilarlo usted mismo, o utilizar el precompilado<ulink url="http://postgis.net/windows_downloads">binario de windows PostGIS Raster</ulink>. Si esta en MAc OSX Leopard or Snow Leopard, hay binarios disponibles en <ulink url="http://www.kyngchaos.com/software/postgres">binarios PostgreSQL/GIS Kyng Chaos Mac OSX</ulink>.
pt_br: Se você é um usuário Windows, você pode compilar ou utilizar <ulink url="http://postgis.net/windows_downloads">os binários pré-compilados</ulink>. Se você é um usuário Mac OSX Leopard ou Snow Leopard, existem binários disponíveis em <ulink url="http://www.kyngchaos.com/software/postgres">binários Kyng Chaos Mac OSX PostgreSQL/GIS</ulink>

source: Then to enable raster support in your database, run the rtpostgis.sql file in your database. To upgrade an existing install use rtpostgis_upgrade_minor..sql instead of rtpostgis.sql
es: A continuación, para habilitar el soporte ráster en nuestra base de datos, ejecutar el fichero rtpostgis.sql en nuestra base de datos. Para actualizar una instalación existente usar rtpostgis_upgrade_minor.sql en vez de rtpostgis.sql.
it_it: Poi per abilitare il supporto raster nel tuo database, esegui il file rtpostgis.sql nel tuo database. Per aggiornare un'installazione esistente, utilizza rtpostgis_upgrade_minor..sql anziché rtpostgis.sql
pt_br: Para habilitar o suporte a rasters em seu banco de dados, rode o arquivo rtpostgis.sql. Para atualizar uma instalação existente, utilize o script rtpostgis_upgrade_minor.sql ao invés do arquivo rtpostgis.sql.

source: For other platforms, you generally need to compile yourself. Dependencies are PostGIS and GDAL. For more details about compiling from source, please refer to <ulink url="http://trac.osgeo.org/postgis/wiki/WKTRaster/Documentation01#a2.3-CompilingandInstallingfromSources">Installing PostGIS Raster from source (in prior versions of PostGIS)</ulink>
es: Para otras plataformas, generalmente necesitaremos compilarlo nosotros mismos. Las dependencias son PostGIS y GDAL. Para más información acerca de como compilarlo nosotros mismos, por favor diríjase a <ulink url="http://trac.osgeo.org/postgis/wiki/WKTRaster/Documentation01#a2.3-CompilingandInstallingfromSources">Instalando PostGIS Raster desde el código fuente (en versiones anteriores de PostGIS)</ulink>
it_it: Per le altre piattaforme, in genere dovrai eseguire la compilazione da solo. Ci sono dipendenze da PostGISe da GDAL. Per ulteriori dettagli sulla compilazione da sorgente, vedi <ulink url="http://trac.osgeo.org/postgis/wiki/WKTRaster/Documentation01#a2.3-CompilingandInstallingfromSources">Installing PostGIS Raster from source (in prior versions of PostGIS)</ulink>
pt_br: Em outras plataformas, você geralmente precisará compilar as dependências você mesmo. As dependências são PostGIS e GDAL. Para maiores detalhes sobre a compilação dos fontes, refira ao link <ulink url="http://trac.osgeo.org/postgis/wiki/WKTRaster/Documentation01#a2.3-CompilingandInstallingfromSources">Instalando o PostGIS Raster do fonte (em versões anteriores do PostGIS)</ulink>

source: I get error could not load library "C:/Program Files/PostgreSQL/8.4/lib/rtpostgis.dll": The specified module could not be found. or could not load library on Linux when trying to run rtpostgis.sql
es: Me aparece el error de que no pudo cargar la librería "C:/Program Files/PostgreSQL/8.4/lib/rtpostgis.dll": No se encontró el módulo indicado, o no se pudo cargar la librería en Linux al intentar ejecutar rtpostgis.sql.
it_it: Ottengo l'errore could not load library "C:/Program Files/PostgreSQL/8.4/lib/rtpostgis.dll": The specified module could not be found. or could not load library on Linux when trying to run rtpostgis.sql
pt_br: Recebo um erro que não foi possível carregar a biblioteca "C:/Program Files/PblostgreSQL/8.4/lib/rtpostgis.dll": O módulo especificado não pode ser encontrado ou não foi possível carregar a biblioteca no linux ao executar rtpostgis.sql

source: rtpostgis.so/dll is built with dependency on libgdal.dll/so. Make sure for Windows you have libgdal-1.dll in the bin folder of your PostgreSQL install. For Linux libgdal has to be in your path or bin folder.
es: rtpostgis.so/dll está construido bajo la dependencia de libgdal.so/dll. Asegúrese de tener, en Windows, el fichero libgdal-1.dll en la carpeta "bin" de su instalación de PostgreSQL. En Linux, libgdal debe estar en el "path" o la carpeta "bin".
it_it: rtpostgis.so/dll is viene compilato con la dipendenza da libgdal.dll/so. Assicurati su Windows di avere libgdal-1.dll nella cartellabin folder della tua installazione PostgreSQL. Per Linux, libgdal deve essere nel tuo path o nella cartella bin.
pt_br: rtpostgis.so/dll é construído com dependências da libgdal.so/dll. Tenha certeza no Windows que você tenha o arquivo libgdal-1.dll na pasta bin de sua instalação do PostgreSQL. Para Linux, a libgdal deve estar no PATH ou na pasta bin.

source: You may also run into different errors if you don't have PostGIS installed in your database. Make sure to install PostGIS first in your database before trying to install the raster support.
es: Pueden aparecer también diferentes errores si no tenemos PostGIS instalado en nuestra base de datos. Asegúrese primero de instalar PostGIS en su base de datos antes de instalar el soporte para ráster.
it_it: Potresti anche riscontrare errori diversi se non hai PostGIS installato nel tuo database. Assicurati di installare PostGIS prima di provare a installare il supporto raster.
pt_br: Você também pode encontrar erros diferentes se você não tem o PostGIS instalado em seu banco de dados. Tenha certeza de instalar primeiro o PostGIS em seu banco de dados antes de tentar instalar o suporte a raster.

source: How do I load Raster data into PostGIS?
de: Wie kann ich Rasterdaten in PostGIS laden?
es: ¿Cómo se cargan datos ráster en PostGIS?
it_it: Come carico i dati raster in PostGIS?
ja: ラスタデータをPostGISにロードするにはどうすればよいでしょうか?
pt_br: Como carrego dados raster dentro de meu banco PostGIS?

source: The latest version of PostGIS comes packaged with a <varname>raster2pgsql</varname> raster loader executable capable of loading many kinds of rasters and also generating lower resolution overviews without any additional software. Please refer to <xref linkend="RT_Raster_Loader"/> for more details. Pre-2.0 versions came with a <varname>raster2pgsql.py</varname> that required python with numpy and GDAL. This is no longer needed.
es: La útlima versión de PostGIS viene empaquetada con un <varname>raster2pgsql</varname> cargador ejecutable para ráster capaz de cargar muchas clases de ráster y de generar previsualizaciones en baja resolución sin ningún programa adicional. Consulte <xref linkend="RT_Raster_Loader"/> para tener más detalles. Versiones anteriores a la 2.0 venían con un <varname>raster2pgsql.py</varname> que necesitaba tener instalado python, numpy y GDAL. Esto ya no es necesario.
it_it: La più recente versione di PostGIS è corredata dall'eseguibile <varname>raster2pgsql</varname> per il caricamento di diversi tipi di raster e anche per generare quadri d'insieme senza software aggiuntivo. Ti rimandiamo a <xref linkend="RT_Raster_Loader"/> per ulteriori dettagli. Le versioni precedenti alla 2.0 avevano un programma <varname>raster2pgsql.py</varname> che richiedeva python, numpy e GDAL. Questo programma non è più necessario.
pt_br: A última versão do PostGIS vem com o carregador <varname>raster2pgsql</varname>, capaz de importar vários tipos de rasters, também capaz de gerar visões de menor resolução sem qualquer outro software adicional. Refira ao <xref linkend="RT_Raster_Loader"/> para maiores detalhes. Versões anteriores a 2.0 também vem com um script <varname>raster2pgsql.py</varname>, que requer Python, com suporte a numpy e GDAL. Isto não é mais necessário.

source: What kind of raster file formats can I load into my database?
de: Welche Rasterformate kann Ich in meine Datenbank laden?
es: ¿Qué formatos de ficheros ráster puedo cargar en mi base de datos?
it_it: Che tipo di formati raster posso caricare nel mio database?
ja: ロード可能なラスタファイルの種類は何ですか?
pt_br: Quais tipos de arquivos raster posso carregar em meu banco de dados?

source: Any that your GDAL library supports. GDAL supported formats are documented <ulink url="http://www.gdal.org/formats_list.html">GDAL File Formats</ulink>.
de: Jedes Format das von Ihrer Bibliothek "GDAL" unterstützt wird. Die von GDAL unterstützten Formate sind unter <ulink url="http://www.gdal.org/formats_list.html">GDAL File Formats</ulink> beschrieben.
es: Cualquiera de los que soporta la librería GDAL. Los formatos soportados por GDAL están documentados en <ulink url="http://www.gdal.org/formats_list.html">GDAL File Formats</ulink>.
it_it: Qualsiasi formato supportato dalla tua libreria GDAL. I formati supportati da GDAL sono <ulink url="http://www.gdal.org/formats_list.html">documentati</ulink>.
ja: GDALライブラリがサポートするもの全てです。GDALがサポートする形式については<ulink url="http://www.gdal.org/formats_list.html">GDAL File Formats</ulink>にあります。
pt_br: Qualquer raster que sua biblioteca GDAL suporte. Os formatos suportados pela GDAL estão documentados em <ulink url="http://www.gdal.org/formats_list.html">GDAL File Formats</ulink>.

source: Your particular GDAL install may not support all formats. To verify the ones supported by your particular GDAL install, you can use
de: Es kann sein, dass Ihre jeweilige Installation von GDAL nicht alle Formate unterstützt. Um zu überprüfen, welche Formate von Ihrer GDAL Installation unterstützt werden, können Sie folgendes ausführen
es: Nuestra instalación GDAL concreta puede que no soporte todos los formatos. Para comprobar los que están soportados en nuestra instalación de GDAL podemos usar
it_it: La tua particolare versione di GDAL potrebbe non supportare tutti i formati. Per verificare di preciso, puoi usare
ja: インストールで、一部の形式に対応していない可能性があります。インストールしたGDALがサポートする形式を確認するには、次を実行してください。
pt_br: Sua instalação específica da GDAL pode não suportar todos os formatos. Para verificar os formatos suportados em sua instalação, você pode usar

source: Can I export my PostGIS raster data to other raster formats?
de: Kann Ich meine PostGIS Rasterdaten in ein anderes Format exportieren?
es: ¿Puedo exportar mis datos ráster en PostGIS a otros formatos ráster?
it_it: Posso esportare i miei dati raster PostGIS ad altri formati raster?
ja: PostGISラスタデータを他のラスタ形式に出力できますか?
pt_br: Posso exportar meus dados raster do banco de dados para outros formatos raster?

source: <para>Yes</para>
es: <para>Sí</para>
it_it: <para>Sì</para>
ja: <para>はい</para>
pt_br: <para>Sim</para>

source: GDAL 1.7+ has a PostGIS raster driver, but is only compiled in if you choose to compile with PostgreSQL support.
es: GDAL 1.7+ tiene un controlador ráster para PostGIS, pero sólo se agrega a la compilación si elegimos compilarlo con el soporte de PostgreSQL.
it_it: Dalla versione 1.7 in su, GDAL ha un driver per PostGIS Raster, ma viene compilato solo se scegli la compilazione con supporto PostgreSQL.
pt_br: GDAL 1.7+ tem um driver para PostGIS, mas somente é compilado se você habilitar esta opção no momento da compilação.
