Repository: postgis/postgis
Catalog: doc/po/*/faq_raster.xml.po
Languages: de, es, it_it, ja, pt_br

source: The function is not unique error happens if one of your arguments is a textual representation of a geometry instead of a geometry. In these cases, PostgreSQL marks the textual representation as an unknown type, which means it can fall into the st_intersects(raster, geometry) or st_intersects(raster,raster) thus resulting in a non-unique case since both functions can in theory support your request. To prevent this, you need to cast the textual representation of the geometry to a geometry.
de: Der Fehler "function is not unique" tritt auf, wenn in einem Ihrer Argumente die Geometrie als Text und nicht als geometrischer Datentyp dargestellt wird. In diesem Fall wird die Textdarstellung von PostgreSQL als "unknown type" gekennzeichnet. Dadurch kann es als ST_Intersects(raster, geometry) oder als ST_Intersects(raster, raster) interpretiert werden, was zu einem uneindeutigen Fall führt, da beide Funktionen die Anfrage unterstützen könnten. Um dies zu vermeiden, müssen Sie die Textdarstellung der Geometrie in den geometrischen Datentyp umwandeln.
ja: 引数のひとつがジオメトリでなくジオメトリの文字列表現である場合、一意でない関数エラーが発生します。この場合、PostgreSQLは文字列表現を未知の型とします。そうするとst_intersects(raster, geometry)かst_intersects(raster,raster)かのどちらかになります。理論上両方の関数ともにリクエストに沿うことになるので、一意でないことになります。これを回避するには、GEOMETRY型にキャストして下さい。
