Repository: postgis/postgis
Catalog: doc/po/*/faq_raster.xml.po
Languages: de, es, it_it, ja, pt_br

source: The driver currently doesn't support irregularly blocked rasters, although you can store irregularly blocked rasters in PostGIS raster data type.
de: Zurzeit werden von dem Treiber keine unregelmäßigen Raster unterstützt, obwohl Sie unregelmäßige Raster unter PostGIS als Datentyp Raster speichern können.
es: El controlador actualmente no soporta rásters con bloqueos irregulares, aunque éstos se pueden almacenar en PostGIS con el tipo de datos ráster.
it_it: Al momento il driver non supporta i raster a blocchi irregolari, sebbene sia possibile memorizzare blocchi irregolari nel tipo dati PostGIS raster.
ja: PostGISラスタ型に不規則なブロックのラスタを格納できますが、GDALドライバは現在のところ不規則なブロックのラスタには対応していません。
pt_br: O driver não suporte rasters irregulares, apesar de ser possível de armazená-los no tipo de dados do PostGIS.

source: If you are compiling from source, you need to include in your configure <programlisting>--with-pg=path/to/pg_config</programlisting> to enable the driver. Refer to <ulink url="http://trac.osgeo.org/gdal/wiki/BuildHints">GDAL Build Hints</ulink> for tips on building GDAL against in various OS platforms.
de: Wenn Sie den Quellcode kompilieren, dann müssen Sie <programlisting>--with-pg=path/to/pg_config</programlisting> bei der Konfiguration angeben um die Treiber zu aktivieren. Siehe <ulink url="http://trac.osgeo.org/gdal/wiki/BuildHints">GDAL Build Hints</ulink> für Tipps zum Kompilieren von GDAL auf verschiedenen Betriebssystemen.
es: Si estamos compilando desde los fuentes, necesitamos incluir en nuestra configuración <programlisting>--with-pg=path/to/pg_config</programlisting> para habilitar el controlador. Véase <ulink url="http://trac.osgeo.org/gdal/wiki/BuildHints">GDAL Build Hints</ulink> para conocer recomendaciones sobre cómo generar ejecutables de GDAL en varias plataformas.
it_it: Se stai compilando il programma a partire dal sorgente, devi includere nel sorgente l'opzione <programlisting>--with-pg=path/to/pg_config</programlisting> per abilitare il driver. Ti rimandiamo alla pagina <ulink url="http://trac.osgeo.org/gdal/wiki/BuildHints">GDAL Build Hints</ulink> per suggerimenti sulla compilazione di GDAL su divrse piattaforme.
ja: ソースからコンパイルする場合、ドライバを有効にするには、コンフィギュアに<programlisting>--with-pg=path/to/pg_config</programlisting>を入れる必要があります。まざまなプラットフォーム上でGDALをビルドする際の各種情報については、<ulink url="http://trac.osgeo.org/gdal/wiki/BuildHints">GDAL Build Hints</ulink>を参照して下さい。
pt_br: Se você está compilando os fontes, você precisa incluir em sua configuração <programlisting>--with-pg=caminho/para/pg_config</programlisting> para habilitar o driver. Veja <ulink url="http://trac.osgeo.org/gdal/wiki/BuildHints">GDAL Build Hints</ulink> para dicas sobre como compilar a GDAL em várias plataformas e sistemas operacionais.

source: If your version of GDAL is compiled with the PostGIS Raster driver you should see PostGIS Raster in list when you do
de: Falls Ihre Version von GDAL mit dem PostGIS Rastertreiber kompiliert wurde, sollten PostGIS Raster aufgelistet werden, wenn Sie folgendes ausführen
es: Si nuestra versión de GDAL está compilada con el controlador ráster para PostGIS, deberíamos ver PostGIS Raster en la lista cuando hagamos
it_it: Se la tua versione di GDAL è compilata con il driver PostGIS Raster, dovresti trovare PostGIS Raster nella lista quando esegui
ja: GDALをPostGISラスタドライバ付きでコンパイルしているなら、次のコマンドを実行すると、リストにPostGIS Rasterが現れます。
pt_br: Se sua versão da GDAL for compilada com o driver PostGIS, você deve ver PostGIS Raster na lista quando executar

source: To get a summary about your raster via GDAL use gdalinfo:
de: Um eine Zusammenfassung Ihrer Raster über GDAL zu erhalten, benutzen Sie bitte gdalinfo:
es: Para obtener un resumen vía GDAL acerca de nuestro ráster utilizamos gdalinfo:
it_it: Per ottenere informazioni riassuntive sul tuo raster tramite GDAL, utilizza gdalinfo:
ja: GDALからラスタに関する要約を得るには、gdalinfoを使います。
pt_br: Para visualizar um sumário sobre seu raster via GDAL use gdalinfo:

source: gdalinfo "PG:host=localhost port=5432 dbname='mygisdb' user='postgres' password='whatever' schema='someschema' table=sometable"
es: gdalinfo "PG:host=localhost port=5432 dbname='mygisdb' user='postgres' password='whatever' schema='nuestroesquema' table=nuestratabla"

source: To export data to other raster formats, use gdal_translate the below will export all data from a table to a PNG file at 10% size.
de: Um die Daten in andere Rasterformate zu exportieren, können Sie gdal_translate verwenden. Im folgenden exportieren wir sämtliche Daten einer Tabelle in eine PNG-Datei mit einer Dateigröße von 10%.
es: Para exportar a otros formatos ráster, usaremos gdal_translate. Lo que viene abajo exportará todos los datos de una tabla a un fichero PNG al 10% de su tamaño.
it_it: Per esportare dati verso altri formati raster, utilizza gdal_translate. L'esempio sotto esporterà tutti i dati da una tabella a un file PNG col 10% della dimensione.
ja: 他のラスタ書式へデータを出力するには、gdal_translateを使います。下で示すものは、テーブルからのデータ全体を10%のサイズのPNGファイルにして出力します。
pt_br: Para exportar dados para outros formatos raster, use gdal_translate. O comando abaixo irá exportar todos os dados de uma tabela para um arquivo PNG com 10% de seu tamanho.

source: Depending on your pixel band types, some translations may not work if the export format does not support that Pixel type. For example floating point band types and 32 bit unsigned ints will not translate easily to JPG or some others.
de: Abhängig von dem Pixeltyp Ihrer Bänder, können einige Übersetzungen nicht funktionieren, wenn das Exportformat diesen Pixeltyp nicht unterstützt. Zum Beispiel können Bänder vom Pixeltyp Gleitpunkt, oder vorzeichenlose 32bit-Ganzzahlen, nicht ohne weiters in ein JPG- oder in ein anderes Format konvertiert werden.
es: Dependiendo de los tipos de banda de píxel, algunas conversiones puede que no funcionen si el formato exportado no soporta ese tipo de píxel. Por ejemplo, tipos de banda en punto flotante y enteros sin signo de 32 bits no se convertirán fácilmente a JPG o algunos otros.
it_it: A seconda dei tipi di banda dei pixel, alcune conversioni non funzioneranno, se il formato di esportazione non supprta un dato tipo di pixel. Per esempio, i tipi di banda a virgola mobile, o gli interi senza segno a 32 bit non si convertiranno bene in JPEG.
ja: ピクセルバンドタイプについて、出力書式がサポートしない場合は、変換が機能しないことがあります。たとえば、浮動小数点数と32ビット符号なし整数は、JPGや他の書式に簡単には変換しません。
pt_br: Dependendo do tipo de bandas, algumas conversões (via GDAL) podem não funcionar, se o formato não suportar este tipo de banda. Por exemplo, bandas de ponto flutuante e inteiros de 32 bits sem sinal não serão facilmente convertidas em JPGs e alguns outros.

source: Here is an example simple translation
de: Ein Beispiel für eine einfache Übersetzung:
es: Aquí hay un ejemplo sencillo de conversión
it_it: Ecco un esempio di una semplice conversione
ja: 次に単純な変換の例を示します。
pt_br: Aqui está um exemplo de uma simples conversão

source: You can also use SQL where clauses in your export using the where=... in your driver connection string. Below are some using a where clause
de: Sie können auch SQL WHERE Klauseln bei Ihrem Export anwenden, indem Sie where=... in der Verbindungszeichenfolge angeben. Unterhalb sind einige Beispiele, welche die WHERE-Klausel verwenden
es: Podemos también usar las cláusulas WHERE de SQL en nuestra exportación utilizando los where=... en nuestra cadena de conexión con el controlador. Abajo hay algunas que usan la cáusula WHERE
it_it: Puoi anche utilizzare la clausola SQL WHERE nell'esportazione, riportando il testo where=.... nella stringa di collegamento del driver. Sotto si riportano alcuni esempi che utilizzano la clausola where
ja: また、ドライバ接続文字列内でwhere=...を使って、SQLのWHERE節を使うことができます。次に例を示します。
pt_br: Você também pode usar clausulas SQL na sua exportação, com o parametro where=... em sua string de conexão. Abaixo estão alguns exemplos com a clausula where

source: To see more examples and syntax refer to <ulink url="http://trac.osgeo.org/gdal/wiki/frmts_wtkraster.html#a3.2-Readingrasterdatafromthedatabase">Reading Raster Data of PostGIS Raster section</ulink>
es: Para ver más ejemplos y la sintaxis consulte <ulink url="http://trac.osgeo.org/gdal/wiki/frmts_wtkraster.html#a3.2-Readingrasterdatafromthedatabase">Leyendo datos ráster, sección PostGIS Raster</ulink>
it_it: Per vedere altri esempi e sintassi, si rimanda al paragrafo <ulink url="http://trac.osgeo.org/gdal/wiki/frmts_wtkraster.html#a3.2-Readingrasterdatafromthedatabase">Leggere dati raster da un raster PostGIS</ulink>
pt_br: Para visualizar mais exemplos e a sintaxe, confira a seção <ulink url="http://trac.osgeo.org/gdal/wiki/frmts_wtkraster.html#a3.2-Readingrasterdatafromthedatabase">Reading Raster Data of PostGIS Raster section</ulink>

source: Are their binaries of GDAL available already compiled with PostGIS Raster suppport?
de: Gibt es Binärdateien von GDAL, die für die PostGIS Rasterunterstützung bereits kompiliert sind?
es: ¿Están ya compilados con el soporte ráster de PostGIS sus ejecutables GDAL de los que dispone?
it_it: I binari di GDAL sono già disponibili con il supporto raster PostGIS?
ja: GDALバイナリはPostGISラスタ機能付きでコンパイルされていますか?
pt_br: Existem binários pré-compilados já com suporte ao PostGIS Raster?

source: Yes. Check out the page <ulink url="http://trac.osgeo.org/gdal/wiki/DownloadingGdalBinaries">GDAL Binaries</ulink> page. Any compiled with PostgreSQL support should have PostGIS Raster in them.
es: Sí. Compruebe la página <ulink url="http://trac.osgeo.org/gdal/wiki/DownloadingGdalBinaries">GDAL Binaries</ulink>. Cualquiera que esté compilado con el soporte PostgreSQL debe incluir PostGIS Raster.
it_it: Sì. Controlla la pagina <ulink url="http://trac.osgeo.org/gdal/wiki/DownloadingGdalBinaries">GDAL Binaries</ulink>. Qualsiasi versione compilata con l'opzione di supporto per PostgreSQL dovrebbe avere il supporto per i raster PostGIS.
pt_br: Sim. Cheque a página <ulink url="http://trac.osgeo.org/gdal/wiki/DownloadingGdalBinaries">GDAL Binaries</ulink>. Qualquer um destes deve ter suporte ao PostGIS Raster.

source: PostGIS Raster is undergoing many changes. If you want to get the latest nightly build for Windows -- then check out the Tamas Szekeres nightly builds built with Visual Studio which contain GDAL trunk, Python Bindings and MapServer executables and PostGIS Raster driver built-in. Just click the SDK bat and run your commands from there. <ulink url="www.gisinternals.com">http://www.gisinternals.com</ulink>. Also available are VS project files.
es: PostGIS Raster está pasando por muchos cambios. Si desea obtener la última compilación nocturna para Windows -- a continuación, echa un vistazo a los Tamas Szekeres construcciones nocturnas construidas con Visual Studio que contienen troncales GDAL, Python Bindings y MapServer ejecutables y controladores incorporados PostGIS Raster. Simplemente haga clic en el SDK bat y ejecute sus comandos desde allí. <ulink url="www.gisinternals.com">http://www.gisinternals.com</ulink>. También están disponibles los archivos de proyecto vs.
pt_br: O PostGIS Raster está passando por muitas mudanças. Se você desejar a versão diária para Windows, cheque as builds feitas por Tamas Szekeres com Visual Studio, que contém o trunk GDAL, suporte a Python, MapServer e o driver PostGIS embutido. Clique no bat SDK e rode seus comandos a partir daí. <ulink url="www.gisinternals.com">http://www.gisinternals.com</ulink>. Também estão disponíveis os arquivos de projetos do Visual Studio.

source: <ulink url="http://fwtools.maptools.org/">FWTools latest stable version for Windows is compiled with Raster support</ulink>.
es: <ulink url="http://fwtools.maptools.org/">La última versión estable de FWTools para Windows está compilada con el soporte para ráster</ulink>.
it_it: La versione più recente e stabile di <ulink url="http://fwtools.maptools.org/">FWTools per Windows</ulink> è compilata con il supporto raster.
pt_br: <ulink url="http://fwtools.maptools.org/">Última versão estável para Windows é compilada com suporte ao PostGIS Raster</ulink>

source: What tools can I use to view PostGIS raster data?
de: Welche Werkzeuge kann Ich benutzen, um Rasterdaten, die sich in PostGIS befinden, anzusehen?
es: ¿Qué herramientas puedo usar para ver datos ráster de PostGIS?
it_it: Quali strumenti posso usare per visualizzare i dati raster PostGIS?
ja: PostGISラスタデータを見るのに使うことができるツールは何ですか?
pt_br: Quais ferramentas posso usar para visualizar os dados do PostGIS Raster?

source: You can use MapServer compiled with GDAL 1.7+ and PostGIS Raster driver support to view Raster data. QuantumGIS (QGIS) now supports viewing of PostGIS Raster if you have PostGIS raster driver installed.
es: Podemos usar MapServer compilado con GDAL 1.7+ y soporte ráster de PostGIS para ver datos ráster. QuantumGIS (QGIS) ahora es capaz de visualizar ráster de PostGIS si tenemos instalado el controlador ráster de PostGIS.
it_it: Puoi utilizzare Mapserver compilato con GDAL 1.7 o versioni superiori e con il supporto del driver raster PostGIS per vedere i dati raster. Quantum GIS (QGIS) inoltre supporta la visualizzazione dei raster PostGIS se hai il driver installato.
pt_br: Você pode utilizar o MapServer compilado com GDAL 1.7+ e o suporte ao PostGIS Raster. QuantumGIS (QGIS) também suporta a visualização de rasters no PostGIS se o driver estiver instalado.

source: In theory any tool that renders data using GDAL can support PostGIS raster data or support it with fairly minimal effort. Again for Windows, Tamas' binaries <ulink url="www.gisinternals.com">http://www.gisinternals.com</ulink> are a good choice if you don't want the hassle of having to setup to compile your own.
es: En teoría, cualquier herramienta que procese los datos mediante GDAL puede soportar datos raster de PostGIS o admitirlo con un esfuerzo bastante mínimo. Una vez más para Windows, los binarios de Tamas <ulink url="www.gisinternals.com">http://www.gisinternals.com</ulink> son una buena opción si no quieres tener que configurar tu propia compilación.
pt_br: Na teoria, qualquer ferramenta que consiga reproduzir dados utilizando GDAL pode suportar os dados PostGIS raster com pouco esforço. Novamente para Windows, os binários Tamas <ulink url="www.gisinternals.com">http://www.gisinternals.com</ulink> são uma boa escolha se você não quiser o transtorno de configurar para compilar por conta própria.

source: How can I add a PostGIS raster layer to my MapServer map?
de: Wie kann Ich einen PostGIS-Raster zu meiner MapServer-Karte hinzufügen?
es: ¿Cómo puedo añadir una capa ráster de PostGIS a mi mapa de MapServer?
it_it: Come posso aggiungere uno strato raster PostGIS in una mappa di MapServer?
ja: MapServerの地図にPostGISラスタレイヤを追加するにはどうすればいいですか?
pt_br: Como posso adicionar uma camada PostGIS Raster em meu mapa do MapServer?

source: First you need GDAL 1.7 or higher compiled with PostGIS raster support. GDAL 1.8 or above is preferred since many issues have been fixed in 1.8 and more PostGIS raster issues fixed in trunk version.
es: Primero necesitamos tener compilado GDAL 1.7 o superior con soporte ráster de PostGIS. Es preferible GDAL 1.8 o superior ya que muchos problemas han sido solucionados en la 1.8, y más serán corregidos en la versión troncal.
it_it: Anzitutto ti serve GDAL 1.7 o superiore compilato con il supporto per raster PostGIS. E consigliata la versione 1.8 o superiore, dato che quest'ultima risolve numerosi problemi, e altri problemi con i raster PostGIS sono risolti nella versione trunk.
pt_br: Primeiro você precisa da GDAL 1.7 ou maior, compilada com suporte ao PostGIS Raster. GDAL 1.8 ou maior é preferida, já que muitos problemas foram solucionados e muitas pendências com o PostGIS Raster resolvidas na versão trunk.

source: You can much like you can with any other raster. Refer to <ulink url="http://mapserver.org/input/raster.html">MapServer Raster processing options</ulink> for list of various processing functions you can use with MapServer raster layers.
es: Podemos hacer como con cualquier otro ráster. Consulte <ulink url="http://mapserver.org/input/raster.html">MapServer Raster processing options</ulink> para una lista de las diferentes funciones que podemos usar para procesar capas ráster en MapServer.
pt_br: Você pode gostar muito do que pode ser feito com qualquer outro raster. Referência <ulink url="http://mapserver.org/input/raster.html">MapServer Raster processing options</ulink> para listar várias funções de processamento que você pode utilizar com MapServer raster layers.

source: What makes PostGIS raster data particularly interesting, is that since each tile can have various standard database columns, you can segment it in your data source
de: PostGIS Rasterdaten sind insofern besonders interessant, da jede Kachel mehrere Standard-Datenbankattribute aufweisen kann und die Daten daher aufgeteilt werden können.
es: Lo que hace particularmente interesante a los datos raster PostGIS, es que, ya que cada mosaico puede tener varias columnas estándar de la base de datos, podemos segmentarlos en nuestro origen de datos.
ja: PostGISラスタデータを特に興味深くするのは、それぞれのタイルが様々な標準的なデータベースカラムを持ち得るので、データソースで分割することができる点です。
pt_br: O que torna o PostGIS Raster tão interessante, é que cada tile pode ocupar diversas colunas padrão e você pode segmentar sua fonte de dados

source: Below is an example of how you would define a PostGIS raster layer in MapServer.
de: Unterhalb ein Beispiel, wie Sie einen PostGIS-Rasterlayer in MapServer anlegen können.
es: Debajo hay un ejemplo de cómo definiríamos una capa ráster de PostGIS en MapServer.
it_it: Sotto trovi un esempio di come definire uno strato raster PostGIS in MapServer.
ja: 次に示す例は、PostGISラスタレイヤをMapServer内で定義する方法です。
pt_br: Abaixo está um exemplo de como você pode definir uma camada PostGIS Raster no MapServer.

source: The mode=2 is required for tiled rasters and was added in PostGIS 2.0 and GDAL 1.8 drivers. This does not exist in GDAL 1.7 drivers.
de: Der Parameter, mode=2, wird für geteilte Raster benötigt und wurde in PostGIS 2.0.0
es: Se necesita el "mode=2" para rásters en mosaico que fué añadido en PostGIS 2.0 y los controladores de GDAL 1.8. Ésto no está en los controladores GDAL 1.7.
it_it: L'opzione mode=2 serve per i raster con tile ed è stata aggiunta in PostGIS 2.0 con il driver GDAL 1.8. Non esiste nei driver GDAL 1.7.
ja: mode=2 では、タイル化されたラスタが求められるもので、PostGIS 2.0とGDAL 1.8ドライバで追加されています。これはGDAL 1.7ドライバにはありません。
pt_br: O mode=2 é obrigatório para rasters dividos em tiles e este suporte foi adicionado no PostGIS 2.0 e nos drivers GDAL 1.8. Este suporte não existe na versão GDAL 1.7.

source: -- displaying raster with standard raster options LAYER NAME coolwktraster TYPE raster STATUS ON DATA "PG:host=localhost port=5432 dbname='somedb' user='someuser' password='whatever' schema='someschema' table='cooltable' mode='2'" PROCESSING "NODATA=0" PROCESSING "SCALE=AUTO" #... other standard raster processing functions here #... classes are optional but useful for 1 band data CLASS NAME "boring" EXPRESSION ([pixel] &lt; 20) COLOR 250 250 250 END CLASS NAME "mildly interesting" EXPRESSION ([pixel] &gt; 20 AND [pixel] &lt; 1000) COLOR 255 0 0 END CLASS NAME "very interesting" EXPRESSION ([pixel] &gt;= 1000) COLOR 0 255 0 END END
de: -- Einen Raster mit den Standardeinstellungen darstellen LAYER NAME coolwktraster TYPE raster STATUS ON DATA "PG:host=localhost port=5432 dbname='somedb' user='someuser' password='whatever' schema='someschema' table='cooltable' mode='2'" PROCESSING "NODATA=0" PROCESSING "SCALE=AUTO" #... other standard raster processing functions here #... classes are optional but useful for 1 band data CLASS NAME "boring" EXPRESSION ([pixel] &lt; 20) COLOR 250 250 250 END CLASS NAME "mildly interesting" EXPRESSION ([pixel] &gt; 20 AND [pixel] &lt; 1000) COLOR 255 0 0 END CLASS NAME "very interesting" EXPRESSION ([pixel] &gt;= 1000) COLOR 0 255 0 END END
es: -- visualización raster con opciones raster standard LAYER NAME coolwktraster TYPE raster STATUS ON DATA "PG:host=localhost port=5432 dbname='somedb' user='someuser' password='whatever' schema='someschema' table='cooltable' mode='2'" PROCESSING "NODATA=0" PROCESSING "SCALE=AUTO" #... other standard raster processing functions here #... classes are optional but useful for 1 band data CLASS NAME "boring" EXPRESSION ([pixel] &lt; 20) COLOR 250 250 250 END CLASS NAME "mildly interesting" EXPRESSION ([pixel] &gt; 20 AND [pixel] &lt; 1000) COLOR 255 0 0 END CLASS NAME "very interesting" EXPRESSION ([pixel] &gt;= 1000) COLOR 0 255 0 END END
ja: -- 標準的なラスタの設定を付けてラスタを表示する LAYER NAME coolwktraster TYPE raster STATUS ON DATA "PG:host=localhost port=5432 dbname='somedb' user='someuser' password='whatever' schema='someschema' table='cooltable' mode='2'" PROCESSING "NODATA=0" PROCESSING "SCALE=AUTO" #... 他の標準的なラスタ処理関数はここに入ります #... クラスは必須ではないですが1バンドデータに使えます CLASS NAME "boring" EXPRESSION ([pixel] &lt; 20) COLOR 250 250 250 END CLASS NAME "mildly interesting" EXPRESSION ([pixel] &gt; 20 AND [pixel] &lt; 1000) COLOR 255 0 0 END CLASS NAME "very interesting" EXPRESSION ([pixel] &gt;= 1000) COLOR 0 255 0 END END

source: -- displaying raster with standard raster options and a where clause LAYER NAME soil_survey2009 TYPE raster STATUS ON DATA "PG:host=localhost port=5432 dbname='somedb' user='someuser' password='whatever' schema='someschema' table='cooltable' where='survey_year=2009' mode='2'" PROCESSING "NODATA=0" #... other standard raster processing functions here #... classes are optional but useful for 1 band data END
de: -- Einen Raster mit den Standardeinstellungen und einer WHERE-Klausel darstellen LAYER NAME soil_survey2009 TYPE raster STATUS ON DATA "PG:host=localhost port=5432 dbname='somedb' user='someuser' password='whatever' schema='someschema' table='cooltable' where='survey_year=2009' mode='2'" PROCESSING "NODATA=0" #... other standard raster processing functions here #... classes are optional but useful for 1 band data END
es: -- visualización raster con opciones raster standard y con clausula WHERE LAYER NAME soil_survey2009 TYPE raster STATUS ON DATA "PG:host=localhost port=5432 dbname='somedb' user='someuser' password='whatever' schema='someschema' table='cooltable' where='survey_year=2009' mode='2'" PROCESSING "NODATA=0" #... other standard raster processing functions here #... classes are optional but useful for 1 band data END
ja: -- 標準的なラスタの設定と、WHERE節をつけてラスタを表示する LAYER NAME soil_survey2009 TYPE raster STATUS ON DATA "PG:host=localhost port=5432 dbname='somedb' user='someuser' password='whatever' schema='someschema' table='cooltable' where='survey_year=2009' mode='2'" PROCESSING "NODATA=0" #... other standard raster processing functions here #... classes are optional but useful for 1 band data END

source: What functions can I currently use with my raster data?
de: Welche Funktionen kann Ich zurzeit mit meinen Rasterdaten nutzen?
es: ¿Qué funciones puedo utilizar actualmente con mis datos ráster?
it_it: Quali funzioni posso attualmente utilizzare con i dati raster?
ja: 現在ラスタデータで使用できる関数は何ですか?
pt_br: Quais funcionalidades posso usar atualmente em meus dados raster?

source: Refer to the list of <xref linkend="RT_reference"/>. There are more, but this is still a work in progress.
de: Siehe <xref linkend="RT_reference"/>. Es gibt noch mehr Funktionen, doch diese befinden sich noch in der Aufbauphase.
es: Consulte la relación en <xref linkend="RT_reference"/>. Hay más, pero es un trabajo en marcha todavía.
it_it: Ti rimandiamo alla lista <xref linkend="RT_reference"/>. Ce ne sono anche altre, ma si tratta di funzioni in via di sviluppo.
ja: <xref linkend="RT_reference"/>のリストを参照して下さい。これよりも多くの関数がありますが、開発途中です。
pt_br: Se refere a lista <xref linkend="RT_reference"/>. Existem mais, mas ainda está trabalhando na melhoria.
