Repository: postgis/postgis
Catalog: doc/po/*/faq_raster.xml.po
Languages: de, es, it_it, ja, pt_br

source: Refer to the <ulink url="http://trac.osgeo.org/postgis/wiki/WKTRaster/PlanningAndFunding">PostGIS Raster roadmap page</ulink> for details of what you can expect in the future.
de: Siehe <ulink url="http://trac.osgeo.org/postgis/wiki/WKTRaster/PlanningAndFunding">PostGIS Raster roadmap page</ulink> für Details was in Zukunft geplant ist.
es: Consulte <ulink url="http://trac.osgeo.org/postgis/wiki/WKTRaster/PlanningAndFunding">PostGIS Raster roadmap page</ulink> para detalles acerca de qué esperar en el futuro.
it_it: Ti rimandiamo alla pagina <ulink url="http://trac.osgeo.org/postgis/wiki/WKTRaster/PlanningAndFunding">PostGIS Raster roadmap page</ulink> per i dettagli sugli sviluppi attesti in futuro.
ja: 将来的に期待できる関数の詳細情報については<ulink url="http://trac.osgeo.org/postgis/wiki/WKTRaster/PlanningAndFunding">PostGIS Raster roadmap page</ulink>をご覧下さい。
pt_br: Se refere a <ulink url="http://trac.osgeo.org/postgis/wiki/WKTRaster/PlanningAndFunding">PostGIS Raster roadmap page</ulink> para detalhes do que você pode esperar para o futuro.

source: I am getting error ERROR: function st_intersects(raster, unknown) is not unique or st_union(geometry,text) is not unique. How do I fix?
de: Ich erhalte die Fehlermeldung "ERROR: function st_intersects(raster, unknown) is not unique or st_union(geometry,text) is not unique." Wie kann ich das beheben?
es: Obtengo el error "ERROR: function st_intersects(raster, unknown) is not unique or st_union(geometry,text) is not unique". ¿Cómo lo soluciono?
it_it: Ottengo un errore ERROR: function st_intersects(raster, unknown) is not unique or st_union(geometry,text) is not unique. Come lo aggiusto?
ja: 「ERROR: function st_intersects(raster, unknown) is not unique or st_union(geometry,text) is not unique.」というエラーが出ました。解消するにはどうすればいいでしょうか?
pt_br: Estou recebendo um erro ERROR: function st_intersects(raster, unknow) is not unique or st_union(geometry, text) is not unique. Como posso consertar este problema?

source: For example if your code looks like this:
de: Wenn Ihr Code zum Beispiel folgendermaßen aussieht:
es: Por ejemplo, si nuestro código se parece a éste:
it_it: Per esempio, se il tuo codice è tipo:
ja: たとえば次のようになっているとします。
pt_br: Por exemplo, se seu código se parece com isto:

source: Cast the textual geometry representation to a geometry by changing your code to this:
de: Wandeln Sie die Textdarstellung der Geometrie in einen geometrischen Datentyp um, indem Sie Ihren Code folgendermaßen ändern:
es: Haga un moldeado de tipos "cast" de la representación en texto de la geometría a geometría cambiando el código de esta manera:
it_it: Dei eseguire il cast della geometria come testo a una geometria vera e propria in questo modo:
ja: 次の通りにコードを変更すれば文字列表現をジオメトリにキャストします。
pt_br: Converta a representação textual geométrica para uma geometria, alterando seu código assim:

source: How is PostGIS Raster different from Oracle GeoRaster (SDO_GEORASTER) and SDO_RASTER types?
de: Wie unterscheidet sich PostGIS Raster von Oracle GeoRaster (SDO_GEORASTER) und SDO_RASTER-Typen?
es: ¿En qué se diferencia el PostGIS Raster de los tipos Oracle GeoRaster (SDO_GEORASTER) y SDO_RASTER?
it_it: Quali sono le differenze tra i raster di PostGIS, i GeoRaster di Oracle (SDO_GEORASTER) e i tipi SDO_RASTER?
ja: PostGISラスタとOracle GeoRaster (SDO_GEORATGER)およびSDO_RASTERとどの位違うのでしょうか?
pt_br: Como o PostGIS Raster é diferente do tipo Oracle GeoRaster (SDO_GEORASTER) e do tipo SDO_RASTER?

source: For a more extensive discussion on this topic, check out Jorge Arévalo <ulink url="http://gis4free.wordpress.com/2010/07/19/oracle-georaster-part-i/">Oracle GeoRaster and PostGIS Raster: First impressions </ulink>
de: Für eine ausführlichere Erörterung dieses Themas siehe Jorge Arévalo <ulink url="http://gis4free.wordpress.com/2010/07/19/oracle-georaster-part-i/">Oracle GeoRaster and PostGIS Raster: First impressions </ulink>
es: Para una discusión más extensa sobre este tema, consultar la web de Jorge Arévalo <ulink url="http://gis4free.wordpress.com/2010/07/19/oracle-georaster-part-i/">Oracle GeoRaster and PostGIS Raster: First impressions </ulink>
it_it: Per una discussione dettagliata su questo argomento, dai un'occhiata all'articolo di Jorge Arévalo <ulink url="http://gis4free.wordpress.com/2010/07/19/oracle-georaster-part-i/">Oracle GeoRaster and PostGIS Raster: First impressions </ulink>
ja: この話題に関するより広範囲な議論については、Jorge Arévaloさんの<ulink url="http://gis4free.wordpress.com/2010/07/19/oracle-georaster-part-i/">Oracle GeoRaster and PostGIS Raster: First impressions </ulink>をご覧ください。
pt_br: Para uma discurssão mais extensa sobre esse tópico, verifique Jorge Arévalo <ulink url="http://gis4free.wordpress.com/2010/07/19/oracle-georaster-part-i/"> Oracle GeoRaster e PostGIS Raster: Primeiras impressões </ulink>

source: The major advantage of one-georeference-by-raster over one-georeference-by-layer is to allow:
de: Der wesentliche Vorteil von "one-georeference-by-raster" gegenüber "one-georeference-by-layer" ist:
es: La mayor ventaja de una-georeferencia-por-raster sobre una-georeferencia-por-capa es la de permitir:
ja: ラスタごとのジオリファレンスがレイヤごとのジオリファレンスより優れいていることの主たるものは次の通りです。
pt_br: A maior vantagem do one-georeference-by-raster sobre one-georeference-by-layer é permitir:

source: * coverages to be not necessarily rectangular (which is often the case of raster coverage covering large extents. See the possible raster arrangements in the documentation)
de: * Coverages müssen nicht unbedingt rechteckig sein (was bei Rastercoverages, die sich über eingroßes Gebiet erstrecken, häufig der Fall ist. Schauen Sie sich dazu die Gestaltungsmöglichkeiten für Raster in der Dokumentation an)
es: * las coberturas no necesitan ser obligatoriamente rectangulares (como es el caso, a menudo, de coberturas ráster de gran extensión. Consulte las posibles disposiciones acerca de los ráster en la documentación)
ja: * カバレッジが必ずしも長方形でなくてよいこと (この長方形はしばしば広範囲におよぶラスタカバレッジになります。この文書内にある可能なラスタの配置をご覧ください)
pt_br: * coberturas não são necessariamente retangulares (que é frequentemente o caso do raster coverage cobrindo grandes extensões. Veja a possibilidade de arranjos raster na documentação)

source: * rasters to overlaps (which is necessary to implement lossless vector to raster conversion)
de: * Raster können überlappen (dies ermöglicht die verlustfreie Konvertierung von Vektor nach Raster)
es: * solapar rásters (necesario para implementar la conversión de menor pérdida de vectorial a ráster).
ja: * オーバラップするラスタ (ベクタからラスタへの変換で欠損無く実装できる点で重要)
pt_br: * rasters para sobreposição (que é necessário para implementar perda de menos vetores para conversões raster)

source: These arrangements are possible in Oracle as well, but they imply the storage of multiple SDO_GEORASTER objects linked to as many SDO_RASTER tables. A complex coverage can lead to hundreds of tables in the database. With PostGIS Raster you can store a similar raster arrangement into a unique table.
de: Diese Gestaltungsmöglichkeiten gibt es auch in Oracle, aber dort wird dadurch die Speicherung von mehreren SDO_GEORASTER Objekten impliziert, welche auf genausoviele SDO_RASTER Tabellen verweisen. Ein kompliziertes Coverage kann somit hunderte Tabellen in einer Oracle Datenbank bedingen. Mit PostGIS Raster können Sie den gleichen Raster in einer einzelnen Tabelle abspeichern.
es: Estas disposiciones son posibles también en Oracle, pero implican el almacenamiento de múltiples objetos SDO_GEORASTER enlazados a muchas tablas SDO_RASTER. Una cobertura compleja puede llevar a cientos de tablas en la base de datos. Con PostGIS Raster podemos almacenar una disposición ráster similar en una única tabla.
ja: これらの配置はOracleでも可能ですが、多数のSDO_RASTERテーブルと関連付けられる複数のSDO_GEORASTERオブジェクトを格納することになります。複雑なカバレッジになると、データベース上の数百のテーブルにおよぶこともあります。PostGISラスタを使うと、似たようなラスタ配置を一つのテーブルで行うことができます。
pt_br: Estes arranjos também são possíveis no Oracle, mas eles implicam no armazenamento de múltiplos objetos SDO_GEORASTER conectados a muitas tabelas SDO_RASTER. Uma cobertura complexa pode liderar para centenas de tabelas no banco de dados. Com PostGIS Raster vocẽ pode gravar um arranjo raster similar dentro de uma única tabela.

source: It's a bit like if PostGIS would force you to store only full rectangular vector coverage without gaps or overlaps (a perfect rectangular topological layer). This is very practical in some applications but practice has shown that it is not realistic or desirable for most geographical coverages. Vector structures needs the flexibility to store discontinuous and non-rectangular coverages. We think it is a big advantage that raster structure should benefit as well.
de: Es scheint ein bisschen so, als ob PostGIS dazu zwingt nur vollständige rechteckige Vektorcoverages, ohne Aussparungen und Überlappungen (einen perfekten rechteckigen topologischen Layer), abzuspeichern. Dies mag bei manchen Anwendungen sehr praktikabel sein, die Praxis hat jedoch gezeigt, dass dies für die meisten Coverages weder realistisch noch erstrebenswert ist. Vektorstrukturen benötigen eine gewisse Flexibilität um auch unterbrochene und nicht rechteckige Coverages zu speichern. Wir glauben, dass auch Rasterstrukturen von diesem Vorteil profitieren sollten.
es: Es un poco como si PostGIS nos forzase a almacenar sólo coberturas vectoriales completas sin vacíos o solapamientos (una capa rectangular topológicamente perfecta). Esto puede ser muy útil en algunas situaciones pero la práctica nos dice que no es realista ni deseable para la mayoría de las coberturas geográficas. Pensamos que es una gran ventaja de la que la estructura raster debería beneficiarse también.
ja: PostGISがユーザに隙間やオーバラップの無い長方形ベクタカバレッジ (完全な長方形トポロジのレイヤ)を強制するのに少し似ています。これは、いくつかのアプリケーションにおいては非常に実際的ですが、実際に行うと、ほとんどのカバレッジにとって、現実的でなく望ましくもないことが分かりました。ベクタ構造には、不連続かつ非長方形のカバレッジを格納する柔軟性が必要です。ラスタ構造が同様に利益を受けることについて、私たちは大きな利点であると考えます。
pt_br: É um pouco como se o PostGIS forçasse você a gravar apenas cobertura vetorial retangular cheia sem lacunas e sobreposições (uma perfeita camada topologica retangular). Isso é muito prático em algumas aplicações, mas na prática tem mostrado que não é realista ou desejável para a maioria das cobertura geográficas. Estruturas vetoriais necessitam da flexibilidade para gravar coberturas descontínuas e não retangulares. Nós acreditamos que uma grande vantagem que estruturas raster deveriam beneficiar também.

source: raster2pgsql load of large file fails with String of N bytes is too long for encoding conversion?
de: raster2pgsql versagt beim Laden großer Dateien mit einer Fehlermeldung von "N bytes is too long for encoding conversion"?
es: raster2pgsql la carga de archivo de gran tamaño falla con la cadena de bytes N ¿es demasiado grande para la codificación de conversión?
ja: raster2pgsqlにより巨大なファイルのロードがString of N bytes is too long for encoding conversionと言われて失敗しますがどうすればよいでしょうか?
pt_br: a carga de grandes arquivos com raster2pgsql falha com String de N bytes é muito longa para conversão de encoding?

source: raster2pgsql doesn't make any connections to your database when generating the file to load. If your database has set an explicit client encoding different from your database encoding, then when loading large raster files (above 30 MB in size), you may run into a <code>bytes is too long for encoding conversion</code>.
de: "raster2pgsql" erzeugt die Importdatei ohne eine Verbindung zur Datenbank herzustellen. Wenn in Ihrer Datenbank für den Client eine andere Zeichenkodierung als für die Datenbank gesetzt ist, dann kann beim Laden großer Rasterdateien (von ungefähr 30 MB Dateigröße) die Fehlermeldung <code>bytes is too long for encoding conversion</code> auftreten.
es: raster2pgsql no hace ninguna conexión a su base de datos cuando genera el archivo a cargar. Si su base de datos a establecido una codificación cliente explicita diferente de su codificación de base de datos, entonces al cargar archivos ráster grandes (por encima de 30 MB de tamaño), puede ejecutar un <code>los bytes son demasiado largo para la conversión de codificación</code>.
ja: raster2pgsqlは、ロード用ファイルを生成するときにデータベース接続を行いません。データベースに明示的にデータベースの文字エンコーディングと異なるものを設定している場合には、巨大な (30MB以上)ラスタファイルをロードするときに、<code>bytes is too long for encoding conversion</code>になることがあります。
pt_br: O raster2pgsql não faz conexões com o banco de dados enquanto está gerando o arquivo para carga. Se seu banco de dados tem um encoding cliente explicitamente configurado, então enquanto estiver realizando a carga de arquivos raster grandes (acima de 30 MB em tamanho), você pode encontrar uma mensagem <code>bytes is too long for enconding conversion</code>.

source: This generally happens if for example you have your database in UTF8, but to support windows apps, you have the client encoding set to <code>WIN1252</code>.
de: Dies passiert üblicherweise, wenn die Datenbank z.B. in UTF8 vorliegt, aber die Zeichenkodierung für die Clients auf <code>WIN1252</code> gesetzt ist, um Windows Applikationen zu unterstützen.
es: En general, esto sucede si por ejemplo se tiene la base de datos en UTF-8, sino para reconocer aplicaciones de windows, se tiene la codificación del cliente configurado en <code>WIN1252</code>
ja: これは、一般的には、たとえばデータベースがUTF-8であるのに、Windowsアプリケーションに対応するために、クライアントの文字エンコーディングが<code>WIN1252</code>に設定されている場合に発生します。
pt_br: Isto geralmente acontece se seu banco de dados é UTF8, mas para suportar aplicações clientes Windows, você configurou o encoding cliente para <code>WIN1252</code>

source: To work around this make sure the client encoding is the same as your database encoding during load. You can do this by explicitly setting the encoding in your load script. Example, if you are on windows:
de: Um dieses Problem zu umgehen, können Sie während des Ladens sicherstellen, dass die Zeichenkodierung für den Client und für die Datenbank die gleiche ist. Sie können dies durch ein explizites Setzen der Zeichenkodierung in Ihrem Ladeskript erreichen. Zum Beispiel unter Windows:
es: Para evitar este asegúrese de que la codificación de cliente es el mismo que su codificación de base de datos durante la carga. Puede hacer esto estableciendo explícitamente la configuración de la codificación en el script de carga. Ejemplo, si se está en las ventanas:
ja: これを回避策するには、ロードする間、クライアントの文字エンコーディングをデータベースと同じにします。明示的な文字エンコーディング設定をスクリプトに入れることで実現できます。たとえば、Windows上では次のようにします。
pt_br: Para resolver este problema durante a carga, tenha certeza que o encoding cliente é o mesmo do seu banco de dados. Você pode fazer isto explicitamente no script de carga. Exemplo, se você usa Windows:

source: If you are on Unix/Linux
de: Falls Sie sich auf Unix/Linux befinden
es: Si esta en Unix/Linux
ja: Unix/Linuxの場合には、次のようにします。
pt_br: Se você está no Unix/Linux

source: Gory details of this issue are detailed in <ulink url="http://trac.osgeo.org/postgis/ticket/2209">http://trac.osgeo.org/postgis/ticket/2209</ulink>
de: Mörderische Einzelheiten zu diesem Themadetails finden sich unter <ulink url="http://trac.osgeo.org/postgis/ticket/2209">http://trac.osgeo.org/postgis/ticket/2209</ulink>
es: Más información en este tema se detallan en <ulink url="http://trac.osgeo.org/postgis/ticket/2209">http://trac.osgeo.org/postgis/ticket/2209</ulink>
ja: Goryさんがこの問題の詳細を<ulink url="http://trac.osgeo.org/postgis/ticket/2209">http://trac.osgeo.org/postgis/ticket/2209</ulink>に記述しています。
pt_br: Os detalhes desta situação estão detalhados em: <ulink url="http://trac.osgeo.org/postgis/ticket/2209">http://trac.osgeo.org/postgis/ticket/2209</ulink>

source: There is a full length beginner tutorial <ulink url="http://trac.osgeo.org/postgis/wiki/WKTRasterTutorial01"> Intersecting vector buffers with large raster coverage using PostGIS Raster</ulink>. Jorge has a series of blog articles on PostGIS Raster that demonstrate how to load raster data as well as cross compare to same tasks in Oracle GeoRaster. Check out <ulink url="http://gis4free.wordpress.com/category/postgis-raster/">Jorge's PostGIS Raster / Oracle GeoRaster Series</ulink>. There is a whole chapter (more than 35 pages of content) dedicated to PostGIS Raster with free code and data downloads at <ulink url="http://www.postgis.us/chapter_13">PostGIS in Action - Raster chapter</ulink>. You can <ulink url="http://www.postgis.us/page_buy_book">buy PostGIS in Action</ulink> now from Manning in hard-copy (significant discounts for bulk purchases) or just the E-book format. You can also buy from Amazon and various other book distributors. All hard-copy books come with a free coupon to download the E-book version.
it_it: C'è un tutorial completo per principianti, dal titolo <ulink url="http://trac.osgeo.org/postgis/wiki/WKTRasterTutorial01"> Intersecting vector buffers with large raster coverage using PostGIS Raster</ulink>. Jorge ha nel suo blog una serie di articoli su PostGIS Raster che mostrano come caricare dati raster e che danno un confronto con le funzioni analoghe di Oracle GeoRaster. Controlla la <ulink url="http://gis4free.wordpress.com/category/postgis-raster/">serie di articoli di Jorge su PostGIS Raster / Oracle GeoRaster</ulink>. C'è un intero capitolo (più di 35 pagine) dedicato a PostGIS Raster, assieme a codice libero e dati da scaricare alla pagina <ulink url="http://www.postgis.us/chapter_13">PostGIS in Action - Raster chapter</ulink>. Potete <ulink url="http://www.postgis.us/page_buy_book">acquistare</ulink> PostGIS in Action da Manning in versione cartacea (con sconti significativi per grossi quantitativi) oppore in versione E-book. Potete anche acquistare il libro da Amazon e da altri distributori. Tutte le copie cartacee contengono un buono per scaricare la versione E-book.

source: Here is a review from a PostGIS Raster user <ulink url="http://fuzzytolerance.info/code/postgis-raster-ftw/">PostGIS raster applied to land classification urban forestry</ulink>
it_it: Qui trovi una rassegna da parte di un utente di PostGIS Raster per <ulink url="http://fuzzytolerance.info/code/postgis-raster-ftw/">applicazioni di classificazione del suolo nelle zone verdi urbane</ulink>.

source: In theory any tool that renders data using GDAL can support PostGIS raster data or support it with fairly minimal effort. Again for Windows, Tamas' binaries <ulink url="http://vbkto.dyndns.org/sdk/">http://vbkto.dyndns.org/sdk/</ulink> are a good choice if you don't want the hassle of having to setup to compile your own.
it_it: In teoria qualsiasi strumento che utilizzi GDAL per la restituzione dei dati può supportare i raster PostGIS direttamente o con un minimo sforzo. Sempre per Windows, I binari di Tama <ulink url="http://vbkto.dyndns.org/sdk/">http://vbkto.dyndns.org/sdk/</ulink> sono una buona scelta se non volete prendervi la briga di eseguire la compilazione in proprio.

source: -- displaying raster with standard raster options LAYER NAME coolwktraster TYPE raster STATUS ON DATA "PG:host=localhost port=5432 dbname='somedb' user='someuser' password='whatever' schema='someschema' table='cooltable' mode='2'" PROCESSING "NODATA=0" PROCESSING "SCALE=AUTO" #... other standard raster processing functions here #... classes are optional but useful for 1 band data CLASS NAME "boring" EXPRESSION ([pixel] &lt; 20) COLOR 250 250 250 END CLASS NAME "mildly interesting" EXPRESSION ([pixel] &gt; 20 AND [pixel] &lt; 1000) COLOR 255 0 0 END CLASS NAME "very interesting" EXPRESSION ([pixel] &gt;= 1000) COLOR 0 255 0 END END
it_it: -- visualizzare un raster con le opzioni standard LAYER NAME coolwktraster TYPE raster STATUS ON DATA "PG:host=localhost port=5432 dbname='somedb' user='someuser' password='whatever' schema='someschema' table='cooltable' mode='2'" PROCESSING "NODATA=0" PROCESSING "SCALE=AUTO" #... other standard raster processing functions here #... classes are optional but useful for 1 band data CLASS NAME "boring" EXPRESSION ([pixel] &lt; 20) COLOR 250 250 250 END CLASS NAME "mildly interesting" EXPRESSION ([pixel] &gt; 20 AND [pixel] &lt; 1000) COLOR 255 0 0 END CLASS NAME "very interesting" EXPRESSION ([pixel] &gt;= 1000) COLOR 0 255 0 END END

source: -- displaying raster with standard raster options and a where clause LAYER NAME soil_survey2009 TYPE raster STATUS ON DATA "PG:host=localhost port=5432 dbname='somedb' user='someuser' password='whatever' schema='someschema' table='cooltable' where='survey_year=2009' mode='2'" PROCESSING "NODATA=0" #... other standard raster processing functions here #... classes are optional but useful for 1 band data END
it_it: -- visualizzare un raster con le opzioni standard e la clausola where LAYER NAME soil_survey2009 TYPE raster STATUS ON DATA "PG:host=localhost port=5432 dbname='somedb' user='someuser' password='whatever' schema='someschema' table='cooltable' where='survey_year=2009' mode='2'" PROCESSING "NODATA=0" #... other standard raster processing functions here #... classes are optional but useful for 1 band data END

source: The function is not unique error happens if one of your arguments is a textual representation of a geometry instead of a geometry. In these cases, PostgreSQL marks the textual representation as an unknown type, which means it can fall into the st_intersects(raster, geometry) or st_intersects(raster,raster) thus resulting in a non-unique case since both functions can in theory support your request. To prevent this, you need to cast the geometry to a geometry.
it_it: L'errore "function is not unique" si ha quando uno dei vostri argomenti e la rappresentazione testuale di una geometria, anziché una geometria vera e propria. In questi casi, PostgreSQL segna la rappresentazione testuale come tipo sconosciuto, che potrebbe essere applicato sia a st_intersects(raster, geometry) che a st_intersects(raster,raster), portando così a una situazione non univoca, dato che entrambe le funzioni supportano la tua richiesta. Al fine di evitare questa situazione, devi eseguire il cast della geometria in modo che sia effettivamente interpretata come geometria.

source: Here is a review from a PostGIS Raster user <ulink url="http://fuzzytolerance.info/blog/2010/10/26/2010-10-26-postgis-raster-ftw/">PostGIS raster applied to land classification urban forestry</ulink>
de: Einen Überblick über eine Anwendung von PostGIS Raster finden Sie unter <ulink url="http://fuzzytolerance.info/blog/2010/10/26/2010-10-26-postgis-raster-ftw/">PostGIS raster applied to land classification urban forestry</ulink>
ja: PostGISラスタのユーザからのレビューが<ulink url="http://fuzzytolerance.info/blog/2010/10/26/2010-10-26-postgis-raster-ftw/">PostGIS raster applied to land classification urban forestry</ulink>にあります。

source: The latest version of PostGIS comes packaged with a <varname>raster2pgsql</varname> raster loader executable capable of loading many kinds of rasters and also generating lower resolution overviews without any additional software. Please refer to <xref linkend="RT_Raster_Loader"/> for more details.
de: Die neueste Version von PostGIS hat den Rasterlader <varname>raster2pgsql</varname> mit im Paket. Dieser kann, ohne zusätzliche Software, verschiedenste Rasterformate laden und auch Overviews mit geringerer Auflösung erstellen. Siehe <xref linkend="RT_Raster_Loader"/> für weitere Details.
ja: PostGIS最新版には、ラスタローダ<varname>raster2pgsql</varname>があります。多種のラスタのロードが可能で、低解像度のオーバビューを作成することが可能な実行可能ファイルで、他のソフトウェアを要しません。詳細情報については<xref linkend="RT_Raster_Loader"/>を参照して下さい。
