Repository: postgis/postgis
Catalog: doc/po/*/installation.xml.po
Languages: es

source: There is an alternative <filename>legacy_minimal.sql</filename> you can run instead which will install barebones needed to recover tables and work with apps like MapServer and GeoServer. If you have views that use things like distance / length etc, you'll need the full blown <filename>legacy.sql</filename>
es: Hay una alternativa, se puede ejecutar el fichero <filename>legacy_minimal.sql</filename> que instalará los elementos necesarios para reemplazar tablas y que permitida trabajar con aplicaciones como MapServer y GeoServer. Si tienes vistas que utilizan funciones tipo distancia/longitud etc, necesitaras ejecutar el fichero <filename>legacy.sql</filename> completo.

source: You can later run <filename>uninstall_legacy.sql</filename> to get rid of the deprecated functions after you are done with restoring and cleanup.
es: Después podrás ejecutar <filename>uninstall_legacy.sql</filename> para obtener el rid de las funciones obsoletas después de haber restaurado y limpiado.

source: Creating a spatial database using EXTENSIONS
es: Crear una base de datos espacial utilizando EXTENSIONS

source: If you are using PostgreSQL 9.1+ and have compiled and installed the extensions/ postgis modules, you can create a spatial database the new way.
es: Si estas utilizando PostgreSQL 9.1+ y has compilado e instalado los módulos/extensión PostGIS, puedes crear una base de datos espacial de otra manera.

source: The core postgis extension installs PostGIS geometry, geography, raster, spatial_ref_sys and all the functions and comments with a simple: <programlisting>CREATE EXTENSION postgis;</programlisting> command.
es: El núcleo de la extensión postgis, instala geometry, geography, raster, spatial_ref_sys y todos los comentarios de las funciones PostGIS con un simple comando:<programlisting>CREATE EXTENSION postgis;</programlisting>.

source: Topology is packaged as a separate extension and installable with command:
es: Topology esta compilado como una extensión separada y se puede instalar con el comando:

source: Installing, Upgrading Tiger Geocoder and loading data
es: Instalar o actualizar el geocodificador Tiger y cargar datos

source: The Tiger geocoder does not get installed / upgraded with the core PostGIS scripts because it is only of regional use. In fact nothing located in the extras folder is installed by default with the regular PostGIS install / upgrade. Extras like Tiger geocoder may also not be packaged in your PostGIS distribution, but will always be available in the postgis-&last_release_version;.tar.gz file. The instructions provided here are also available in the <filename>extras/tiger_geocoder/tiger_2010/README</filename>
es: El geocodificador Tiger no se instala/actualiza con el script del núcleo de PostGIS por que es solo de uso regional. De hecho nada del contenido de la carpeta extras se instala por defecto con La instalación/actualización standard de PostGIS. Los extras como el geocodificador Tiger no están compilados en la distribución PostGIS, pero estará siempre disponible en el fichero &last_release_version;.tar.gz. Las instrucciones aquí descritas, también están disponibles en el fichero <filename>extras/tiger_geocoder/tiger_2010/README</filename>

source: If you are on Windows and you don't have tar installed, you can use <ulink url="http://www.7-zip.org/">http://www.7-zip.org/</ulink> to unzip the PostGIS tarball.
es: Si estas en Windows y no tienes instalador tar, puedes utilizar <ulink url="http://www.7-zip.org/">http://www.7-zip.org/</ulink> para descomprimir el tarball de PostGIS.

source: Tiger Geocoder Enabling your PostGIS database
es: Activar el geocodificador Tiger en tu base de datos PostGIS

source: First install PostGIS using the prior instructions.
es: Primero debes instalar PostGIS con las instrucciones anteriores.

source: If you don't have an extras folder, download <ulink url="http://www.postgis.org/download/postgis-&last_release_version;.tar.gz">http://www.postgis.org/download/postgis-&last_release_version;.tar.gz</ulink>
es: Si no tienes la carpeta extras, puedes descargar <ulink url="http://www.postgis.org/download/postgis-&last_release_version;.tar.gz">http://www.postgis.org/download/postgis-&last_release_version;.tar.gz</ulink>

source: Edit the <filename>tiger_loader.sql</filename> to the paths of your executables server etc.
es: Edita el fichero <filename>tiger_loader.sql</filename> para añadir los directorios de tu servidor, etc...

source: If you are installing Tiger geocoder for the first time edit either the <filename>create_geocode.bat</filename> script If you are on windows or the <filename>create_geocode.sh</filename> if you are on Linux/Unix/Mac OSX with your PostgreSQL specific settings and run the corresponding script from the commandline. If you don't edit this file, it will just contain common case locations of items. You can edit the generated script after the fact when you run the <xref linkend="Loader_Generate_Script"/> command.
es: Si es la primera vez que instalas en geocodificador Tiger, edita el script <filename>create_geocode.bat</filename> si estas en windows o <filename>create_geocode.sh</filename> si estas en Linux/Unix/Mac OSX con las propiedades de tu instalación PostgreSQL y ejecuta el script correspondiente el tu linea de comandos. Si no editas este fichero, contendrá los emplazamientos por defecto. Puedes editar el script generado después, cuando ejecutas el comando <xref linkend="Loader_Generate_Script"/>

source: Verify that you now have a <varname>tiger</varname> schema in your database and that it is part of your database search_path. If it is not, add it with a command something along the line of:
es: Verifica que ahora tienes el esquema <varname>tiger</varname> en tu base de datos y este forma parte de tu variable search_path en la base de datos. Si no, añádelo con un comando parecido al siguiente:

source: The normalizing address functionality works more or less without any data except for tricky addresses. Run this test and verify things look like this:
es: La funcionalidad de normalización de direcciones funciona sin datos mas o menos, excepto para direcciones complejas. Ejecuta el siguiente test y verifica si se parece a esto:

source: Upgrading your Tiger Geocoder Install
es: Actualizando la instalación del geocodificador Tiger

source: If you have Tiger Geocoder packaged with 2.0+ already installed, you can upgrade the functions at any time even from an interim tar ball if there are fixes you badly need.
es: Si ya tienes instalado el geocodificador Tiger en una versión 2.0+, puedes actualizar las funciones si existen corrección de errores críticos que necesitas en cualquier momento, incluso desde un tar.

source: Locate the <filename>upgrade_geocoder.bat</filename> script If you are on windows or the <filename>upgrade_geocoder.sh</filename> if you are on Linux/Unix/Mac OSX. Edit the file to have your postgis database credientials and run then corresponding script from the commandline.
es: Localiza el script <filename>upgrade_geocoder.bat</filename> si estas en windows o <filename>upgrade_geocoder.sh</filename> si estas en Linux/Unix/Mac OSX. Edita el fichero para incluir las credenciales de tu base de datos postgis y ejecuta el script correspondiente desde la linea de comandos.

source: Next drop all nation tables and load up the new ones. Generate a drop script with this SQL statement as detailed in <xref linkend="Drop_Nation_Tables_Generate_Script"/>
es: Después, elimina todas las tabals de naciones y carga las nuevas. Genera un script drop con esta sentencia SQL como se detalla en <xref linkend="Drop_Nation_Tables_Generate_Script"/>

source: Run the generated drop SQL statements.
es: Ejecuta la sentencia SQL drop

source: Generate a nation load script with this SELECT statement as detailed in <xref linkend="Loader_Generate_Nation_Script"/>
es: Genera un script de carga de naciones con esta sentencia SELECT como se detalla en <xref linkend="Loader_Generate_Nation_Script"/>

source: For windows
es: Para windows

source: For unix/linux
es: Para unix/linux

source: Refer to <xref linkend="tiger_geocoder_loading_data"/> for instructions on how to run the generate script. This only needs to be done once.
es: Para mas información sobre como ejecutar los scripts generados visita <xref linkend="tiger_geocoder_loading_data"/>. Esto solo es necesario hacerlo una vez.

source: You can have a mix of 2010/2011 state tables and can upgrade each state separately. Before you upgrade a state to 2011, you first need to drop the 2010 tables for that state using <xref linkend="Drop_State_Tables_Generate_Script"/>.
es: Puedes tener una mezcla de tablas de estados de 2010/2011 y puedes actualizar cada estado por separado. Antes de actualizar un estado a la versión de 2011 debes suprimir las tablas de este estado para 2010 utilizando <xref linkend="Drop_State_Tables_Generate_Script"/>.

source: Loading Tiger Data
es: Cargando datos Tiger

source: The instructions for loading data are available in a more detailed form in the <filename>extras/tiger_geocoder/tiger_2011/README</filename>. This just includes the general steps.
es: Las instrucciones de carga de datos están disponibles de forma mas detallada en <filename>extras/tiger_geocoder/tiger_2011/README</filename>. Esto solo describe los pasos generales.

source: The load process downloads data from the census website for the respective nation files, states requested, extracts the files, and then loads each state into its own separate set of state tables. Each state table inherits from the tables defined in <varname>tiger</varname> schema so that its sufficient to just query those tables to access all the data and drop a set of state tables at any time using the <xref linkend="Drop_State_Tables_Generate_Script"/> if you need to reload a state or just don't need a state anymore.
es: El proceso de carga, descarga datos desde el sitio web del censo de las respectivas naciones de los estados pedidos, extrae los ficheros, y carga cada estado en un conjunto separado por estados en su propia tabla. Cada tabla de estado hereda el esquema de tablas definido en <varname>tiger</varname> así que basta con hacer una consulta a estas tablas para acceder a todos los datos de la tabla de estados en cualquier momento utilizando <xref linkend="Drop_State_Tables_Generate_Script"/> si necesita volver a cargar un estado o si ya no lo necesitas mas.

source: In order to be able to load data you'll need the following tools:
es: Para poder cargar los datos necesitarás las siguientes herramientas:

source: A tool to unzip the zip files from census website.
es: Una herramienta para descomprimir ficheros zip de la pagina web del censo.

source: For Unix like systems: <varname>unzip</varname> executable which is usually already installed on most Unix like platforms.
es: Para sistemas Unix: el ejecutable <varname>unzip</varname> que normalmente esta instalado en la mayoría de sistemas Unix.

source: For Windows, 7-zip which is a free compress/uncompress tool you can download from <ulink url="http://www.7-zip.org/">http://www.7-zip.org/</ulink>
es: Para windows, 7-zip es una herramienta libre de compresión/descompresión que puedes descargar en <ulink url="http://www.7-zip.org/">http://www.7-zip.org/</ulink>

source: <filename>shp2pgsql</filename> commandline which is installed by default when you install PostGIS.
es: El comando <filename>shp2pgsql</filename> que se instala por defecto cuando instalas PostGIS.

source: <filename>wget</filename> which is a web grabber tool usually installed on most Unix/Linux systems.
es: <filename>wget</filename> que es una herramienta de captura web, normalmente instalado en los sistemas Unix/Linux.

source: If you are on windows, you can get pre-compiled binaries from <ulink url="http://gnuwin32.sourceforge.net/packages/wget.htm">http://gnuwin32.sourceforge.net/packages/wget.htm</ulink>
es: Si estas en windows, puedes obtener ejecutables precompilados en <ulink url="http://gnuwin32.sourceforge.net/packages/wget.htm">http://gnuwin32.sourceforge.net/packages/wget.htm</ulink>

source: If you are upgrading from tiger_2010, you'll need to first generate and run <xref linkend="Drop_Nation_Tables_Generate_Script"/>. Before you load any state data, you need to load the nation wide data which you do with <xref linkend="Loader_Generate_Nation_Script"/>. Which will generate a loader script for you.
es: Si estas actualizando desde la version tiger_2010, necesitaras generar y ejecutar primero <xref linkend="Drop_Nation_Tables_Generate_Script"/>. Antes de cargar los datos de cualquier estado, necesitas descargar los datos de la nación entera con <xref linkend="Loader_Generate_Nation_Script"/>. Que generara el script de carga para ti.

source: To load data refer to <xref linkend="Loader_Generate_Script"/> to generate a data load script for your platform for the states you desire. Note that you can install these piecemeal. You don't have to load all the states you want all at once. You can load them as you need them.
es: Para cargar datos ve a <xref linkend="Loader_Generate_Script"/> para generar un script de carga de datos para tu plataforma, de los estados que quieras. Ten en cuenta que puedes cargar estos poco a poco. No necesitas cargar todos los estados de golpe. Puedes cargarlos cuando los necesites.

source: After the states you desire have been loaded, make sure to run the: <programlisting>SELECT install_missing_indexes();</programlisting> as described in <xref linkend="Install_Missing_Indexes"/>.
es: Una vez que los estados que quieres han sido cargados, asegurare de ejecutar: <programlisting>SELECT install_missing_indexes();</programlisting> como se explica en <xref linkend="Install_Missing_Indexes"/>.

source: To test that things are working as they should, try to run a geocode on an address in your state using <xref linkend="Geocode"/>
es: Para probar que las cosas han funcionado como deberían, intenta ejecutar una geocodificacion en una dirección del estado descargado utilizando <xref linkend="Geocode"/>

source: Create a spatially-enabled database from a template
es: Crear una base de datos espacial desde una plantilla

source: Some packaged distributions of PostGIS (in particular the Win32 installers for PostGIS &gt;= 1.1.5) load the PostGIS functions into a template database called <varname>template_postgis</varname>. If the <varname>template_postgis</varname> database exists in your PostgreSQL installation then it is possible for users and/or applications to create spatially-enabled databases using a single command. Note that in both cases, the database user must have been granted the privilege to create new databases.
es: Algunas de las distribuciones precompiladas de PostGIS (en particular los instaladores de Postgis &gt;= 1.1.5 para sistemas Win32) carga las funciones de PostGIS en una base de datos plantilla llamada <varname>template_postgis</varname>. Si la base de datos <varname>template_postgis</varname> existe ya en nuestra instalación de PostgreSQL, los usuarios y aplicaciones podrán crear bases de datos espaciales con un simple comando. En ambos casos, el usuario de la base de datos debe tener privilegios para crear nuevas bases de datos

source: From the shell:
es: En la linea de comandos:

source: From SQL:
es: Desde SQL:

source: Upgrading
es: Actualizando

source: Upgrading existing spatial databases can be tricky as it requires replacement or introduction of new PostGIS object definitions.
es: Actualizar una base de datos espacial puede ser complejo ya que requiere reemplazar o introducir nuevas definiciones de objetos PostGIS.

source: Unfortunately not all definitions can be easily replaced in a live database, so sometimes your best bet is a dump/reload process.
es: Desafortunadamente, no todas las definiciones pueden reemplazarse fácilmente en una base de datos activa, así que algunas veces lo mejor es un proceso copia de seguridad/recarga.

source: PostGIS provides a SOFT UPGRADE procedure for minor or bugfix releases, and a HARD UPGRADE procedure for major releases.
es: PostGIS incluye una SOFT UPGRADE (actualización ligera) para actualizaciones menores o corrección de errores, y una HARD UPGRADE (Actualización pesada) para versiones mayores.

source: Before attempting to upgrade PostGIS, it is always worth to backup your data. If you use the -Fc flag to pg_dump you will always be able to restore the dump with a HARD UPGRADE.
es: Antes de realizar una actualización de PostGIS, es recomendable hacer una copia de seguridad de los datos. Si utilizas la opción -Fc en el comando pg_dump siempre podrás restaurar la copia realizada con un HARD UPDATE.

source: Soft upgrade
es: Actualizacion Ligera

source: If you installed your database using extensions, you'll need to upgrade using the extension model as well. If you installed using the old sql script way, then you should upgrade using the sql script way. Please refer to the appropriate.
es: Si instalaste la base de datos utilizando extensiones, necesitaras actualizar utilizando el modelo de extensiones tambien. Si instalaste utilizando el antiguo metodo de script sql, necesitaras actualizar el metodo de script sql. Consulta el metodo adecuado.

source: Soft Upgrade Pre 9.1+ or without extensions
es: Actualización ligera anterior a la versión PostgreSQL 9.1+ o sin extensiones

source: This section applies only to those who installed PostGIS not using extensions. If you have extensions and try to upgrade with this approach you'll get messages like:
es: Esta sección describe el método para quienes instalaron PostGIS sin utilizar extensiones solamente. Si tienes extensiones e intentas actualizar con este metodo, tendras mensajes como los siguientes:

source: can't drop ... because postgis extension depends on it
es: no se puede suprimir ... porque la extensión postgis depende de el

source: After compiling you should find several <filename>postgis_upgrade*.sql</filename> files. Install the one for your version of PostGIS. For example <filename>postgis_upgrade_13_to_15.sql</filename> should be used if you are upgrading from PostGIS 1.3 to 1.5. If you are moving from PostGIS 1.* to PostGIS 2.* or from PostGIS 2.* prior to r7409, you need to do a HARD UPGRADE.
es: Después de compilar deberías encontrar algunos fichero como <filename>postgis_upgrade*.sql</filename>. Instala el que corresponde con tu version de PostGIS. Por ejemplo el fichero <filename>postgis_upgrade_13_to_15.sql</filename> debe utilizarse si tienes que actualizar desde PostGIS 1.3 a 1.5. Si estas actualizando desde PostGIS 1.* a PostGIS 2.* o desde PostGIS 2.* anterior a r7409, necesitas hacer una actualizacion pesada o HARD UPDATE.

source: The same procedure applies to raster and topology extensions, with upgrade files named <filename>rtpostgis_upgrade*.sql</filename> and <filename>topology_upgrade*.sql</filename> respectively. If you need them:
es: El mimo proceso se emplea para las extensiones raster y topology, con ficheros de actualizacion llamados <filename>rtpostgis_upgrade*.sql</filename> y <filename>topology_upgrade*.sql</filename> respectivamente. Si lo necesitas, entoces:

source: If you can't find the <filename>postgis_upgrade*.sql</filename> specific for upgrading your version you are using a version too early for a soft upgrade and need to do a HARD UPGRADE.
es: Si no puedes encontrar el fichero <filename>postgis_upgrade*.sql</filename> especifico para actualizar tu version, estas utilizando una version previa para una actualización ligera y necesitas hacer una actualización completa o HARD UPGRADE.

source: The <xref linkend="PostGIS_Full_Version"/> function should inform you about the need to run this kind of upgrade using a "procs need upgrade" message.
es: La función <xref linkend="PostGIS_Full_Version"/> debe darte la información sobre la necesidad de ejecutar este tipo de actualización utilizando el mensaje "procs need upgrade".

source: Soft Upgrade 9.1+ using extensions
es: Actualizacion ligera 9.1+ utilizando extensiones

source: If you originally installed PostGIS with extensions, then you need to upgrade using extensions as well. Doing a minor upgrade with extensions, is fairly painless.
es: Si has instalado originalmente PostGIS con extensiones, entonces necesitas actualizar utilizando extensiones también. Hacer una actualización menor con extensiones es bastante sencillo.

source: If you get an error notice something like:
es: Si obtienes un error parecido a:

source: Then you'll need to backup your database, create a fresh one as described in <xref linkend="create_new_db_extensions"/> and then restore your backup ontop of this new database. You might get a message that <code>postgis extension</code> already installed which you can safely ignore.
es: Entonces, necesitas hacer una copia de seguridad de tu base de datos, crear una nueva según se describe en <xref linkend="create_new_db_extensions"/> y entonces restaurar tu copia de seguridad en esta nueva base de datos. Probablemente obtengas un mensaje como que la <code>extension postgis</code> ya esta instalada, puedes ignorar este mensaje con tranquilidad.

source: If you installed PostGIS originally without a version specified, you can often skip the reinstallation of postgis extension before restoring since the backup just has <code>CREATE EXTENSION postgis</code> and thus picks up the newest latest version during restore. .
es: Si has instalado PostGIS sin una version especificada, a menudo se puede omitir la reinstalación de la extensión PostGIS antes de restaurar desde la copia de seguridad sólo tienes que ejecutar <code> CREATE EXTENSION postgis</code> y así recoge la nueva versión más reciente durante la restauración.

source: Hard upgrade
es: Actualizacion pesada o HARD UPDATE

source: By HARD UPGRADE we mean full dump/reload of postgis-enabled databases. You need a HARD UPGRADE when PostGIS objects' internal storage changes or when SOFT UPGRADE is not possible. The <link linkend="release_notes">Release Notes</link> appendix reports for each version whether you need a dump/reload (HARD UPGRADE) to upgrade.
es: Por actualización pesada se entiende una copia de seguridad/recarga completa de datos en la base de datos espacial. Necesitas una actualización pesada cuando los objetos internos de almacenamiento de PostGIS cambian o cuando una actualización ligera no es posible. Las notas <link linkend="release_notes">Release Notes</link> del apéndice hay informes de cada version y de si necesitas hacer una copia de seguridad/recarga de datos (HARD UPGRADE) para actualizar.

source: The dump/reload process is assisted by the postgis_restore.pl script which takes care of skipping from the dump all definitions which belong to PostGIS (including old ones), allowing you to restore your schemas and data into a database with PostGIS installed without getting duplicate symbol errors or bringing forward deprecated objects.
es: El proceso copia de seguridad/recarga de datos esta asistido por el script postgis_restore.pl te toma en cuenta ignorar en la copia de seguridad todas las definiciones que pertenecen a PostGIS (incluyendo las antiguas), permitiéndote restaurar tus esquemas y datos en una base de datos con PostGIS instalado sin tener que duplicar errores o trayendo objetos rechazados.

source: Supplementary instructions for windows users are available at <ulink url="http://trac.osgeo.org/postgis/wiki/UsersWikiWinUpgrade">Windows Hard upgrade</ulink>.
es: Instruciones complementarias para windows están disponibles en <ulink url="http://trac.osgeo.org/postgis/wiki/UsersWikiWinUpgrade">Windows Hard upgrade</ulink>.

source: The Procedure is as follows:
es: El procedimiento es como sigue:
