Repository: postgis/postgis
Catalog: doc/po/*/installation.xml.po
Languages: es

source: Create a "custom-format" dump of the database you want to upgrade (let's call it <varname>olddb</varname>) include binary blobs (-b) and verbose (-v) output. The user can be the owner of the db, need not be postgres super account.
es: Crea un "formato personalizado" de copia de seguridad de la base de datos que asieres actualizar (llamemosla <varname>olddb</varname>) incluye binarios bolb (-b) y salida verbose (-v). El usuario puede ser el propietario de la base de datos, no necesitas una cuenta de superusuario postgres.

source: Do a fresh install of PostGIS in a new database -- we'll refer to this database as <varname>newdb</varname>. Please refer to <xref linkend="create_new_db"/> and <xref linkend="create_new_db_extensions"/> for instructions on how to do this.
es: Haz una nueva instalación de PsotGIS en una nueva base de datos --la llamaremos <varname>newdb</varname> en este ejemplo. Puedes obtener información de como hacer esto en <xref linkend="create_new_db"/> y <xref linkend="create_new_db_extensions"/>

source: The spatial_ref_sys entries found in your dump will be restored, but they will not override existing ones in spatial_ref_sys. This is to ensure that fixes in the official set will be properly propagated to restored databases. If for any reason you really want your own overrides of standard entries just don't load the spatial_ref_sys.sql file when creating the new db.
es: Las entradas que se encuentren en tu copia de seguridad de la tabla spatial_ref_sys serán restauradas, pero pero no reescribiran las existentes en la nueva tabla spatial_ref_sys. Esto es para asegurar que las soluciones en el conjunto oficial se propagarán correctamente para las bases de datos restauradas. Si por algún motivo, realmente quieres que tus entradas reemplacen las entradas estándar simplemente no cargues el archivo spatial_ref_sys.sql al crear la nueva db.

source: If your database is really old or you know you've been using long deprecated functions in your views and functions, you might need to load <filename>legacy.sql</filename> for all your functions and views etc. to properly come back. Only do this if _really_ needed. Consider upgrading your views and functions before dumping instead, if possible. The deprecated functions can be later removed by loading <filename>uninstall_legacy.sql</filename>.
es: Si tu base de datos es muy antigua o sabes que has estado utilizando funciones rechazadas en tus vistas y funciones, necesitaras cargar el fichero <filename>legacy.sql</filename> para todas tus funciones y vistas para que funcionen correctamente. Haz esto solamente si es indispensable. Considera actualizar tus vistas y funciones antes de hacer una copia de seguridad si es posible. Las funciones rechazadas pueden borrarse cargando el fichero <filename>uninstall_legacy.sql</filename> después.

source: Restore your backup into your fresh <varname>newdb</varname> database using postgis_restore.pl. Unexpected errors, if any, will be printed to the standard error stream by psql. Keep a log of those.
es: Restaura tu copia de seguridad en tu nueva base de datos <varname>newdb</varname> utilizando el script postgis_restore.pl. Si aparecen errores inesperados, se imprimirán en la consola de psql. Ten un inventario de estos.

source: Errors may arise in the following cases:
es: Los errores se producirán en alguno de estos casos:

source: Some of your views or functions make use of deprecated PostGIS objects. In order to fix this you may try loading <filename>legacy.sql</filename> script prior to restore or you'll have to restore to a version of PostGIS which still contains those objects and try a migration again after porting your code. If the <filename>legacy.sql</filename> way works for you, don't forget to fix your code to stop using deprecated functions and drop them loading <filename>uninstall_legacy.sql</filename>.
es: Alguna de tus vistas o funciones hacen uso de funciones rechazadas de objetos PostGIS. Para corregir estos deberás intentar cargar el script <filename>legacy.sql</filename> antes de restaurar o deberás restaurar a una version de PsotGIS que todavía contenga estos objetos e intentar hacer la migración otra vez después de migrar tu código. Si el uso del fichero <filename>legacy.sql</filename> funciona, no olvides corregir tu código para dejar de utilizar funciones rechazadas, y elimina el script <filename>legacy.sql</filename> ejecutando <filename>uninstall_legacy.sql</filename>.

source: Some custom records of spatial_ref_sys in dump file have an invalid SRID value. Valid SRID values are bigger than 0 and smaller than 999000. Values in the 999000.999999 range are reserved for internal use while values > 999999 can't be used at all. All your custom records with invalid SRIDs will be retained, with those > 999999 moved into the reserved range, but the spatial_ref_sys table would loose a check constraint guarding for that invariant to hold and possibly also its primary key ( when multiple invalid SRIDS get converted to the same reserved SRID value ).
es: Algunos valores personalizados de la copia de la tabla spatial_ref_sys pueden tener un valor no valido de SRID. Los valores validos deben ser mayores que 0 y menores que 999000. Valores en el rango 999000.999999 están reservados para uso interno y valores mayores que 999999 no están permitidos para nada. Todos los valores personalizados con SRIDs inválidos serán conservados, con los valores personalizados > 999999 se moverán en el rango reservado, pero la tabla spatial_ref_sys perderá la restricción check que guarda para esta constante y probablemente también su clave primaria (cuando multiples valores personalizados de SRID se conviertan al mismo valor SRID reservado)

source: In order to fix this you should copy your custom SRS to a SRID with a valid value (maybe in the 910000..910999 range), convert all your tables to the new srid (see <xref linkend="UpdateGeometrySRID"/>), delete the invalid entry from spatial_ref_sys and re-construct the check(s) with:
es: Para corregir esto deberías copiar tus SRS personalizados en in SRID con un valor (quizás en el rango de valores 910000..910999), convertir todas las tablas al nuevo srid (ver como hacer esto en <xref linkend="UpdateGeometrySRID"/>), borrar las entradas invalidas de la tabla spatial_ref_sys y reconstruir la o las restricciones chek con:

source: Common Problems
es: Problemas comunes

source: There are several things to check when your installation or upgrade doesn't go as you expected.
es: Hay varias cosas a comprobar cuando la instalación o actualización no han fusionado como se esperaba.

source: Check that you have installed PostgreSQL &min_postgres_version; or newer, and that you are compiling against the same version of the PostgreSQL source as the version of PostgreSQL that is running. Mix-ups can occur when your (Linux) distribution has already installed PostgreSQL, or you have otherwise installed PostgreSQL before and forgotten about it. PostGIS will only work with PostgreSQL &min_postgres_version; or newer, and strange, unexpected error messages will result if you use an older version. To check the version of PostgreSQL which is running, connect to the database using psql and run this query:
es: Comprueba que tienes instalado PostgreSQL &min_postgres_version; o posterior, y que estas compilando para esta version de PostgreSQL que estas utilizando. Se pueden producir confusiones cuando tu distribución (Linux)ya tiene instalada PostgreSQL, o has instalado antes PostgreSQL y lo has olvidado. PostGIS solo funcionará con PostgreSQL &min_postgres_version; o superior, y errores inesperados o extraños pueden ocurrir si utilizas una version mas antigua. Para comprobar la version de PostgreSQL que esta instalada y ejecutándose, conectare a la base de datos utilizando psql y ejecuta la siguiente consulta:

source: If you are running an RPM based distribution, you can check for the existence of pre-installed packages using the <command>rpm</command> command as follows: <command>rpm -qa | grep postgresql</command>
es: Si estas ejecutando una version basada en una distribución RPM, puedes comprobar si existen paquetes pre-instalados utilizando el comando <command>rpm</command> como sigue: <command>rpm -qa | grep postgresql</command>

source: If your upgrade fails, make sure you are restoring into a database that already has PostGIS installed.
es: Si tienes errores en la actualización, asegúrate de que estas restaurando tu base de datos en una que tenga instalada PostGIS.

source: Also check that configure has correctly detected the location and version of PostgreSQL, the Proj4 library and the GEOS library.
es: Comprueba que tu configuración detecta la ubicación y la version correctas de PostgreSQL, la librería Proj4 y la librería GEOS.

source: The output from configure is used to generate the <filename>postgis_config.h</filename> file. Check that the <varname>POSTGIS_PGSQL_VERSION</varname>, <varname>POSTGIS_PROJ_VERSION</varname> and <varname>POSTGIS_GEOS_VERSION</varname> variables have been set correctly.
es: La salida de configure se utiliza para generar el fichero <filename>postgis_config.h</filename>. Comprueba que la variables <varname>POSTGIS_PGSQL_VERSION</varname>, <varname>POSTGIS_PROJ_VERSION</varname> y <varname>POSTGIS_GEOS_VERSION</varname>, han sido bien configuradas.

source: The JDBC extensions provide Java objects corresponding to the internal PostGIS types. These objects can be used to write Java clients which query the PostGIS database and draw or do calculations on the GIS data in PostGIS.
es: La extension JDBC proporciona objetos Java correspondientes a los tipos internos de PostGIS. Estos objetos se pueden utilizar para escribir con clientes Java que interrogan a la base de datos PostGIS y dibujan o calculan el los datos GIS de PostGIS.

source: Enter the <filename>java/jdbc</filename> sub-directory of the PostGIS distribution.
es: Entra el subdirectorio <filename>java/jdbc</filename> de la distribucion PostGIS.

source: Run the <filename>ant</filename> command. Copy the <filename>postgis.jar</filename> file to wherever you keep your java libraries.
es: Ejecuta el comando <filename>ant</filename>. Copia el fichero <filename>postgis.jar</filename> donde tengas tus librerías java.

source: The JDBC extensions require a PostgreSQL JDBC driver to be present in the current CLASSPATH during the build process. If the PostgreSQL JDBC driver is located elsewhere, you may pass the location of the JDBC driver JAR separately using the -D parameter like this:
es: La extension JDBC requiere que el driver PostgreSQL JDBC este presente en la variable de entorno CLASSPATH durante el proceso de compilación. Si el driver PostgreSQL JDBC esta ubicado en otro lugar, puedes pasar como parámetro la ubicación del driver JDBC separadamente utilizando el parámetro -D como sigue:

source: PostgreSQL JDBC drivers can be downloaded from <ulink url="http://jdbc.postgresql.org"> http://jdbc.postgresql.org </ulink> .
es: Los drivers JDBC pueden descargares desde <ulink url="http://jdbc.postgresql.org"> http://jdbc.postgresql.org </ulink> .

source: Loader/Dumper
es: Cargador/Dumper

source: The data loader and dumper are built and installed automatically as part of the PostGIS build. To build and install them manually:
es: El cargador y dumper de datos se compila e instala de forma automática como parte de la distribución de PostGIS. Para compilar e instalar de forma manual puedes ejecutar:

source: The loader is called <filename>shp2pgsql</filename> and converts ESRI Shape files into SQL suitable for loading in PostGIS/PostgreSQL. The dumper is called <filename>pgsql2shp</filename> and converts PostGIS tables (or queries) into ESRI Shape files. For more verbose documentation, see the online help, and the manual pages.
es: El cargador se llama <filename>shp2pgsql</filename> y convierte ficheros Shape de ESRI en sentencias SQL necesarias para cargarlo en PostGIS/PostgreSQL. El dumper se llama <filename>pgsql2shp</filename> y convierte tablas PostGIS (o sentencias) en ficheros Shape de ESRI. Para mayor información, puedes ver la información en linea y las pagnas del manual.
