Repository: postgis/postgis
Catalog: doc/po/*/installation.xml.po
Languages: es

source: Installation
es: Instalación

source: This chapter details the steps required to install PostGIS.
es: En este capítulo se detallan los pasos necesarios para instalar PostGIS .

source: Short Version
es: Versión corta

source: The raster support is currently optional, but installed by default. For installing using the PostgreSQL 9.1+ extensions model it is required. Please refer to <xref linkend="make_install_postgis_extensions"/> if you are using PostgreSQL 9.1+.
es: El soporte raster es actualmente opcional, pero se instala por defecto . Para instalarlo se requiere el PostgreSQL 9.1 + modelo de extensiones. si estas usando PostgreSQL 9.1+ ve a <xref linkend="make_install_postgis_extensions"/>.

source: All the .sql files once installed will be installed in share/contrib/postgis-&last_release_version; folder of your PostgreSQL install
es: Todos los archivos SQL, una vez instalados se encuentran en la carpeta share/contrib/postgis-&last_release_version; de su instalación PostgreSQL.

source: The <varname>postgis_comments.sql</varname>, <varname>raster_comments.sql</varname>, <varname>topology_comments.sql</varname> generate quick help tips for each function that can be accessed via pgAdmin III or psql. In psql with a command of the form e.g.<varname>\dd ST_SetPoint</varname>
es: Los ficheros <varname>postgis_comments.sql</varname>, <varname>raster_comments.sql</varname>, <varname>topology_comments.sql</varname> generan comentarios de ayuda para cada funcion acesible desde pgAdmin III o psql. Un ejemplo de comando psql para obtener esta ayuda es<varname>\dd ST_SetPoint</varname>

source: tar xvfz postgis-&last_release_version;.tar.gz cd postgis-&last_release_version; ./configure --with-raster --with-topology --with-gui make make install createdb yourdatabase createlang plpgsql yourdatabase psql -d yourdatabase -f postgis.sql psql -d yourdatabase -f postgis_comments.sql psql -d yourdatabase -f spatial_ref_sys.sql psql -d yourdatabase -f rtpostgis.sql psql -d yourdatabase -f raster_comments.sql psql -d yourdatabase -f topology/topology.sql psql -d yourdatabase -f doc/topology_comments.sql
es: tar xvfz postgis-&last_release_version;.tar.gz cd postgis-&last_release_version; ./configure --with-raster --with-topology --with-gui make make install createdb tubasededatos createlang plpgsql tubasededatos psql -d tubasededatos -f postgis.sql psql -d tubasededatos -f postgis_comments.sql psql -d tubasededatos -f spatial_ref_sys.sql psql -d tubasededatos -f rtpostgis.sql psql -d tubasededatos -f raster_comments.sql psql -d tubasededatos -f topology/topology.sql psql -d tubasededatos -f doc/topology_comments.sql

source: <filename>topology_comments.sql</filename> since its an optional feature is not installed by <command>make install</command> or <command>make comments-install</command>. However if you do a <command>make comments</command> or <command>make topology_comments.sql</command>, it will be generated in the docs folder
es: Debido a que es una característica opcional, <filename>topology_comments.sql</filename> no se instala con <command>make install</command> o <command>make comments-install</command>. De todas formas si escribimos el comando<command>make comments</command> o <command>make topology_comments.sql</command>, se generaran los comentarios en la carpeta docs.

source: The rest of this chapter goes into detail each of the above installation steps.
es: El resto del capitulo entra en los detalles de cada uno de los pasos de instalación anteriores.

source: Requirements
es: Requisitos

source: PostGIS has the following requirements for building and usage:
es: PostGIS tiene los siguientes requisitos para compilarlo y usarlo:

source: Required
es: Requerido

source: PostgreSQL &min_postgres_version; or higher. A complete installation of PostgreSQL (including server headers) is required. PostgreSQL is available from <ulink url="http://www.postgresql.org"> http://www.postgresql.org </ulink> .
es: PostgreSQL &min_postgres_version; o superior. Una instalación completa de PostgreSQL (incluyendo las cabeceras del servidor) es necesaria. PostgreSQL esta disponible en <ulink url="http://www.postgresql.org"> http://www.postgresql.org </ulink> .

source: For a full PostgreSQL / PostGIS support matrix and PostGIS/GEOS support matrix refer to <ulink url="http://trac.osgeo.org/postgis/wiki/UsersWikiPostgreSQLPostGIS">http://trac.osgeo.org/postgis/wiki/UsersWikiPostgreSQLPostGIS</ulink>
es: Para conocer las compatibilidades entre versiones de PostgreSQL/PostGIS y PostGIS/GEOS puede ver una matriz de compatibilidades en <ulink url="http://trac.osgeo.org/postgis/wiki/UsersWikiPostgreSQLPostGIS">http://trac.osgeo.org/postgis/wiki/UsersWikiPostgreSQLPostGIS</ulink>

source: GNU C compiler (<filename>gcc</filename>). Some other ANSI C compilers can be used to compile PostGIS, but we find far fewer problems when compiling with <filename>gcc</filename>.
es: compilador GNU C (<filename>gcc</filename>). Otros compiladores ANSI C pueden utilizarse para compilar PostGIS, pero encontraremos menos problemas al compilar con <filename>gcc</filename>.

source: GNU Make (<filename>gmake</filename> or <filename>make</filename>). For many systems, GNU <filename>make</filename> is the default version of make. Check the version by invoking <filename>make -v</filename>. Other versions of <filename>make</filename> may not process the PostGIS <filename>Makefile</filename> properly.
es: GNU Make (<filename>gmake</filename> or <filename>make</filename>). Para muchos sistemas , GNU <filename>make</filename> es la versión por defecto de make. Para verificar la versión de make podemos ejecutar el siguiente comando <filename>make -v</filename>. Otras versiones de <filename>make</filename> pueden no procesar el fichero PostGIS <filename>Makefile</filename> de forma correcta.

source: Proj4 reprojection library, version 4.6.0 or greater. The Proj4 library is used to provide coordinate reprojection support within PostGIS. Proj4 is available for download from <ulink url="http://trac.osgeo.org/proj/"> http://trac.osgeo.org/proj/ </ulink> .
es: La librería de reproyección Proj4 , en su versión versión 4.6.0 o superior. La librería Proj4 es utilizada para dar soporte a la reproyección de coordenadas en PostGIS. Proj4 esta disponible para descargar en <ulink url="http://trac.osgeo.org/proj/"> http://trac.osgeo.org/proj/ </ulink> .

source: GEOS geometry library, version 3.3 or greater, but GEOS 3.4+ is recommended to take full advantage of all the new functions and features. Without GEOS 3.4, you will be missing some major enhancements such as ST_Triangles and long-running function interruption, and improvements to geometry validation and making geometries valid such as ST_ValidDetail and ST_MakeValid. GEOS 3.3.2+ is also required for topology support. GEOS is available for download from <ulink url="http://trac.osgeo.org/geos/"> http://trac.osgeo.org/geos/ </ulink> and 3.4+ is backward-compatible with older versions so fairly safe to upgrade.
es: Librería de geometrías GEOS, versión 3.3 o superior, pero GEOS 3.4+ esta recomendada para obtener todas las ventajas de nuevas características y funciones. Sin GEOS 3.4, te estarás perdiendo algunas mejoras importantes como ST_Triangles o la interrupción de de funciones de ejecución larga, y algunas mejoras de la validación de geometrías y conversión a geometrías validas como ST_ValidDetail y ST_MakeValid. GEOS 3.3.2+ también es necesaria para dar soporte a las funciones de topología. GEOS esta disponible para su descarga en <ulink url="http://trac.osgeo.org/geos/"> http://trac.osgeo.org/geos/ </ulink> y 3.4+ es compatible con versiones anteriores, así que es bastante segura la actualización.

source: LibXML2, version 2.5.x or higher. LibXML2 is currently used in some imports functions (ST_GeomFromGML and ST_GeomFromKML). LibXML2 is available for download from <ulink url="http://xmlsoft.org/downloads.html">http://xmlsoft.org/downloads.html</ulink>.
es: LibXML2, versión 2.5.x o superior. LibXML2 se usa actualmente en alguna funciones para importar (ST_GeomFromGML y ST_GeomFromKML). LibXML2 esta disponible para su descarga en <ulink url="http://xmlsoft.org/downloads.html">http://xmlsoft.org/downloads.html</ulink>.

source: JSON-C, version 0.9 or higher. JSON-C is currently used to import GeoJSON via the function ST_GeomFromGeoJson. JSON-C is available for download from <ulink url="http://oss.metaparadigm.com/json-c/">http://oss.metaparadigm.com/json-c/</ulink>.
es: JSON-C, versión 0.9 o superior. JSON-C se utiliza actualmente para importar ficheros en formato GeoJSON vía la función ST_GeomFromGeoJson. JSON-C esta disponible para su descarga en <ulink url="http://oss.metaparadigm.com/json-c/">http://oss.metaparadigm.com/json-c/</ulink>.

source: GDAL, version 1.8 or higher (1.9 or higher is strongly recommended since some things will not work well or behavior differently with lower versions). This is required for raster support. <ulink url="http://trac.osgeo.org/gdal/wiki/DownloadSource">http://trac.osgeo.org/gdal/wiki/DownloadSource</ulink>.
es: GDAL, version 1.8 o superior (1.9 o superior es fuertemente recomendada ya que algunas cosas no funcionaran bien o pueden tener un comportamiento diferente entre versiones). Esta librería es necesaria para dar soporte a las funciones raster. <ulink url="http://trac.osgeo.org/gdal/wiki/DownloadSource">http://trac.osgeo.org/gdal/wiki/DownloadSource</ulink>.

source: Optional
es: Opcional

source: GTK (requires GTK+2.0, 2.8+) to compile the shp2pgsql-gui shape file loader. <ulink url="http://www.gtk.org/"> http://www.gtk.org/ </ulink> .
es: GTK (GTK+2.0, 2.8+ requerida) para compilar el cargador de shapefiles shp2pgsql-gui. <ulink url="http://www.gtk.org/"> http://www.gtk.org/ </ulink> .

source: CUnit (<filename>CUnit</filename>). This is needed for regression testing. <ulink url="http://cunit.sourceforge.net/">http://cunit.sourceforge.net/</ulink>
es: CUnit (<filename>CUnit</filename>). Se necesita para hacer test de regresión. <ulink url="http://cunit.sourceforge.net/">http://cunit.sourceforge.net/</ulink>

source: Apache Ant (<filename>ant</filename>) is required for building any of the drivers under the <filename>java</filename> directory. Ant is available from <ulink url="http://ant.apache.org"> http://ant.apache.org </ulink> .
es: Apache Ant (<filename>ant</filename>) se necesita para compilar cualquier driver que se encuentre en el directorio <filename>java</filename>. Ant esta disponible en <ulink url="http://ant.apache.org"> http://ant.apache.org </ulink> .

source: DocBook (<filename>xsltproc</filename>) is required for building the documentation. Docbook is available from <ulink url="http://www.docbook.org/"> http://www.docbook.org/ </ulink> .
es: DocBook (<filename>xsltproc</filename>) es necesario para compilar la documentación. Docbook esta disponible en <ulink url="http://www.docbook.org/"> http://www.docbook.org/ </ulink> .

source: DBLatex (<filename>dblatex</filename>) is required for building the documentation in PDF format. DBLatex is available from <ulink url="http://dblatex.sourceforge.net/"> http://dblatex.sourceforge.net/ </ulink> .
es: DBLatex (<filename>dblatex</filename>) necesario para construir la documentación en formato PDF. DBLatex esta disponible en <ulink url="http://dblatex.sourceforge.net/"> http://dblatex.sourceforge.net/ </ulink> .

source: ImageMagick (<filename>convert</filename>) is required to generate the images used in the documentation. ImageMagick is available from <ulink url="http://www.imagemagick.org/"> http://www.imagemagick.org/ </ulink> .
es: ImageMagick (<filename>convert</filename>) es necesario para generar las imágenes empleadas en la documentación. ImageMagick esta disponible en<ulink url="http://www.imagemagick.org/"> http://www.imagemagick.org/ </ulink> .

source: Getting the Source
es: Obteniendo el código fuente

source: Retrieve the PostGIS source archive from the downloads website <ulink url="http://www.postgis.org/download/postgis-&last_release_version;.tar.gz"> http://www.postgis.org/download/postgis-&last_release_version;.tar.gz </ulink>
es: El código fuente se puede obtener del sitio de descargas de PostGIS <ulink url="http://www.postgis.org/download/postgis-&last_release_version;.tar.gz"> http://www.postgis.org/download/postgis-&last_release_version;.tar.gz </ulink>

source: This will create a directory called <varname>postgis-&last_release_version;</varname> in the current working directory.
es: Esto creara un directorio llamado <varname>postgis-&last_release_version;</varname> en el directorio de trabajo actual.

source: Alternatively, checkout the source from the <ulink url="http://subversion.apache.org/"> svn </ulink> repository <ulink url="http://svn.osgeo.org/postgis/trunk/"> http://svn.osgeo.org/postgis/trunk/ </ulink> .
es: De forma alternativa se puede obtener el código fuente del repositorio <ulink url="http://subversion.apache.org/"> svn </ulink> <ulink url="http://svn.osgeo.org/postgis/trunk/"> http://svn.osgeo.org/postgis/trunk/ </ulink> .

source: Change into the newly created <varname>postgis-&last_release_version;</varname> directory to continue the installation.
es: Vaya al nuevo directorio <varname>postgis-&last_release_version;</varname> creado para continuar con la instalación.

source: Many OS systems now include pre-built packages for PostgreSQL/PostGIS. In many cases compilation is only necessary if you want the most bleeding edge versions or you are a package maintainer.
es: Muchos Sistemas Operativos incluyen ya paquetes precompilados PostgreSQL/PostGIS. En la mayoría de casos no es necesario compilar salvo si quieres las ultimas versiones o eres alguien que hace mantenimiento de paquetes.

source: This section includes general compilation instructions, if you are compiling for Windows etc or another OS, you may find additional more detailed help at <ulink url="http://trac.osgeo.org/postgis/wiki/UsersWikiInstall">PostGIS User contributed compile guides</ulink> and <ulink url="http://trac.osgeo.org/postgis/wiki/DevWikiMain">PostGIS Dev Wiki</ulink>.
es: Esta sección incluye las instrucciones generales de compilado, si estas compilando en Windows o otro Sistema Operativo, puedes encontrar información adicional detallada en <ulink url="http://trac.osgeo.org/postgis/wiki/UsersWikiInstall">PostGIS User contributed compile guides</ulink> y <ulink url="http://trac.osgeo.org/postgis/wiki/DevWikiMain">PostGIS Dev Wiki</ulink>.

source: Pre-Built Packages for various OS are listed in <ulink url="http://trac.osgeo.org/postgis/wiki/UsersWikiPackages">PostGIS Pre-built Packages</ulink>
es: Algunos paquetes precompilados para varios Sistemas Operativos están en <ulink url="http://trac.osgeo.org/postgis/wiki/UsersWikiPackages">PostGIS Pre-built Packages</ulink>

source: If you are a windows user, you can get stable builds via Stackbuilder or <ulink url="http://www.postgis.org/download/windows/">PostGIS Windows download site</ulink> We also have <ulink url="http://www.postgis.org/download/windows/experimental.php">very bleeding-edge windows experimental builds</ulink> that are built usually once or twice a week or whenever anything exciting happens. You can use these to experiment with the in progress releases of PostGIS
es: Si eres usuario de Windows, puedes obtener versiones estables compiladas via Stackbuilder o <ulink url="http://www.postgis.org/download/windows/"> sitio de descragas de PostGIS para Windows</ulink> También tenemos <ulink url="http://www.postgis.org/download/windows/experimental.php">versiones experimentales para Windows </ulink> que son publicadas normalmente una o dos veces por semana o cuando algo interesante ocurre. Puedes utilizar estas para experimentar con las versiones de desarrollo de PostGIS

source: The PostGIS module is an extension to the PostgreSQL backend server. As such, PostGIS &last_release_version; <emphasis>requires</emphasis> full PostgreSQL server headers access in order to compile. It can be built against PostgreSQL versions &min_postgres_version; or higher. Earlier versions of PostgreSQL are <emphasis>not</emphasis> supported.
es: El modulo PostGIS es una extensión del servidor PostgreSQL. Como tal, PostGIS &last_release_version; <emphasis>requiere</emphasis> PostgreSQL con acceso completo cabeceras del servidor con el fin de compilar. Puede ser compilado en PostgreSQL versiones &min_postgres_version;, o superior. Las versiones anteriores de PostgreSQL <emphasis>no</emphasis> son compatibles.

source: Refer to the PostgreSQL installation guides if you haven't already installed PostgreSQL. <ulink url="http://www.postgresql.org"> http://www.postgresql.org </ulink> .
es: Si todavía no tienes instalado PostgreSQL puedes ir a la guía de instalación de PostgreSQL en <ulink url="http://www.postgresql.org"> http://www.postgresql.org </ulink> .

source: For GEOS functionality, when you install PostgresSQL you may need to explicitly link PostgreSQL against the standard C++ library:
es: Para tener compatibilidad con las funcionalidades GEOS, cuando instales PostgreSQL necesitar hacer un enlace explícito de PostgreSQL con la librería estándar C++:

source: LDFLAGS=-lstdc++ ./configure [YOUR OPTIONS HERE]
es: LDFLAGS=-lstdc++ ./configure [PON TUS OPCIONES AQUI]

source: This is a workaround for bogus C++ exceptions interaction with older development tools. If you experience weird problems (backend unexpectedly closed or similar things) try this trick. This will require recompiling your PostgreSQL from scratch, of course.
es: Esta es una falsa solución para excepciones de interacción de C++ con herramientas de desarrollo antiguas. Si experimentas problemas extraños (backend cerrado inesperadamente o cosas similares) prueba este truco. Para ello será necesario volver a compilar PostgreSQL desde cero, por supuesto.

source: The following steps outline the configuration and compilation of the PostGIS source. They are written for Linux users and will not work on Windows or Mac.
es: Los siguientes pasos describen la configuración y compilación del código fuente de PostGIS. Están escritas para usuarios Linux y no funcionaran con Windows o Mac.

source: Configuration
es: Configuración

source: As with most linux installations, the first step is to generate the Makefile that will be used to build the source code. This is done by running the shell script
es: Como en la gran mayoría de instalaciones Linux, el primer paso es generar el Makefile que se utilizara para compilar el código fuente. Esto se hace ejecutando el script de shell.

source: With no additional parameters, this command will attempt to automatically locate the required components and libraries needed to build the PostGIS source code on your system. Although this is the most common usage of <command>./configure</command>, the script accepts several parameters for those who have the required libraries and programs in non-standard locations.
es: Sin parámetros adicionales, este comando intentara localizar los componentes y librerías necesarios para construir el código fuente PostGIS de forma automática en tu sistema. Aunque este es el uso mas común de <command>./configure</command>, el script acepta varios parámetros para aquellos que han instalado las librerías y programas en lugares no standard.

source: The following list shows only the most commonly used parameters. For a complete list, use the <command>--help</command> or <command>--help=short</command> parameters.
es: La siguiente lista muestra los parámetros utilizados mas comunes. Para obtener una lista completa, puedes utilizar los parámetros <command>--help</command> o <command>--help=short</command>.

source: This is the location the PostGIS libraries and SQL scripts will be installed to. By default, this location is the same as the detected PostgreSQL installation.
es: Esta es la localización donde se instalaran las librerías PostGIS y los scripts SQL. Por defecto, esta localización es la misma que la detectada para la instalación PostgreSQL.

source: This parameter is currently broken, as the package will only install into the PostgreSQL installation directory. Visit <ulink url="http://trac.osgeo.org/postgis/ticket/635"> http://trac.osgeo.org/postgis/ticket/635 </ulink> to track this bug.
es: Este parámetro está roto actualmente, ya que el paquete sólo se instalará en el directorio de instalación de PostgreSQL. Para seguir avence de este bug visita <ulink url="http://trac.osgeo.org/postgis/ticket/635"> http://trac.osgeo.org/postgis/ticket/635 </ulink>

source: PostgreSQL provides a utility called <command>pg_config</command> to enable extensions like PostGIS to locate the PostgreSQL installation directory. Use this parameter (<command>--with-pgconfig=/path/to/pg_config</command>) to manually specify a particular PostgreSQL installation that PostGIS will build against.
es: PostgreSQL tiene una herramienta llamada <command>pg_config</command> para activar extensiones como PostGIS o para localizar el directorio de instalación de PostgreSQL. Utiliza este parámetro (<command>--with-pgconfig=/path/to/pg_config</command>) para especificar una instalación personalizada de PostgreSQL de forma manual que PostGIS utilizara para compilar.

source: GDAL, a required library, provides functionality needed for raster support <command>gdal-config</command> to enable software installations to locate the GDAL installation directory. Use this parameter (<command>--with-gdalconfig=/path/to/gdal-config</command>) to manually specify a particular GDAL installation that PostGIS will build against.
es: GDAL, una biblioteca necesaria, proporciona la funcionalidad necesaria para el soporte de raster <command> gdal-config </command> para activar la instalación de software para localizar el directorio de instalación de GDAL. Utilice este parámetro (<command> - with-gdalconfig = / ruta /a/ gdal config-</command>) para especificar manualmente una instalación de GDAL personalizada que PostGIS utilizara para compilar.

source: GEOS, a required geometry library, provides a utility called <command>geos-config</command> to enable software installations to locate the GEOS installation directory. Use this parameter (<command>--with-geosconfig=/path/to/geos-config</command>) to manually specify a particular GEOS installation that PostGIS will build against.
es: GEOS, libreria de geometrías requerida, tiene una utilidad llamada <command>geos-config</command> para activar la localización del directorio de instalación del software GEOS. Utiliza este parametro (<command>--with-geosconfig=/path/to/geos-config</command>) para especificar de forma manual una instalación personalizada de GEOS que PostGIS puede utilizar para compilar.

source: LibXML is the library required for doing GeomFromKML/GML processes. It normally is found if you have libxml installed, but if not or you want a specific version used, you'll need to point PostGIS at a specific <filename>xml2-config</filename> confi file to enable software installations to locate the LibXML installation directory. Use this parameter (<command>>--with-xml2config=/path/to/xml2-config</command>) to manually specify a particular LibXML installation that PostGIS will build against.
es: LibXML es una libreria necesaria para procesar GeomFromKML/GML. Normalmente encontrara si tienes instalada la libreria libxml, pero si no esta instalada, o quieres usar una versión especifica, necesitaras que PostGIS apunte a un fichero de configuración particular <filename>xml2-config</filename> para localizar un directorio de instalación LibXML para activar la instalación del Software. Utiliza el siguiente parámetro (<command>>--with-xml2config=/path/to/xml2-config</command>) para especificar de forma manual una instalación personalizada de LibXML con la que compilar PostGIS.
