Repository: postgis/postgis
Catalog: doc/po/*/installation.xml.po
Languages: es

source: Proj4 is a reprojection library required by PostGIS. Use this parameter (<command>--with-projdir=/path/to/projdir</command>) to manually specify a particular Proj4 installation directory that PostGIS will build against.
es: Proj4 es una libreria de reproyecciones necesaria de PostGIS. Utiliza el siguiente parametro (<command>--with-projdir=/path/to/projdir</command>) para definir manualmente una instalación personalizada de Proj4 para compilar PostGIS.

source: Directory where iconv is installed.
es: Directorio donde iconv esta instalado.

source: <ulink url="http://oss.metaparadigm.com/json-c/">JSON-C</ulink> is an MIT-licensed JSON library required by PostGIS ST_GeomFromJSON support. Use this parameter (<command>--with-jsondir=/path/to/jsondir</command>) to manually specify a particular JSON-C installation directory that PostGIS will build against.
es: <ulink url="http://oss.metaparadigm.com/json-c/">JSON-C</ulink>es una libreria con licencia MIT-licensed JSON necesaria para dar soporte a PostGIS ST_GeomFromJSON. Utiliza este parametro (<command>--with-jsondir=/path/to/jsondir</command>) para especificar de forma manual el directorio de instalación personalizado de instalación de JSON-C que PostGIS utilizara para compilar.

source: Compile the data import GUI (requires GTK+2.0). This will create shp2pgsql-gui graphical interface to shp2pgsql.
es: Compilar la GUI de importar datos (necesita GTK+2.0). Esto creara una interfaz gráfica shp2pgsql-gui para el comando shp2pgsql.

source: Compile with raster support. This will build rtpostgis-&last_release_version; library and rtpostgis.sql file. This may not be required in final release as plan is to build in raster support by default.
es: Compilar con soporte para raster. Esto compilara la libreria rtpostgis-&last_release_version; y el fichero rtpostgis.sql. Esto puede no ser necesario en la versión final ya que el plan es dar soporte raster de forma predeterminada.

source: Compile with topology support. This will build the topology.sql file. There is no corresponding library as all logic needed for topology is in postgis-&last_release_version; library.
es: Compilar con soporte de topología. Esto creara el fichero topology.sql. No hay librerías dependientes ya que toda la lógica necesaria esta contenida en la librería postgis-&last_release_version;.

source: By default PostGIS will try to detect gettext support and compile with it, however if you run into incompatibility issues that cause breakage of loader, you can disable it entirely with this command. Refer to ticket <ulink url="http://trac.osgeo.org/postgis/ticket/748">http://trac.osgeo.org/postgis/ticket/748</ulink> for an example issue solved by configuring with this. NOTE: that you aren't missing much by turning this off. This is used for international help/label support for the GUI loader which is not yet documented and still experimental.
es: PostGIS intentara detectar soporte gettext y compilar con el por defecto, de todas formas si existen incompatibilidades que causan errores de carga, se puede desactivar por completo con este comando. Para ver un ejemplo de resolución de problemas configurando en gettext puedes ver el siguiente enlace <ulink url="http://trac.osgeo.org/postgis/ticket/748">http://trac.osgeo.org/postgis/ticket/748</ulink>. NOTA: No te pierdes mucho si desactivas esta opción. Se utiliza principalmente para soporte de ayuda/etiquetas internacionales en la GUI de carga, que actualmente no esta documentada y sigue siendo experimental.

source: If you obtained PostGIS from the SVN <ulink url="http://svn.osgeo.org/postgis/trunk/"> repository </ulink> , the first step is really to run the script
es: Si has obtenido PostGIS desde el <ulink url="http://svn.osgeo.org/postgis/trunk/"> repositorio </ulink> SVN, el primer paso es ejecutar el script

source: This script will generate the <command>configure</command> script that in turn is used to customize the installation of PostGIS.
es: Este Script generara el script <command>configure</command> que a su vez se utiliza para personalizar la instalación de PostGIS.

source: If you instead obtained PostGIS as a tarball, running <command>./autogen.sh</command> is not necessary as <command>configure</command> has already been generated.
es: Si, por el contrario, as obtenido PostGIS como tarball, ejecutar <command>./autogen.sh</command> no es necesario ya que ya se ha generado <command>configure</command>.

source: Building
es: Compilando

source: Once the Makefile has been generated, building PostGIS is as simple as running
es: Una vez generado el Makefile, compilar PostGIS es tan simple como ejecutar

source: The last line of the output should be "<code>PostGIS was built successfully. Ready to install.</code>"
es: La ultima linea de salida del terminal debe ser "<code>PostGIS copilado con éxito. Listo para instalar.</code>"

source: As of PostGIS v1.4.0, all the functions have comments generated from the documentation. If you wish to install these comments into your spatial databases later, run the command which requires docbook. The postgis_comments.sql and other package comments files raster_comments.sql, topology_comments.sql are also packaged in the tar.gz distribution in the doc folder so no need to make comments if installing from the tar ball.
es: Como en PostGIS v1.4.0, todas las funciones tienen comentarios generados a partir de la documentación. Si quieres instalar estos comentarios en tu base de datos espacial luego, ejecuta el comando que requiere docbook. Los ficheros de comentarios postgis_comments.sql, raster_comments.sql, topology_comments.sql también están incluidos en la distribución tar.gz en la carpeta doc, así que si instalas desde el fichero tar no necesitas compilar los comentarios

source: Introduced in PostGIS 2.0. This generates html cheat sheets suitable for quick reference or for student handouts. This requires xsltproc to build and will generate 4 files in doc folder <filename>topology_cheatsheet.html</filename>, <filename>tiger_geocoder_cheatsheet.html</filename>, <filename>raster_cheatsheet.html</filename>, <filename>postgis_cheatsheet.html</filename>
es: Introducido en la version PostGIS 2.0. Esto genera hojas de referencia html para una referencia rápida o para los folletos. Esto requiere xsltproc para compilar y generará 4 ficheros en la carpeta doc <filename>topology_cheatsheet.html</filename>, <filename>tiger_geocoder_cheatsheet.html</filename>, <filename>raster_cheatsheet.html</filename>, <filename>postgis_cheatsheet.html</filename>

source: You can download some pre-built ones available in html and pdf from <ulink url="http://www.postgis.us/study_guides">PostGIS / PostgreSQL Study Guides</ulink>
es: Puedes descargar algunos ya compilados en formato html o pdf en <ulink url="http://www.postgis.us/study_guides"> Guias de Estudio PostGIS / PostgreSQL</ulink>

source: Building PostGIS Extensions and Deploying them
es: Compilando e Instalando Extensiones de PostGIS

source: The PostGIS extensions are built and installed automatically if you are using PostgreSQL 9.1+.
es: Las extensiones de PosGIS son compiladas e instaladas de forma automatica si estas utilizando la version 9.1+ de PostgreSQL

source: If you are building from source repository, you need to build the function descriptions first. These get built if you have docbook installed. You can also manually build with the statement:
es: Si estas compilando desde el repositorio de código fuente, necesitas compilar primero la función descriptions. Si tienes instaldo docbook ya esta compilado. También puedes compilarla manualmente con la sentencia:

source: Building the comments is not necessary if you are building from a release tar ball since these are packaged pre-built with the tar ball already.
es: Compilar los comentarios no es necesario si estas compilando desde un tar ya que están en el paquete pre-compilados con el tar.

source: If you are building against PostgreSQL 9.1, the extensions should automatically build as part of the make install process. You can if needed build from the extensions folders or copy files if you need them on a different server.
es: Si estas compilando para PostgreSQL 9.1, la extension debería compilarse de forma automática como parte del proceso del comando make install. Si lo necesitas, puedes compilar la extensión desde las carpetas de la extensión o copiar los ficheros en un servidor diferente.

source: The extension files will always be the same for the same version of PostGIS regardless of OS, so it is fine to copy over the extension files from one OS to another as long as you have the PostGIS binaries already installed on your servers.
es: Los ficheros de la extension serán siempre los mismos para la misma versión de PostgreSQL independientemente del Sistema Operativo, así que se pueden copiar los ficheros de la extensión de un Sistema Operativo a otro si ya tienes los binarios de PostGIS ya instalados en tus servidores.

source: If you want to install the extensions manually on a separate server different from your development, You need to copy the following files from the extensions folder into the <filename>PostgreSQL / share / extension</filename> folder of your PostgreSQL install as well as the needed binaries for regular PostGIS if you don't have them already on the server.
es: Si quieres instalar la extensión de forma manual en un servidor separado de tu servidor de desarrollo, necesitas copiar los siguientes archivos de la carpeta de la extensión en la carpeta <filename>PostgreSQL / share / extension</filename> de la instalación de PostgreSQL y los binarios normales para PostGIS si no los tienes instalados en el servidor.

source: These are the control files that denote information such as the version of the extension to install if not specified. <filename>postgis.control, postgis_topology.control</filename>.
es: Estos son los ficheros de control que contienen información como la versión de la extensión a instalar si no lo has especificado. <filename>postgis.control, postgis_topology.control</filename>.

source: All the files in the /sql folder of each extension. Note that these need to be copied to the root of the PostgreSQL share/extension folder <filename>extensions/postgis/sql/*.sql</filename>, <filename>extensions/postgis_topology/sql/*.sql</filename>
es: Todos los ficheros en la carpeta /sql de la extension. Estos ficheros deben ser copiados en la raiz de PostgreSQL en la carpeta share/extension <filename>extensions/postgis/sql/*.sql</filename>, <filename>extensions/postgis_topology/sql/*.sql</filename>

source: Once you do that, you should see <varname>postgis</varname>, <varname>postgis_topology</varname> as available extensions in PgAdmin -> extensions.
es: Una vez hecho esto deberías ver <varname>postgis</varname>, <varname>postgis_topology</varname> como extensiones disponibles en PgAdmin -> extensiones.

source: If you are using psql, you can verify that the extensions are installed by running this query:
es: Si estas utilizando psql, puedes verificar que las extensiones están instaladas ejecutando la siguiente sentencia:

source: If you have the extension installed in the database you are querying, you'll see mention in the <varname>installed_version</varname> column. If you get no records back, it means you don't have postgis extensions installed on the server at all. PgAdmin III 1.14+ will also provide this information in the <varname>extensions</varname> section of the database browser tree and will even allow upgrade or uninstall by right-clicking.
es: Si tienes instalada una extension en la base de datos que estas consultando, deberías verla mencionada la columna <varname>installed_version</varname>. Si la consulta no devuelve ningún registro, significa que no tienes la extension PostGIS instalada en el servidor. PgAdmin III 1.14+ muestra esta información en la sección <varname>extensiones</varname> en el navegador de bases de datos y permite actualizar o instalar haciendo click derecho.

source: If you have the extensions available, you can install postgis extension in your database of choice by either using pgAdmin extension interface or running these sql commands:
es: Si la extension esta disponible, puedes instalar la extension postgis en la base de datos de tu elección utilizando la interfaz de extensiones de pgAdmin o ejecutando la siguiente sentencia:

source: Extension tables <varname>spatial_ref_sys</varname>, <varname>layer</varname>, <varname>topology</varname> can not be explicitly backed up. They can only be backed up when the respective <varname>postgis</varname> or <varname>postgis_topology</varname> extension is backed up, which only seems to happen when you backup the whole database. As of PostGIS 2.0.1, only srid records not packaged with PostGIS are backed up when the database is backed up so don't go around changing srids we package and expect your changes to be there. Put in a ticket if you find an issue. The structures of extension tables are never backed up since they are created with <code>CREATE EXTENSION</code> and assumed to be the same for a given version of an extension. These behaviors are built into the current PostgreSQL extension model, so nothing we can do about it.
es: No se pueden hacer copias de seguridad explicitas de las tablas de las extensiones <varname>spatial_ref_sys</varname>, <varname>layer</varname>, <varname>topology</varname>. Solo se pueden hacer copias de seguridad explicitas cuando cuando se hacen copias de seguridad de sus respectivas extensiones <varname>postgis</varname> or <varname>postgis_topology</varname>, lo que al parecer ocurre cuando haces una copia de seguridad de la base de datos completa. Con PostGIS 2.0.1, solo los srid no incluidos en PostGIS son guardados cuando se hace una copia de seguridad de la base de datos, así que no esperes que al cambiar alguno de los srid que incluye PostGIS este en tu copia de seguridad. Envia un ticket si encuentras algún problema. La estructura de las tabals de extensiones no se guardan en copias de seguridad si son creadas con <code>CREATE EXTENSION</code> y son la misma estructura para una version dada de una extension. Estos comportamientos están incorporados en el modelo de extensiones PostgreSQL actual, así que nada podemos hacer al respecto.

source: If you installed &last_release_version;, without using our wonderful extension system, you can change it to be extension based by first upgrading to the latest micro version running the upgrade scripts: <filename>postgis_upgrade_20_minor.sql</filename>,<filename>raster_upgrade_20_minor.sql</filename>,<filename>topology_upgrade_20_minor.sql</filename>.
es: Si ha instalado &last_release_version;, sin usar nuestro estupendo sistema de extensión, puede cambiarlo para que sea basado en las extensiones haciendo primero una actualización hacia la última versión micro, ejecutando los scripts de actualización <filename>postgis_upgrade_20_minor.sql</filename>,<filename>raster_upgrade_20_minor.sql</filename>,<filename>topology_upgrade_20_minor.sql</filename>.

source: If you installed postgis without raster support, you'll need to install raster support first (using the full <filename>rtpostgis.sql</filename>
es: Si ha instalado postgis sin el soporte raster, necesitara instalarlo primero (usando el archivo <filename>rtpostgis.sql</filename>

source: Then you can run the below commands to package the functions in their respective extension.
es: Entonces podrá ejecutar los siguientes comandos para empaquetar las funciones en sus extensiones respectivas.

source: Testing
es: Tests

source: If you wish to test the PostGIS build, run
es: Si quieres hacer un test en la compilación de PostGIS, ejecuta

source: The above command will run through various checks and regression tests using the generated library against an actual PostgreSQL database.
es: El comando anterior ejecutará varias comprobaciones y tests de regresión utilizando la librería generada para la version de base de datos PostgreSQL actual.

source: If you configured PostGIS using non-standard PostgreSQL, GEOS, or Proj4 locations, you may need to add their library locations to the LD_LIBRARY_PATH environment variable.
es: Si has configurado PostGIS con instalaciones de PostgreSQL, GEOS, o Proj4 en directorios personalizados, necesitaras añadir las localizaciones de las librerías personalizadas en la variable de entorno LD_LIBRARY_PATH.

source: Currently, the <command>make check</command> relies on the <code>PATH</code> and <code>PGPORT</code> environment variables when performing the checks - it does <emphasis>not</emphasis> use the PostgreSQL version that may have been specified using the configuration parameter <command>--with-pgconfig</command>. So make sure to modify your PATH to match the detected PostgreSQL installation during configuration or be prepared to deal with the impending headaches.
es: Actualmente, el comando <command>make check</command> une las variables de entorno <code>PATH</code> y <code>PGPORT</code> cundo ejecuta las comprobaciones - <emphasis>no</emphasis> utiliza la version de PostgreSQL especificada utilizando el parametro de configuración <command>--with-pgconfig</command>. Así que hay que estar seguros de modificar la variable de entorno PATH para que apunte a la instalación de PostgreSQL detectada durante la configuración o estar preparado para tener algún que otro dolor de cabeza.

source: If successful, the output of the test should be similar to the following:
es: Si todo ha ido bien, la salida del comando de test debería ser similar a la siguiente:

source: To install PostGIS, type
es: Para instalar PostGIS entre

source: This will copy the PostGIS installation files into their appropriate subdirectory specified by the <command>--prefix</command> configuration parameter. In particular:
es: Esto copiará los ficheros de instalación de PostGIS en el subdirectorio especificado por el parámetro de configuración <command>--prefix</command> del comando . En particular:

source: The loader and dumper binaries are installed in <filename>[prefix]/bin</filename>.
es: Los archivos binarios de carga y dumper estarán instalados en <filename>[prefix]/bin</filename>.

source: The SQL files, such as <filename>postgis.sql</filename>, are installed in <filename>[prefix]/share/contrib</filename>.
es: Los archivos SQL, tal como <filename>postgis.sql</filename>, están instalados en <filename>[prefix]/share/contrib</filename>.

source: The PostGIS libraries are installed in <filename>[prefix]/lib</filename>.
es: Las librerías de PostGIS estarán instaladas en <filename>[prefix]/lib</filename>.

source: If you previously ran the <command>make comments</command> command to generate the <filename>postgis_comments.sql</filename>, <filename>raster_comments.sql</filename> file, install the sql file by running
es: Si has ejecutado el comando <command>make comments</command> previamente para generar los ficheros <filename>postgis_comments.sql</filename>, <filename>raster_comments.sql</filename>, instala los ficheros sql ejecutando:

source: <filename>postgis_comments.sql</filename>, <filename>raster_comments.sql</filename>, <filename>topology_comments.sql</filename> was separated from the typical build and installation targets since with it comes the extra dependency of <command>xsltproc</command>.
es: <filename>postgis_comments.sql</filename>, <filename>raster_comments.sql</filename>, <filename>topology_comments.sql</filename> han sido separados de la compilación y de la instalación típicos ya que tienen una dependencia extra de la librería <command>xsltproc</command>.

source: Create a spatially-enabled database on PostgreSQL lower than 9.1
es: Crea una base de datos habilitada para operaciones espaciales en PostgreSQL con versión inferior a 9.1

source: The first step in creating a PostGIS database is to create a simple PostgreSQL database.
es: El primer paso en la creación de una base de datos PostGIS es crear una simple base de datos PostgreSQL.

source: createdb [yourdatabase]
es: createdb [subasededatos]

source: Many of the PostGIS functions are written in the PL/pgSQL procedural language. As such, the next step to create a PostGIS database is to enable the PL/pgSQL language in your new database. This is accomplish by the command below command. For PostgreSQL 8.4+, this is generally already installed
es: Varias de la funciones PostGIS están escritas en el lenguaje de procedimientos PL/pgSQL. Como tal, el siguiente paso para crear una base de datos PostGIS es habilitar el lenguaje PL/pgSQL en nuestra nueva base de datos. Eso se hace con el comando siguiente. Para PostgreSQL 8.4+ está normalmente ya instalado.

source: createlang plpgsql [yourdatabase]
es: createlang plpgsql [subasededatos]

source: Now load the PostGIS object and function definitions into your database by loading the <filename>postgis.sql</filename> definitions file (located in <filename>[prefix]/share/contrib</filename> as specified during the configuration step).
es: Ahora carga los objetos y la definición de funciones en tu base de datos cargando el fichero de definiciones <filename>postgis.sql</filename> (este fichero se encuentra en <filename>[prefix]/share/contrib</filename> como se especificó durante la etapa de configuración).

source: For a complete set of EPSG coordinate system definition identifiers, you can also load the <filename>spatial_ref_sys.sql</filename> definitions file and populate the <varname>spatial_ref_sys</varname> table. This will permit you to perform ST_Transform() operations on geometries.
es: Para tener un juego completo de definiciones de sistemas de coordinas EPSG, también se puede cargar el fichero de definiciones <filename>spatial_ref_sys.sql</filename> y rellenar tabla <varname>spatial_ref_sys</varname>. Esto te permitida hacer operaciones de transformación ST_Transform() en las geometrías.

source: If you wish to add comments to the PostGIS functions, the final step is to load the <filename>postgis_comments.sql</filename> into your spatial database. The comments can be viewed by simply typing <command>\dd [function_name]</command> from a <command>psql</command> terminal window.
es: Si quieres añadir los comentarios de las funciones PostGIS, el paso final es cargar el fichero <filename>postgis_comments.sql</filename> en la base de datos. Para ver los comentarios, simplemente ejecuta el comando <command>\dd [function_name]</command> en un terminal psql.

source: Install raster support
es: Instalar el soporte raster

source: Install raster support comments. This will provide quick help info for each raster function using psql or PgAdmin or any other PostgreSQL tool that can show function comments
es: Instala los comentarios de soporte raster. Esto te dará información de ayuda de forma rápida para cada función raster utilizando psql, pgAdmin o cualquier otra herramienta PostgreSQL que permita ver los comentarios de las funciones.

source: Install topology support
es: Instalar el soporte de topología

source: Install topology support comments. This will provide quick help info for each topology function / type using psql or PgAdmin or any other PostgreSQL tool that can show function comments
es: Instala los comentarios de soporte de topología. Esto te dará información de ayuda de forma rápida para cada función red topología utilizando psql, pgAdmin o cualquier otra herramienta PostgreSQL que permita ver los comentarios de las funciones.

source: If you plan to restore an old backup from prior versions in this new db, run:
es: Si estas pensando en restaurar una copia de seguridad de una vieja base de datos desde una versión anterior en la nueva base de datos, ejecuta:
