Repository: postgis/postgis
Catalog: doc/po/*/introduction.xml.po
Languages: de, fr, it_it, ja

source: In alphabetical order: Alex Bodnaru, Alex Mayrhofer, Andrea Peri, Andreas Forø Tollefsen, Andreas Neumann, Anne Ghisla, Barbara Phillipot, Ben Jubb, Bernhard Reiter, Brian Hamlin, Bruce Rindahl, Bruno Wolff III, Bryce L. Nordgren, Carl Anderson, Charlie Savage, Dane Springmeyer, David Skea, David Techer, Eduin Carrillo, Even Rouault, Frank Warmerdam, George Silva, Gerald Fenoy, Gino Lucrezi, Guillaume Lelarge, IIDA Tetsushi, Ingvild Nystuen, Jeff Adams, Jose Carlos Martinez Llari, Kashif Rasul, Klaus Foerster, Kris Jurka, Leo Hsu, Loic Dachary, Luca S. Percich, Maria Arias de Reyna, Mark Sondheim, Markus Schaber, Maxime Guillaud, Maxime van Noppen, Michael Fuhr, Nikita Shulga, Norman Vine, Rafal Magda, Ralph Mason, Richard Greenwood, Silvio Grosso, Steffen Macke, Stephen Frost, Tom van Tilburg, Vincent Picavet
fr: Dans l'ordre alphabétique : Alex Bodnaru, Alex Mayrhofer, Andrea Peri, Andreas Forø Tollefsen, Andreas Neumann, Anne Ghisla, Barbara Phillipot, Ben Jubb, Bernhard Reiter, Brian Hamlin, Bruce Rindahl, Bruno Wolff III, Bryce L. Nordgren, Carl Anderson, Charlie Savage, Dane Springmeyer, David Skea, David Techer, Eduin Carrillo, Even Rouault, Frank Warmerdam, George Silva, Gerald Fenoy, Gino Lucrezi, Guillaume Lelarge, IIDA Tetsushi, Ingvild Nystuen, Jeff Adams, Jose Carlos Martinez Llari, Kashif Rasul, Klaus Foerster, Kris Jurka, Leo Hsu, Loic Dachary, Luca S. Percich, Maria Arias de Reyna, Mark Sondheim, Markus Schaber, Maxime Guillaud, Maxime van Noppen, Michael Fuhr, Nikita Shulga, Norman Vine, Rafal Magda, Ralph Mason, Richard Greenwood, Silvio Grosso, Steffen Macke, Stephen Frost, Tom van Tilburg, Vincent Picavet

source: Other contributors: Corporate Sponsors
fr: Autres contributeurs : Organisations sponsors

source: In alphabetical order: Arrival 3D, Associazione Italiana per l'Informazione Geografica Libera (GFOSS.it), AusVet, Avencia, Azavea, Cadcorp, CampToCamp, City of Boston (DND), Clever Elephant Solutions, Cooperativa Alveo, Deimos Space, Faunalia, Geographic Data BC, Hunter Systems Group, Lidwala Consulting Engineers, LisaSoft, Logical Tracking &amp; Tracing International AG, Michigan Tech Research Institute, Norwegian Forest and Landscape Institute, OpenGeo, OSGeo, Oslandia, Paragon Corporation, R3 GIS,, Refractions Research, Regione Toscana-SIGTA, Safe Software, Sirius Corporation plc, Stadt Uster, UC Davis Center for Vectorborne Diseases, University of Laval, U.S Department of State (HIU), Vizzuality, Zonar Systems
fr: Dans l'ordre alphabétique : Arrival 3D, Associazione Italiana per l'Informazione Geografica Libera (GFOSS.it), AusVet, Avencia, Azavea, Cadcorp, CampToCamp, City of Boston (DND), Clever Elephant Solutions, Cooperativa Alveo, Deimos Space, Faunalia, Geographic Data BC, Hunter Systems Group, Lidwala Consulting Engineers, LisaSoft, Logical Tracking &amp; Tracing International AG, Michigan Tech Research Institute, Norwegian Forest and Landscape Institute, OpenGeo, OSGeo, Oslandia, Paragon Corporation, R3 GIS,, Refractions Research, Regione Toscana-SIGTA, Safe Software, Sirius Corporation plc, Stadt Uster, UC Davis Center for Vectorborne Diseases, University of Laval, U.S Department of State (HIU), Vizzuality, Zonar Systems

source: Crowd funding campaigns are campaigns we run to get badly wanted features funded that can service a large number of people. Each campaign is specifically focused on a particular feature or set of features. Each sponsor chips in a small fraction of the needed funding and with enough people/organizations contributing, we have the funds to pay for the work that will help many. If you have an idea for a feature you think many others would be willing to co-fund, please post to the <ulink url="http://www.postgis.org/mailman/listinfo/postgis-users">PostGIS newsgroup</ulink> your thoughts and together we can make it happen.
fr: Les campagnes de financement participatif sont menées pour financer les fonctionnalités fortement demandées qui peuvent être utiles à un large nombre de personnes. Chaque campagne est concentrée spécifiquement sur une fonctionnalité ou un jeu de fonctionnalités particulière. Chaque sponsor envoie une petite fraction du financement nécessaire et avec suffisamment de personnes ou d'organisations participant, on peut réunir les fonds pour payer un travail qui aide de nombreuses personnes. Si vous avez une idée de fonctionnalité pour laquelle vous pensez que d'autres seraient prêts à payer, envoyez un message à la <ulink url="http://www.postgis.org/mailman/listinfo/postgis-users">liste PostGIS</ulink> avec votre idée, et ensemble nous pourrons la réaliser.

source: <ulink url="http://www.pledgebank.com/postgis64windows"><emphasis role="bold">postgis64windows</emphasis></ulink> - 20 someodd sponsors each contributed $100 USD to pay for the work needed to work out PostGIS 64-bit on windows issues. It happened. We now have a 64-bit beta release for PostGIS 2.0.0 and a final one planned for release that will be available on PostgreSQL stack builder.
fr: <ulink url="http://www.pledgebank.com/postgis64windows"><emphasis role="bold">postgis64windows</emphasis></ulink> - Environ 20 sponsors ont contribué chacun 100USD pour payer le travail nécessaire afin de régler les problèmes avec PostGIS 64 bits sous Windows. Ce fut une réussite. Nous avons désormais une version 64 bit de PostGIS 2.0.0 disponible dans l'installeur PostgreSQL Stack Builder.

source: The latest software, documentation and news items are available at the PostGIS web site, <ulink url="http://www.postgis.org">http://www.postgis.org</ulink>.
fr: Les dernieres versions du logiciel, documentation, et nouvelles sont disponibles sur le site de PostGIS, <ulink url="http://www.postgis.org">http://www.postgis.org</ulink>.
