Repository: postgis/postgis
Catalog: doc/po/*/introduction.xml.po
Languages: de, fr, it_it, ja

source: Introduction
de: Einführung
it_it: Introduzione
ja: 導入

source: PostGIS is a spatial extender for the PostgreSQL relational database that was created by Refractions Research Inc, as a spatial database technology research project. Refractions is a GIS and database consulting company in Victoria, British Columbia, Canada, specializing in data integration and custom software development.
ja: PostGISは、PostgreSQLリレーショナルデータベースに空間拡張を施すものです。Refractions Research Incが、空間データベース技術の研究プロジェクトとして開発しました。Refractionsはカナダ・ブリティッシュコロンビア州・ビクトリアにある、データインテグレーションとカスタムソフトウェア開発に特化した、GISとデータベースのコンサルティング会社です。

source: PostGIS is now a project of the OSGeo Foundation and is developed and funded by many FOSS4G Developers as well as corporations all over the world that gain great benefit from its functionality and versatility.
de: PostGIS ist ein Projekt der OSGeo Foundation. PostGIS wird von vielen FOSS4G-Entwicklern und Unternehmen auf der ganzen Welt laufend verbessert und finanziert. Diese profitieren ihrerseits von der Funktionsvielfalt und Einsatzflexibilität von PostGIS.
ja: PostGISはOSGeo財団のプロジェクトです。PostGISは、多数のFOSS4G開発者と、PostGISの機能と多彩さから大きな利益を得る世界中の企業によって継続的に改善され、資金を得ています。

source: The PostGIS project development group plans on supporting and enhancing PostGIS to better support a range of important GIS functionality in the areas of OpenGIS and SQL/MM spatial standards, advanced topological constructs (coverages, surfaces, networks), data source for desktop user interface tools for viewing and editing GIS data, and web-based access tools.
de: Die PostGIS Project Develpment Group beabsichtigt durch die Unterstützung und Weiterentwicklung von PostGIS eine hohe Funktionsvielfalt zu erreichen. Diese soll wichtige GIS-Funktionalitäten, Kompatibilität mit den spatialen Standards OpenGIS und SQL/MM, hochentwickelte topologische Konstrukte (Coverages, Oberflächen, Netzwerke), Datenquellen für Desktop Benutzeroberflächen zum Darstellen und Bearbeiten von GIS Daten, sowie Werkzeuge für den Zugriff via Internettechnologie beinhalten.
ja: PostGISプロジェクトの開発グループは、PostGISが、OpenGISとSQL/MM空間標準の領域における重要なGIS機能、高度なトポロジ構築 (カバレッジ、サーフェス、ネットワーク)、GISデータの表示と編集を行うデスクトップユーザインタフェースツール、およびウェブベースのアクセスツールのためのデータソースに、より良く対応するよう、サポートと機能強化を行う予定です。

source: Project Steering Committee
de: Projektleitung
fr: Comité de direction du projet (Project Steering Committee)
it_it: Comitato di Coordinamento del Progetto
ja: プロジェクト運営委員会

source: The PostGIS Project Steering Committee (PSC) coordinates the general direction, release cycles, documentation, and outreach efforts for the PostGIS project. In addition the PSC provides general user support, accepts and approves patches from the general PostGIS community and votes on miscellaneous issues involving PostGIS such as developer commit access, new PSC members or significant API changes.
de: Das PostGIS Project Steering Committee (PSC) koordiniert die allgemeine Ausrichtung, den Releasezyklus, die Dokumentation und die Öffentlichkeitsarbeit des PostGIS Projektes. Zusätzlich bietet das PSC allgemeine Unterstützung für Anwender, übernimmt und prüft Patches aus der PostGIS Gemeinschaft und stimmt über sonstige Themen, wie Commit-Zugriff für Entwickler, neue PSC Mitglieder oder entscheidende Änderungen an der API, ab.
fr: Le comité de direction du projet (PSC) coordonne la direction générale, les cycles de publication, la documentation et les efforts spécifiques pour le projet PostGIS. De plus, le PSC fournit un support général aux utilisateurs, accepte et approuve les patches de la communauté PostGIS et vote sur divers points concernant PostGIS, tels que les accès commit pour les développeurs, les nouveaux membres du PSC ou les changements majeurs d'API.
it_it: Il comitato di coordinamento del progetto (in inglese Project Steering Commitee o PSC) coordina la direzione generale, i cicli di rilascio, la documentazione e le iniziative di divulgazione del progetto PostGIS. Inoltre il comitato fornisce supporto agli utenti, accetta e approva patch dalla comunità generale PostGIS e vota su questioni varie che coinvolgono PostGIS come l'accesso di commit per gli sviluppatori, i nuovi membri del comitato e modifiche della API.
ja: PostGISプロジェクト運営委員会 (PostGIS Project Steering Committee, PSC)は、総合的な指示、リリースサイクル、ドキュメンテーション、支援活動に関する調整を行っています。また、委員会は、全体的なユーザサポート、PostGISコミュニティからのパッチの受け付けと適用、 開発者のコミットのアクセス、新しい委員、APIの重要な変更といった、PostGISを含む雑多な問題に関する投票を行っています。

source: Coordinates bug fixing and maintenance effort, spatial index selectivity and binding, loader/dumper, and Shapefile GUI Loader, integration of new and new function enhancements.
de: Koordiniert die Wartung und Fehlerbehebung, die Selektivität und die Anbindung von räumlichen Indizes, den Loader/Dumper und die Shapfile Loader GUI, die Einbindung von neuen Funktionen sowie die Verbesserung von neuen Funktionen.
ja: 誤り修正とメンテナンスの調整、空間インデクスの選択とバインディング、ローダ/ダンパ、シェープファイルGUIローダ、新機能の統合と強化。

source: Buildbot Maintenance, windows production and experimental builds, Documentation, alignment of PostGIS with PostgreSQL releases, general user support on PostGIS newsgroup, X3D support, Tiger Geocoder Support, management functions, and smoke testing new functionality or major code changes.
de: Buildbot Wartung, Kompilierung produktiver und experimenteller Softwarepakete für Windows, Abgleich von PostGIS mit den PostgreSQL Releases, allgemeine Unterstützung von Anwendern auf der PostGIS Newsgroup, Mitarbeit an X3D, Tiger Geokodierer, an Funktionen zur Verwaltung von Geometrien; Smoke testing neuer Funktionalität und wichtige Änderungen am Code.
ja: Buildbotのメンテナンス、Windows版と試験版のビルド、ドキュメンテーション、PostgreSQLとの調整、PostGISニュースグループの一般的なユーザサポート、X3D対応、Tiger Geocoder機能、関数管理、新機能と大きなコード変更のスモークテスト。

source: Raster development, integration with GDAL, raster loader, user support, general bug fixing, testing on various OS (Slackware, Mac, Windows, and more)
de: Entwicklung im Bereich Raster, Integration mit GDAL, Raster-Lader, Anwender-Support, allgemeine Fehlerbeseitigung, Softwaretests auf verschiedenen Betriebssystemen (Slackware, Mac, Windows und andere).
it_it: Sviluppo raster, integrazione con GDAL, loader raster, supporto agli utenti, generica soluzione di bachi, prove su vari sistemi operativi (Slackware, Mac, Windows e altri)
ja: ラスタ開発、GDALとの統合、ラスタローダ、ユーザサポート、一般的なバグフィクス、様々なOS (Slackware, Mac, Windows他)での試験。

source: Paul Ramsey (Chair)
de: Paul Ramsey (Vorsitzender)
fr: Paul Ramsey (Directeur)
it_it: Paul Ramsey (Coordinatore)
ja: Paul Ramsey (委員長)

source: Co-founder of PostGIS project. General bug fixing, geography support, geography and geometry index support (2D, 3D, nD index and anything spatial index), underlying geometry internal structures, PointCloud (in development), GEOS functionality integration and alignment with GEOS releases, alignment of PostGIS with PostgreSQL releases, loader/dumper, and Shapefile GUI loader.
de: Mitbegründer des PostGIS Projektes. Allgemeine Fehlerbehebung, geographische Unterstützung, Indizes zur Unterstützung von Geographie und Geometrie (2D, 3D, nD Index und jegliche räumliche Indizes), grundlegende interne geometrische Strukturen, PointCloud (in Entwicklung), Einbindung von GEOS Funktionalität und Abstimmung mit GEOS Releases, Abglech von PostGIS mit den PostgreSQL Releases, Loader/Dumper und die Shapefile Loader GUI.
ja: PostGISプロジェクトの副創始者。総合的なバグフィクス、ジオグラフィ機能、ジオグラフィとジオメトリのインデクス機能 (2次元,、3次元、n次元インデクスとあらゆる空間インデクス)、ジオメトリ内部構造、PointCloud (開発中)、GEOS機能の統合とGEOSリリースとの調整、PostgreSQLのリリースとの調整、ローダ/ダンパ、シェープファイルGUIローダ。

source: Bug fixes and maintenance, git mirrors management, integration of new GEOS functionality and alignment with GEOS releases, Topology support, and Raster framework and low level api functions.
de: Bugfixes, Wartung, Git Mirrors Management und Integration neuer GEOS-Funktionalitäten, sowie Abstimmung mit den GEOS Versionen, Topologieunterstützung, Raster Grundstruktur und Funktionen der Low-Level-API.
ja: 誤り修正とメンテナンス、gitミラーの管理、新しいGEOS機能のメンテナンス、GEOSリリースとの調整、トポロジ機能、ラスタフレームワークと低水準API関数。

source: Core Contributors Present
de: Aktuelle Kernentwickler
it_it: Principali collaboratori attuali
ja: 現在の中核貢献者

source: Raster development, GDAL driver support, loader
de: Entwicklung von PostGIS Raster, GDAL-Treiberunterstützung, Lader/loader
fr: Développement Raster, support du driver GDAL, outil de chargement.
it_it: Sviluppo raster, supporto per il driver GDAL, loader
ja: ラスタ開発、GDALドライバ機能、ローダ。

source: Distance function enhancements (including 3D distance and relationship functions) and additions, Tiny WKB output format (TWKB) (in development) and general user support
de: Verbesserung und Erweiterung von Distanzfunktionen (einschließlich 3D-Distanz und Funktionen zu räumlichen Beziehungen), Tiny WKB Ausgabeformat (TWKB) (in Entwicklung) und allgemeine Unterstützung von Anwendern.
it_it: Miglioramenti e aggiunte alla funzione di distanza (comprese le funzioni di distanza e di relazione 3D), formato di output Tiny WKB (TWKB) (in sviluppo) e supporto generale agli utenti
ja: 距離関数の強化 (3次元距離、関係関数を含む)と追加、Tiny WKB出力書式（TWKB, 開発中）と一般的なユーザサポート。

source: Geometry clustering function additions, other geometry algorithm enhancements, GEOS enhancements and general user support
de: Beiträge zu den geometrischen Clusterfunktionen, Verbesserung anderer geometrischer Alorithmen, GEOS Erweiterungen und allgemeine Unterstützung von Anwendern.
ja: ジオメトリクラスタリング関数の追加、他のジオメトリアルゴリズムの強化、GEOSの強化、および全体のユーザ対応

source: Input output XML (KML,GML)/GeoJSON functions, 3D support and bug fixes.
de: Ein- und Ausgabefunktionen für XML (KML,GML)/GeoJSON, 3D Unterstützng und Bugfixes.
fr: Fonctions d'entrée/sortie XML (KML,GML) et fonctions GeoJSON, support 3D et correction de bugs.
it_it: Funzioni di input e ouput XML (KML,GML)/GeoJSON, supporto 3D e correzione di bug.
ja: XML (KML, GML)/GeoJSON入出力関数と3次元サポートとバグフィクス。

source: MapBox Vector Tile and GeoBuf functions. Gogs testing and GitLab experimentation.
de: MapBox Vector Tile und GeoBuf Funktionen. Gogs Tests und GitLab Experimente.
ja: MapBox Vector Tile関数とGeoBuf関数、Gogsの試験とGitLabの実験。

source: CMake support for PostGIS, built original raster loader in python and low level raster api functions
de: CMake Unterstützung für PostGIS, Entwicklung des ursprünglichen Raster-Laders in Python und systemnahe Funktionen der Raster-API
it_it: Supporto CMake per PostGIS, ha sviluppato il loader raster originale in python e le funzioni API raster di basso livello.
ja: PostGISのCMakeサポート。オリジナルのPython版ラスタローダ低水準ラスタAPI関数の以前の開発。

source: Bug fixing
de: Bugfixes
ja: 誤り修正

source: Index improvements, bug fixing and geometry/geography function improvements, GitHub curator, and Travis bot maintenance.
ja: インデクス改善、誤り修正とジオメトリ/ジオグラフィ関数の改善、GitHub担当、Travis Botのメンテナンス。

source: Raster overall architecture, prototyping, programming support
de: Gesamtarchitektur für Raster, Prototyping, Unterstützung bei der Programmierung
fr: Architecture générale des raster, prototypage, support à la programmation.
it_it: Architettura complessiva raster, prototipazione, supporto alla programmazione
ja: ラスタ全体のアーキテクチャ、プロトタイピング、プログラミング支援。

source: Core Contributors Past
de: Frühere Kernentwickler
it_it: Principali collaboratori passati
ja: 過去の中核貢献者

source: Prior PSC Member. General development, site and buildbot maintenance, OSGeo incubation management
de: Ehemaliges PSC Mitglied. Allgemeine Entwicklungsarbeit, Wartung von Buildbot und Homepage, OSGeo Inkubationsmanagement.
fr: Ancien membre du PSC. Développement général, maintenance du site et du robot de build, gestion de l'incubation OSGeo.
it_it: Ex-membro del comitato di coordinamento. Sviluppo generale, manutenzione del sito e del buildbot, gestione dell'incubazione OSGeo
ja: 以前のPSCメンバ。一般的な開発、サイトとBuildbotのメンテナンス、OSGeoインキュベーション管理。

source: Prior PSC Member. Documentation and documentation support tools, buildbot maintenance, advanced user support on PostGIS newsgroup, and PostGIS maintenance function enhancements.
de: Ehemaliges PSC Mitglied. Dokumentation und Werkzeuge zur Dokumentationsunterstützung, Buildbot Wartung, fortgeschrittene Anwenderunterstützung auf der PostGIS Newsgroup, Verbesserungen an den Funktionen zur Verwaltung von Geometrien.
it_it: Ex-membro del comitato di coordinamento. Documentazione e strumenti di supporto alla documentazione, manutenzione dei buildbot, supporto avanzato per gli utenti nel newsgroup PostGIS, miglioramenti alle funzioni di manutenzione PostGIS.
ja: 以前のPSCメンバ。文書と文書補助ツール、Buildbotのメンテナンス、PostGISニュースグループでの高度なユーザサポート、PostGISメンテナンス機能の強化。

source: The original developer/Co-founder of PostGIS. Dave wrote the server side objects, index bindings, and many of the server side analytical functions.
de: Der ursprüngliche Entwickler und Mitbegründer von PostGIS. Dave schrieb die serverseitigen Bereiche, wie das Binden von Indizes und viele der serverseitiger analytischer Funktionen.
fr: Développeur original et co-fondateur de PostGIS. Dave a écrit les objets côté serveur, les liaisons des index, et de nombreuses fonctions d'analyse côté serveur.
it_it: Lo sviluppatore iniziale e uno dei cofondatori di PostGIS. Dave ha scritto il codice per gli oggetti lato server, il binding degli indici e molte delle funzioni analitiche lato server.
ja: PostGISのオリジナルの開発/副創始者。サーバサイドのオブジェクト、インデクスのバインディングや多数のサーバサイドの解析機能を記述。

source: Original development of the Shape file loader/dumper. Current PostGIS Project Owner representative.
de: Ursprüngliche Entwicklung des Shapefile Loader/Dumper. Aktuell ist er Vertreter der PostGIS Projekt Inhaber.
fr: Développement originel de l'outil de chargement/export de shapefiles. Actuel représentant du projet PostGIS.
it_it: Sviluppo iniziale del loader/dumper per gli Shapefile. Attualmente rappresentante di Project Owner di PostGIS.
ja: シェープファイルのローダ/ダンパのオリジナルの開発者。現在のPostGISプロジェクトオーナーの代表。

source: Ongoing maintenance and development of core functions. Enhanced curve support. Shapefile GUI loader.
de: Laufende Wartung und Entwicklung der Kernfunktionen. Erweiterte Unterstützung von Kurven. Shapefile Loader GUI.
fr: Maintenance générale et développement de fonctions du noyau PostGIS. Amélioration du support des courbes. Interface graphique de chargement des shapefiles.
it_it: Continuo sviluppo e manutenzione delle funzioni di base. Supporto avanzanto per le curve. Interfaccia grafica per il loader di Shapefile.
ja: 中核機能の、継続的なメンテナンスと開発。曲線機能の強化。シェープファイルGUIローダ。

source: Raster development (mostly map algebra analytic functions)
de: Entwickelt für Raster (in erster Linie analytische Funktionen in Map Algebra)
it_it: Sviluppo raster (principalmente funzioni analitiche di map algebra)
ja: ラスタ開発 (ほとんど地図代数解析関数)。

source: Other Contributors
de: Weitere Mitwirkende
it_it: Altri collaboratori
ja: 他の貢献者

source: Individual Contributors
de: Die einzelnen Mitwirkenden
it_it: Collaboratori individuali
ja: 個人

source: In alphabetical order: Alex Bodnaru, Alex Mayrhofer, Andrea Peri, Andreas Forø Tollefsen, Andreas Neumann, Anne Ghisla, Barbara Phillipot, Ben Jubb, Bernhard Reiter, Brian Hamlin, Bruce Rindahl, Bruno Wolff III, Bryce L. Nordgren, Carl Anderson, Charlie Savage, Dane Springmeyer, David Skea, David Techer, Eduin Carrillo, Even Rouault, Frank Warmerdam, George Silva, Gerald Fenoy, Gino Lucrezi, Guillaume Lelarge, IIDA Tetsushi, Ingvild Nystuen, Jason Smith, Jeff Adams, Jose Carlos Martinez Llari, Julien Rouhaud, Kashif Rasul, Klaus Foerster, Kris Jurka, Leo Hsu, Loic Dachary, Luca S. Percich, Maria Arias de Reyna, Mark Sondheim, Markus Schaber, Maxime Guillaud, Maxime van Noppen, Michael Fuhr, Mike Toews, Nathan Wagner, Nathaniel Clay, Nikita Shulga, Norman Vine, Rafal Magda, Ralph Mason, Rémi Cura, Richard Greenwood, Silvio Grosso, Steffen Macke, Stephen Frost, Tom van Tilburg, Vincent Mora, Vincent Picavet
de: In alphabetischer Reihenfolge: Alex Bodnaru, Alex Mayrhofer, Andrea Peri, Andreas Forø Tollefsen, Andreas Neumann, Anne Ghisla, Barbara Phillipot, Ben Jubb, Bernhard Reiter, Brian Hamlin, Bruce Rindahl, Bruno Wolff III, Bryce L. Nordgren, Carl Anderson, Charlie Savage, Dane Springmeyer, David Skea, David Techer, Eduin Carrillo, Even Rouault, Frank Warmerdam, George Silva, Gerald Fenoy, Gino Lucrezi, Guillaume Lelarge, IIDA Tetsushi, Ingvild Nystuen, Jason Smith, Jeff Adams, Jose Carlos Martinez Llari, Julien Rouhaud, Kashif Rasul, Klaus Foerster, Kris Jurka, Leo Hsu, Loic Dachary, Luca S. Percich, Maria Arias de Reyna, Mark Sondheim, Markus Schaber, Maxime Guillaud, Maxime van Noppen, Michael Fuhr, Mike Toews, Nathan Wagner, Nathaniel Clay, Nikita Shulga, Norman Vine, Rafal Magda, Ralph Mason, Rémi Cura, Richard Greenwood, Silvio Grosso, Steffen Macke, Stephen Frost, Tom van Tilburg, Vincent Mora, Vincent Picavet
ja: アルファベット順: Alex Bodnaru, Alex Mayrhofer, Andrea Peri, Andreas Forø Tollefsen, Andreas Neumann, Anne Ghisla, Barbara Phillipot, Ben Jubb, Bernhard Reiter, Brian Hamlin, Bruce Rindahl, Bruno Wolff III, Bryce L. Nordgren, Carl Anderson, Charlie Savage, Dane Springmeyer, David Skea, David Techer, Eduin Carrillo, Even Rouault, Frank Warmerdam, George Silva, Gerald Fenoy, Gino Lucrezi, Guillaume Lelarge, IIDA Tetsushi, Ingvild Nystuen, Jason Smith, Jeff Adams, Jose Carlos Martinez Llari, Julien Rouhaud, Kashif Rasul, Klaus Foerster, Kris Jurka, Leo Hsu, Loic Dachary, Luca S. Percich, Maria Arias de Reyna, Mark Sondheim, Markus Schaber, Maxime Guillaud, Maxime van Noppen, Michael Fuhr, Mike Toews, Nathan Wagner, Nathaniel Clay, Nikita Shulga, Norman Vine, Rafal Magda, Ralph Mason, Rémi Cura, Richard Greenwood, Silvio Grosso, Steffen Macke, Stephen Frost, Tom van Tilburg, Vincent Mora, Vincent Picavet

source: Corporate Sponsors
de: Gründungs-Sponsoren
it_it: Sponsor aziendali
ja: 企業

source: These are corporate entities that have contributed developer time, hosting, or direct monetary funding to the PostGIS project
de: Dabei handelt es sich um Unternehmen, die Entwicklungszeit, Hosting, oder direkte finanzielle Förderungen, in das PostGIS Projekt eingebracht haben
fr: Certaines organisations ont contribué du temps de développeur, de l'hébergement, ou du financement direct pour le projet PostGIS.
it_it: Queste sono realtà aziendali o altre istituzioni che hanno contribuito al progetto PostGIS sotto forma di tempo sviluppatore, hosting o finanziamento economico
ja: PostGISプロジェクトへの開発時間、ホスティング、直接的な金銭提供の貢献を行った企業です。

source: In alphabetical order: Arrival 3D, Associazione Italiana per l'Informazione Geografica Libera (GFOSS.it), AusVet, Avencia, Azavea, Cadcorp, CampToCamp, CartoDB, City of Boston (DND), Clever Elephant Solutions, Cooperativa Alveo, Deimos Space, Faunalia, Geographic Data BC, Hunter Systems Group, Lidwala Consulting Engineers, LisaSoft, Logical Tracking &amp; Tracing International AG, Maponics, Michigan Tech Research Institute, Natural Resources Canada, Norwegian Forest and Landscape Institute, Boundless (former OpenGeo), OSGeo, Oslandia, Palantir Technologies, Paragon Corporation, R3 GIS, Refractions Research, Regione Toscana - SITA, Safe Software, Sirius Corporation plc, Stadt Uster, UC Davis Center for Vectorborne Diseases, University of Laval, U.S Department of State (HIU), Zonar Systems
de: In alphabetischer Reihenfolge: Arrival 3D, Associazione Italiana per l'Informazione Geografica Libera (GFOSS.it), AusVet, Avencia, Azavea, Cadcorp, CampToCamp, CartoDB, City of Boston (DND), Clever Elephant Solutions, Cooperativa Alveo, Deimos Space, Faunalia, Geographic Data BC, Hunter Systems Group, Lidwala Consulting Engineers, LisaSoft, Logical Tracking &amp; Tracing International AG, Maponics, Michigan Tech Research Institute, Natural Resources Canada, Norwegian Forest and Landscape Institute, Boundless (former OpenGeo), OSGeo, Oslandia, Palantir Technologies, Paragon Corporation, R3 GIS, Refractions Research, Regione Toscana - SITA, Safe Software, Sirius Corporation plc, Stadt Uster, UC Davis Center for Vectorborne Diseases, University of Laval, U.S Department of State (HIU), Zonar Systems
ja: アルファベット順: Arrival 3D, Associazione Italiana per l'Informazione Geografica Libera (GFOSS.it), AusVet, Avencia, Azavea, Cadcorp, CampToCamp, CartoDB, City of Boston (DND), Clever Elephant Solutions, Cooperativa Alveo, Deimos Space, Faunalia, Geographic Data BC, Hunter Systems Group, Lidwala Consulting Engineers, LisaSoft, Logical Tracking &amp; Tracing International AG, Maponics, Michigan Tech Research Institute, Natural Resources Canada, Norwegian Forest and Landscape Institute, Boundless (former OpenGeo), OSGeo, Oslandia, Palantir Technologies, Paragon Corporation, R3 GIS, Refractions Research, Regione Toscana - SITA, Safe Software, Sirius Corporation plc, Stadt Uster, UC Davis Center for Vectorborne Diseases, University of Laval, U.S Department of State (HIU), Zonar Systems

source: Crowd Funding Campaigns
de: Crowd Funding-Kampagnen
fr: Campagnes de financement participatif
it_it: Campagne di finanziamento diffuso
ja: クラウドファンディングキャンペーン

source: Crowd funding campaigns are campaigns we run to get badly wanted features funded that can service a large number of people. Each campaign is specifically focused on a particular feature or set of features. Each sponsor chips in a small fraction of the needed funding and with enough people/organizations contributing, we have the funds to pay for the work that will help many. If you have an idea for a feature you think many others would be willing to co-fund, please post to the <ulink url="https://lists.osgeo.org/mailman/listinfo/postgis-users">PostGIS newsgroup</ulink> your thoughts and together we can make it happen.
de: Wir starten Crowdfunding Kampagnen, um dringend gewünschte und von vielen Anwendern benötigte Funktionalitäten zu finanzieren. Jede Kampagne konzentriert sich auf eine bestimmte Funktionalität oder eine Gruppe von Funktionen. Jeder Sponsor spendiert einen kleinen Teil des benötigten Geldes und wenn genug Menschen/Organisationen mitmachen, können wir die Arbeit bezahlen, von der dann viele etwas haben. Falls Sie eine Idee für eine Funktionalität haben, bei der Sie glauben, dass viele andere bereit sind diese mitzufinanzieren, dann schicken Sie bitte Ihre Überlegungen an die <ulink url="https://lists.osgeo.org/mailman/listinfo/postgis-users">PostGIS newsgroup</ulink> - gemeinsam wird es uns gelingen.
ja: クラウドファンディングキャンペーンは、PostGIS開発チームが走らせているキャンペーンです。欲しくて仕方ない機能に資金を与えて、多数の人々にサービスを提供できるようにするためのものです。それぞれのキャンペーンでは、特定の機能または機能の集合に焦点があてられます。それぞれのスポンサーは、必要な資金提供のうち少しだけを提供し、十分な人/組織の寄付で、たくさんの助けになる作業に支払う基金を持ちます。他の多くの人が寄付に協力してくれそうな機能に関するアイデアがありましたら、<ulink url="https://lists.osgeo.org/mailman/listinfo/postgis-users">PostGIS newsgroup</ulink>に、その考えを投稿して下さい。一緒に実現できます。

source: PostGIS 2.0.0 was the first release we tried this strategy. We used <ulink url="http://www.pledgebank.com">PledgeBank</ulink> and we got two successful campaigns out of it.
de: PostGIS 2.0.0 war die erste Version, mit der wir diese Strategie verfolgten. Wir benutzten <ulink url="http://www.pledgebank.com">PledgeBank</ulink> und hatten zwei erfolgreiche Kampagnen.
fr: PostGIS 2.0.0 a été la première version où cette stratégie a été testée. Nous avons utilisé <ulink url="http://www.pledgebank.com">PledgeBank</ulink> et avons eu deux campagnes de financement réussies.
it_it: PostGIS 2.0.0 è stata la prima release con cui abbiamo tentato questa strategia. Abbiamo utilizzato <ulink url="http://www.pledgebank.com">PledgeBank</ulink>, realizzando due campagne di successo.
ja: PostGIS 2.0.0はこの戦略を実施する最初のリリースです。<ulink url="http://www.pledgebank.com">PledgeBank</ulink>を使い、2件のキャンペーンが成功しました。
