Repository: postgis/postgis
Catalog: doc/po/*/introduction.xml.po
Languages: de, fr, it_it, ja

source: <ulink url="http://www.pledgebank.com/postgistopology"><emphasis role="bold">postgistopology</emphasis></ulink> - 10 plus sponsors each contributed $250 USD to build toTopoGeometry function and beef up topology support in 2.0.0. It happened.
de: <ulink url="http://www.pledgebank.com/postgistopology"><emphasis role="bold">postgistopology</emphasis></ulink> - mehr als 10 Sponsoren förderten mit jeweils $250 USD die Entwicklung von TopoGeometry Funktionen und das Aufmöbeln der Topologie-Unterstützung für 2.0.0.
fr: <ulink url="http://www.pledgebank.com/postgistopology"><emphasis role="bold">postgistopology</emphasis></ulink> - Plus de 10 sponsors ont contribué chacun 250USD pour créer la function toTopoGeometry et sortir le support de la topologie dans la version 2.0.0. Ce fut une réussite.
it_it: <ulink url="http://www.pledgebank.com/postgistopology"><emphasis role="bold">postgistopology</emphasis></ulink> - Oltre 10 sponsor hanno contribuito con 250 USD ciascuno per realizzare la funzione TopoGeometry e per migliorare il supporto della topologia nella versione 2.0.0. E' successo.
ja: <ulink url="http://www.pledgebank.com/postgistopology"><emphasis role="bold">postgistopology</emphasis></ulink> - 10以上のスポンサーがTopoGeometry機能の構築と2.0.0でのトポロジ対応強化とのために、それぞれ250米ドルを寄付しました。

source: <ulink url="http://www.pledgebank.com/postgis64windows"><emphasis role="bold">postgis64windows</emphasis></ulink> - 20 someodd sponsors each contributed $100 USD to pay for the work needed to work out PostGIS 64-bit issues on windows. It happened. We now have a 64-bit release for PostGIS 2.0.1 available on PostgreSQL stack builder.
de: <ulink url="http://www.pledgebank.com/postgis64windows"><emphasis role="bold">postgis64windows</emphasis></ulink> - 20 Sponsoren förderten die Arbeit an den Problemen mit der 64-bit Version von PostGIS für Windows mit jeweils $100 USD. Es ist tatsächlich geschehen und nun steht eine 64-bit Version von PostGIS 2.0.1 als PostgreSQL Stack-Builder zur Verfügung.
it_it: <ulink url="http://www.pledgebank.com/postgis64windows"><emphasis role="bold">postgis64windows</emphasis></ulink> - 20 e passa sponsor hanno contribuito con 100 USD ciascuno per retribuire il lavoro necessario per risolvere varie problematiche su PostGIS per Windows a 64 bit. E' successo. Ora abbiamo una versione per PostGIS 2.0.1 disponibile con lo stack builder PostgreSQL.
ja: <ulink url="http://www.pledgebank.com/postgis64windows"><emphasis role="bold">postgis64windows</emphasis></ulink> - 20のスポンサーが, Windows上でのPostGIS 64ビット版に必要な作業のために、それぞれ100米ドルを寄付しました。64ビット用PostGIS 2.0.1ができ、PostgreSQLスタックビルダで使用可能なリリースを予定している最終版ができました。

source: Important Support Libraries
de: Wichtige Support-Bibliotheken
fr: Bibliothèques de base importantes
it_it: Librerie di supporto importanti
ja: 重要なサポートライブラリ

source: The <ulink url="http://trac.osgeo.org/geos/">GEOS</ulink> geometry operations library, and the algorithmic work of Martin Davis in making it all work, ongoing maintenance and support of Mateusz Loskot, Sandro Santilli (strk), Paul Ramsey and others.
de: Die <ulink url="http://trac.osgeo.org/geos/">GEOS</ulink> Bibliothek zur Handhabung von Geometrien, und die Arbeit an den Algorithmen von Martin Davis, die erst alles zum Laufen brachte, laufende Wartung und Unterstützung durch Mateusz Loskot, Sandro Santilli (strk), Paul Ramsey und andere.
fr: La bibliothèque d'opérations géométriques <ulink url="http://trac.osgeo.org/geos/">GEOS</ulink>, et le travail algorithmique de Martin Davis pour faire fonctionner tout cela, la maintenance et le support de Mateusz Loskot, Sandro Santilli (strk), Paul Ramsey et d'autres.
it_it: La libreria per operazioni geometriche <ulink url="http://trac.osgeo.org/geos/">GEOS</ulink>, e il lavoro sugli algoritmi di Martin Davis per far funzionare il tutto, la manutenzione e il supporto continui di Mateusz Loskot, Sandro Santilli (strk), Paul Ramsey a altri.
ja: ジオメトリ演算ライブラリ<ulink url="http://trac.osgeo.org/geos/">GEOS</ulink>は、Martin Davisがアルゴリズムを作成し、Mateusz Loskot, Sandro Santilli (strk), Paul Ramseyらで動作するようにし、メンテナンスとサポートの進行を行っています。

source: The <ulink url="http://trac.osgeo.org/gdal/">GDAL</ulink> Geospatial Data Abstraction Library, by Frank Warmerdam and others is used to power much of the raster functionality introduced in PostGIS 2.0.0. In kind, improvements needed in GDAL to support PostGIS are contributed back to the GDAL project.
de: Die <ulink url="http://trac.osgeo.org/gdal/">GDAL</ulink> Geospatial Data Abstraction Library von Frank Warmerdam und anderen ist die Grundlage für einen großen Teil der Rasterfunktionalität, die mit PostGIS 2.0.0 eingeführt wurde. Im Prinzip werden die zur Unterstützung von PostGIS nötigen Neuerungen in GDAL, an das GDAL-Projekt zurückgegeben.
fr: La bibliothèque <ulink url="http://trac.osgeo.org/gdal/">GDAL</ulink> Geospatial Data Abstraction Library, par Frank Warmerdam et d'autres, est utilisée pour supporter nombre de fonctionnalités raster introduites dans PostGIS 2.0.0. Des améliorations nécessaires dans GDAL pour supporter PostGIS sont aussi remontées en retour dans le projet GDAL.
it_it: La libreria <ulink url="http://trac.osgeo.org/gdal/">GDAL</ulink> (Geospatial Data Abstraction Library), di Frank Warmerdam e altri viene utilizzata per far funzionare gran parte delle funzionalità raster introdotte in PostGIS 2.0.0. I miglioramenti realizzati su GDAL per consentire il supporto di PostGIS sono stati restituiti come contributo al progetto GDAL.
ja: 地理空間データ抽出ライブラリ<ulink url="http://trac.osgeo.org/gdal/">GDAL</ulink>はFrank Warmerdamらによります。PostGIS 2.0.0で導入されたラスタ機能で、非常によく使われています。 同じように、PostGISサポートに関するGDALの必要な改善でGDALプロジェクトに貢献しています。

source: The <ulink url="http://trac.osgeo.org/proj/">Proj4</ulink> cartographic projection library, and the work of Gerald Evenden and Frank Warmerdam in creating and maintaining it.
de: Die <ulink url="http://trac.osgeo.org/proj/">Proj4</ulink> Bibliothek für kartographische Projektionen, und die Arbeit von Gerald Evenden und Frank Warmerdam bei der Erstellung und Erhaltung dieser.
fr: La bibliothèque <ulink url="http://trac.osgeo.org/proj/">Proj4</ulink> de gestion de projections cartographiques, travail de Gerald Evenden et Frank Warmerdam pour la créer et la maintenir.
it_it: La libreria di proiezione cartografica <ulink url="http://trac.osgeo.org/proj/">Proj4</ulink>, e il lavoro di Gerald Evenden e Frank Warmerdam nel crearla e mantenerla.
ja: 地図投影ライブラリ<ulink url="http://trac.osgeo.org/proj/">Proj4</ulink>は、Gerald EvendenとFrank Warmerdamによって作成とメンテナンスがされています。

source: Last but not least, the <ulink url="http://www.postgresql.org">PostgreSQL DBMS</ulink>, The giant that PostGIS stands on. Much of the speed and flexibility of PostGIS would not be possible without the extensibility, great query planner, GIST index, and plethora of SQL features provided by PostgreSQL.
de: Zu guter Letzt das <ulink url="http://www.postgresql.org">PostgreSQL DBMS</ulink>, der Gigant auf dessen Schultern PostGIS steht. Die Geschwindigkeit und Flexibilität von PostGIS wäre ohne die Erweiterbarkeit, den großartigen Anfrageplaner, den GIST Index, und der Unmenge an SQL Funktionen, die von PostgreSQL bereitgestellt werden, nicht möglich.
fr: Enfin, mais non des moindres, le projet de SGBD <ulink url="http://www.postgresql.org">PostgreSQL</ulink>, géant sur les épaules duquel PostGIS s'appuie. La rapidité et flexibilité de PostGIS serait impossible sans l'extensibilité, le plannificateur de requêtes, les index GiST et les nombreuses fonctionnalités SQL que fournit PostgreSQL.
it_it: Ultimo, ma non ultimo, il database <ulink url="http://www.postgresql.org">PostgreSQL</ulink>, il gigante sulle cui spalle sta PostGIS. Molta della velolcità e flessibilità di PostGIS non sarebbe possibile senza l'estensibilità, il grande query planner, l'indice GIST, e la varietà di caratteristiche SQL rese disponibili da PostgreSQL.
ja: 最後ですがおろそかにできないのが<ulink url="http://www.postgresql.org/">PostgreSQL DBMS</ulink>です。PostGISはこの巨人の肩に乗っています。PostGISの速度と柔軟性はPostgreSQLが提供する拡張性、偉大なクエリプランナ、GiSTインデクス、多数のSQL機能がないと成り立ちません。

source: More Information
de: Weitere Information
fr: Plus d'information
it_it: Altre informazioni
ja: 追加情報

source: The latest software, documentation and news items are available at the PostGIS web site, <ulink url="http://postgis.net">http://postgis.net</ulink>.
de: Die neueste Software, Dokumentation und Neuigkeiten finden Sie auf der PostGIS Webseite <ulink url="http://postgis.net">http://postgis.net</ulink>.
it_it: Le versioni più recenti del software, della documentazione e le notizie sono disponibili sul sito web di PostGIS, <ulink url="http://postgis.net">http://postgis.net</ulink>.
ja: 最新のソフトウェア、ドキュメントおよびニュースについてはPostGISウェブサイト<ulink url="http://postgis.net/">http://postgis.net/</ulink>をご覧下さい。

source: More information about the GEOS geometry operations library is available at<ulink url="http://trac.osgeo.org/geos/"> http://trac.osgeo.org/geos/</ulink>.
de: Weitere Information zur GEOS Geometriebearbeitungs-Bibliothekgeometry finden Sie unter <ulink url="http://trac.osgeo.org/geos/"> http://trac.osgeo.org/geos/</ulink>.
fr: Plus d'information sur la bibliothèque d'opérations géométriques GEOS sont disponibles à <ulink url="http://trac.osgeo.org/geos/"> http://trac.osgeo.org/geos/</ulink>.
it_it: Ulteriori informazioni sulla libreria di operazioni geometriche GEOS sono disponibili alla pagina <ulink url="http://trac.osgeo.org/geos/"> http://trac.osgeo.org/geos/</ulink>.
ja: ジオメトリ演算ライブラリGEOSに関する詳細情報は<ulink url="http://trac.osgeo.org/geos/">http://trac.osgeo.org/geos/</ulink>をご覧下さい。

source: More information about the Proj4 reprojection library is available at <ulink url="http://trac.osgeo.org/proj/">http://trac.osgeo.org/proj/</ulink>.
de: Weitere Information zur Proj4 Koordinatentransformations-Bibliothek finden Sie unter <ulink url="http://trac.osgeo.org/proj/">http://trac.osgeo.org/proj/</ulink>.
fr: Plus d'informations sur la bibliothèque de gestion de projections Proj4 sont disponibles à <ulink url="http://trac.osgeo.org/proj/">http://trac.osgeo.org/proj/</ulink>.
it_it: Ulteriori informazioni sulla libreria di riproiezione Proj4 sono disponibili alla pagina <ulink url="http://trac.osgeo.org/proj/">http://trac.osgeo.org/proj/</ulink>.
ja: 投影変換ライブラリProj4に関する詳細情報は<ulink url="http://trac.osgeo.org/proj/">http://trac.osgeo.org/proj/</ulink>をご覧下さい。

source: More information about the PostgreSQL database server is available at the PostgreSQL main site <ulink url="http://www.postgresql.org">http://www.postgresql.org</ulink>.
de: Weitere Information zum PostgreSQL Datenbankserver finden Sie auf der PostgreSQL Hauptseite <ulink url="http://www.postgresql.org">http://www.postgresql.org</ulink>.
fr: Plus d'informations sur le SGBD PostgreSQL sont disponibles sur le site principal de PostgreSQL : <ulink url="http://www.postgresql.org">http://www.postgresql.org</ulink>.
it_it: Ulteriori informazioni sul server database PostgreSQL database server sono disponibili dal sito principale di PostgreSQL <ulink url="http://www.postgresql.org">http://www.postgresql.org</ulink>.
ja: データベースサーバPostgreSQLに関する詳細情報は、 PostgreSQLメインサイト<ulink url="http://www.postgresql.org/">http://www.postgresql.org/</ulink>をご覧下さい。

source: More information about GiST indexing is available at the PostgreSQL GiST development site, <ulink url="http://www.sai.msu.su/~megera/postgres/gist/">http://www.sai.msu.su/~megera/postgres/gist/</ulink>.
de: Weitere Information zum GIST-Index finden Sie auf der PostgreSQL GiST Entwicklerseite: <ulink url="http://www.sai.msu.su/~megera/postgres/gist/">http://www.sai.msu.su/~megera/postgres/gist/</ulink>.
fr: Plus d'informations sur l'indexation GiST est disponible sur le site de développement de PostgreSQL GiST, <ulink url="http://www.sai.msu.su/~megera/postgres/gist/">http://www.sai.msu.su/~megera/postgres/gist/</ulink>.
it_it: Ulteriori informazioni sull'indicizzazione GiST sono disponibili sul sito di sviluppo di PostgreSQL GiST, <ulink url="http://www.sai.msu.su/~megera/postgres/gist/">http://www.sai.msu.su/~megera/postgres/gist/</ulink>.
ja: GiSTインデクスに関する詳細情報は、PostgreSQL GiST開発サイト<ulink url="http://www.sai.msu.su/~megera/postgres/gist/">http://www.sai.msu.su/~megera/postgres/gist/</ulink>をご覧下さい。

source: More information about MapServer internet map server is available at <ulink url="http://mapserver.org/">http://mapserver.org</ulink>.
de: Weitere Information zu MapServer finden sie unter <ulink url="http://mapserver.org/">http://mapserver.org</ulink>.
fr: Plus d'information sur le serveur cartographique MapServer est disponible à <ulink url="http://mapserver.org/">http://mapserver.org</ulink>.
it_it: Ulteriori informazioni sul map server internet MapServer sono disponibili su <ulink url="http://mapserver.org/">http://mapserver.org</ulink>.
ja: インターネットマップサーバMapServerに関する詳細情報は <ulink url="http://mapserver.org/">http://mapserver.org/</ulink>をご覧下さい。

source: The &quot;<ulink url="http://www.opengeospatial.org/standards/sfs">Simple Features for Specification for SQL</ulink>&quot; is available at the OpenGIS Consortium web site: <ulink url="http://www.opengeospatial.org/">http://www.opengeospatial.org/</ulink>.
de: Die &quot;<ulink url="http://www.opengeospatial.org/standards/sfs">Simple Features Specification for SQL</ulink>&quot; finden Sie auf der Webseite des OpenGIS Consortiums: <ulink url="http://www.opengeospatial.org/">http://www.opengeospatial.org/</ulink>.
fr: Les &quot;<ulink url="http://www.opengeospatial.org/standards/sfs">Simple Features for SQL Specifications</ulink>&quot; sont disponibles sur le site du consortium OpenGIS : <ulink url="http://www.opengeospatial.org/">http://www.opengeospatial.org/</ulink>.
it_it: La documentazione su &quot;<ulink url="http://www.opengeospatial.org/standards/sfs">Simple Features for Specification for SQL</ulink>&quot; è disponibile sul sito web dell'OpenGIS Consortium: <ulink url="http://www.opengeospatial.org/">http://www.opengeospatial.org/</ulink>.
ja: &quot;<ulink url="http://www.opengeospatial.org/standards/sfs">Simple Features for Specification for SQL</ulink>&quot;は、OpenGISコンソーシアムウェブサイト<ulink url="http://www.opengeospatial.org/">http://www.opengeospatial.org/</ulink>にあります。

source: PostGIS was developed by Refractions Research Inc, as a spatial database technology research project. Refractions is a GIS and database consulting company in Victoria, British Columbia, Canada, specializing in data integration and custom software development. We plan on supporting and developing PostGIS to support a range of important GIS functionality, including full OpenGIS support, advanced topological constructs (coverages, surfaces, networks), desktop user interface tools for viewing and editing GIS data, and web-based access tools.
fr: PostGIS a été développé par Refractions Research Inc, en tant que projet de recherche sur les technologies de bases de données spatiales. Refractions est une entreprise de conseil en SIG et bases de données à Victoria, Colombie Britannique, Canada. Elle est spécialisée en intégration de données et développement de logiciels spécifiques. Nous prévoyons de supporter et développer PostGIS pour satisfaire une large gamme de fonctionnalités SIG, tels que le support complet d'OpenGIS, des constructions topologiques avancées (couvertures, surfaces, réseaux), des outils bureautiques pour visualiser et éditer des données SIG, et des outils d'accès web.
it_it: PostGIS è stato sviluppato da Refractions Research Inc come progetto di ricerca sui database spaziali. Refractions è una azienda nel settore GIS e database con sede a Victoria, British Columbia, in Canada, specializzata nell'integrazione di dati e nello sviluppo di software su misura. Abbiamo in programma di supportare e sviluppare PostGIS per gestire una gamma di funzionalità GIS importanti, tra cui un completo supporto OpenGIS, operazioni topologiche avanzate (estensioni, superfici, reti), strumenti desktop per la visualizzazione e l'editing di dati GIS, e strumenti web.

source: PostGIS is an incubation project of the OSGeo Foundation. PostGIS is being continually improved and funded by many FOSS4G Developers as well as corporations all over the world that gain great benefit from its functionality and versatility.
fr: PostGIS est un projet officiel de la fondation OSGeo. PostGIS est continuellement amélioré et financé par de nombreux développeurs de logiciels SIG libres, ainsi que par des organisations tout autour du monde qui profite largement de ses fonctionnalités et de sa souplesse d'utilisation.
it_it: PostGIS è in fase di incubazione come progetto della OSGeo Foundation. PostGIS viene continuamente migliorato e sostenuto economicamente da molti sviluppatori FOSS4G e da aziende di tutto il mondo che ricavano grandi benefici dalle sue funzionalità e versatilità.

source: Coordinates bug fixing and maintenance effort, alignment of PostGIS with PostgreSQL releases, spatial index selectivity and binding, loader/dumper, and Shapefile GUI Loader, integration of new and new function enhancements.
fr: Coordination de la correction des bugs et de l'effort de maintenance, alignement des sorties de PostGIS avec celles de PostgreSQL, sélectivité et liaisons des index spatiaux, outil de chargement/export, interface de chargement de shapefiles, intégration de nouvelles fonctions et améliorations de fonctions existantes.
it_it: Coordina la soluzione dei bug e le iniziative di manutenzione, l'allineamento di PostGIS con i rilasci di PostgreSQL

source: Buildbot Maintenance, windows production and experimental builds, Documentation, general user support on PostGIS newsgroup, X3D support, Tiger Geocoder Support, management functions, and smoke testing new functionality or major code changes.
fr: Maintenance des robots de build, création des builds expérimentaux et stables pour windows, documentation, support général aux utilisateurs sur les newsgroups PostGIS, support X3D, support du géocodeur Tiger, fonctions de gestion, tests des nouvelles fonctionnalités et des changements majeurs du code.
it_it: Manutenzione Buildbot, build sperimentali e di produzione per Windows, documentazione, supporto per gli utenti nel newsgroup PostGIS, supporto X3D, Supporto per il geocodeo Tiger, funzioni di gestione, test di integrità funzionale per nuove funzioni o variazioni sostanziali del codice.

source: Co-founder of PostGIS project. General bug fixing, geography support, geography and geometry index support (2D, 3D, nD index and anything spatial index), underlying geometry internal structures, PointCloud (in development), GEOS functionality integration and alignment with GEOS releases, loader/dumper, and Shapefile GUI loader.
it_it: Co-fondatore del progetto PostGIS. Correzione dei bug, supporto alla componente geografica, supporto per gli indici geografici e geometrici (2D, 3D, nD e qualsiasi altra cosa legata agli indici spaziali), strutture interne per la geometria, PointCloud (in sviluppo), integrazione delle funzionalità GEOS e allineamento con le nuove versioni di GEOS, loader/dumper, e interfaccia grafica per il loader Shapefile.

source: Bug fixes and maintenance and integration of new GEOS functionality and alignment with GEOS releases, Topology support, and Raster framework and low level api functions.
fr: Correction de bugs, mantenance et intégration de nouvelles fonctionnalités de GEOS et alignement de la publication avec les sorties de GEOS, support de la topologie, framework Raster et fonctions bas niveau de l'API.
it_it: Correzione di bug, manutenzione e integrazione delle nuove funzioalità GEOS, allineamento con le versioni di GEOS, supporto topologico, framework Raster e funzioni API di basso livello.

source: Crowd funding campaigns are campaigns we run to get badly wanted features funded that can service a large number of people. Each campaign is specifically focused on a particular feature or set of features. Each sponsor chips in a small fraction of the needed funding and with enough people/organizations contributing, we have the funds to pay for the work that will help many. If you have an idea for a feature you think many others would be willing to co-fund, please post to the <ulink url="http://postgis.net/mailman/listinfo/postgis-users">PostGIS newsgroup</ulink> your thoughts and together we can make it happen.
it_it: Le campagne di finanziamento diffuso sono campagne che promuoviamo per finanziare funzionalità molto richieste e che possono servire a un gran numero di persone. Ogni campagna è dedicata in modo particolare a una data funzionalità o gruppo di funzionalità. Ogni sponsor partecipa con una quota ridotta rispetto al finanziamento richiesto, e con un numero sufficiente di persone e organizzazioni che contribuiscono, possiamo ottenere i fondi per retribuire un lavoro che servirà a molti. Se avete un'idea per una funzione che pensate possa essere cofinanziata anche da molti altri, vi preghiamo di condividere le vostre idee sul <ulink url="http://postgis.net/mailman/listinfo/postgis-users">newsgroup PostGIS</ulink>, e insieme possiamo vedere di realizzarla.

source: Co-founder of PostGIS project. General bug fixing, geography support, geography and geometry index support (2D, 3D, nD index and anything spatial index), underlying geometry internal structures, GEOS functionality integration and alignment with GEOS releases, loader/dumper, and Shapefile GUI loader.
fr: Co-fondateur du projet PostGIS, corrections de bugs, support du type geography, support des index pour geography et geometry (2D, 3D, nD et autres index spatiaux), structures internes de géométries, intégration de fonctionnalités de GEOS et alignement des publications avec GEOS, outil de chargement/export, interface graphique de chargement de shapefiles.

source: Contributors Past and Present
fr: Contributeurs passé et présent

source: Prior PSC Member. Documentation and documentation support tools, advanced user support on PostGIS newsgroup, and PostGIS maintenance function enhancements.
fr: Ancien membre du PSC. Documentation et outils de support de la documentation, support avancé aux utilisateurs sur les newsgroup PostGIS, et amélioration des fonctions de maintenance de PostGIS.

source: Distance function enhancements (including 3D distance and relationship functions) and additions, Windows testing, and general user support
fr: Amélioration des fonctions de distance (dont la distance 3D et les fonctions de relations) et nouvelles fonctions. Tests Windows et support général aux utilisateurs.

source: Raster development, raster loader
fr: Développement Raster, outil de chargement raster.

source: Raster loader, low level raster api functions
fr: Outil de chargement raster, fonctions bas niveau de l'API raster.

source: Raster development
fr: Développement Raster.

source: Other contributors: Individuals
fr: Autres contributeurs : individus
