Repository: postgis/postgis
Catalog: doc/po/*/performance_tips.xml.po
Languages: de, es, fr

source: <ulink url="https://www.postgresql.org/docs/current/static/runtime-config-resource.html#GUC-MAX-WORKER-PROCESSES">max_worker_processes</ulink> This setting is only available for PostgreSQL 9.4+. For PostgreSQL 9.6+ this setting has additional importance in that it controls the max number of processes you can have for parallel queries.
de: <ulink url="https://www.postgresql.org/docs/current/static/runtime-config-resource.html#GUC-MAX-WORKER-PROCESSES">max_worker_processes</ulink> Diese Einstellung ist erst ab PostgreSQL 9.4+ verfügbar. Ab PostgreSQL 9.6+ hat diese Einstellung eine zusätzliche Bedeutung, da sie die maximale Anzahl von Prozessen bestimmt, die bei parallel ablaufenden Abfragen verwendet werden können.

source: Sets the maximum number of background processes that the system can support. This parameter can only be set at server start.
de: Bestimmt die maximale Anzahl von Hintergrundprozessen die das System unterstützen kann. Dieser Parameter kann nur beim Serverstart gesetzt werden.

source: Runtime
de: Runtime/Laufzeit

source: <ulink url="http://www.postgresql.org/docs/current/static/runtime-config-resource.html#GUC-WORK-MEM">work_mem</ulink> (the memory used for sort operations and complex queries)
de: <ulink url="http://www.postgresql.org/docs/current/static/runtime-config-resource.html#GUC-WORK-MEM">work_mem</ulink> (jener Arbeitsspeicher der für Sortieroperationen und komplexe Abfragen benutzt wird)
es: <ulink url="http://www.postgresql.org/docs/current/static/runtime-config-resource.html#GUC-WORK-MEM">work_mem</ulink> (memoria utilizada para operaciones cortas y consultas complejas)
fr: <ulink url="http://www.postgresql.org/docs/current/static/runtime-config-resource.html#GUC-WORK-MEM">work_mem</ulink> (la mémoire utilisé pour les opérations de tri et les requêtes complexes)

source: Adjust up for large dbs, complex queries, lots of RAM
de: Nach oben setzen für große Datenbanken, komplexe Abfragen und wenn große Mengen an Arbeitsspeicher zur Verfügung stehen.
es: Ajuste para bases de datos grandes, consultas complejas, mucha RAM
fr: Ajuster vers le haut pour de grandes bases de données, des requêtes complexes, beaucoup de RAM

source: Adjust down for many concurrent users or low RAM.
de: Nach unten setzen bei vielen gleichzeitigen Anwendern oder wenn wenig Arbeitsspeicher zur Verfügung steht
es: Ajuste para muchos usuarios concurrentes o menos RAM
fr: Ajuster vers le bas pour beaucoup d'accès concurrents ou peu de RAM

source: If you have lots of RAM and few developers:
de: Falls sie viel Arbeitsspeicher aber wenig Entwickler zur Verfügung haben:
es: Si tienes mucha RAM y algunos desarrolladores:
fr: Si vous avez beaucoup de RAM et peu de développeurs:

source: <ulink url="http://www.postgresql.org/docs/current/static/runtime-config-resource.html#GUC-MAINTENANCE-WORK-MEM">maintenance_work_mem</ulink> (used for VACUUM, CREATE INDEX, etc.)
de: <ulink url="http://www.postgresql.org/docs/current/static/runtime-config-resource.html#GUC-MAINTENANCE-WORK-MEM">maintenance_work_mem</ulink> (wird für VACUUM, CREATE INDEX, etc. genutzt)
es: <ulink url="http://www.postgresql.org/docs/current/static/runtime-config-resource.html#GUC-MAINTENANCE-WORK-MEM">maintenance_work_mem</ulink> (utilizado en operaciones de VACUUM, CREATE INDEX, etc.)
fr: <ulink url="http://www.postgresql.org/docs/current/static/runtime-config-resource.html#GUC-MAINTENANCE-WORK-MEM">maintenance_work_mem</ulink> (Utilisé pour VACUUM, CREATE INDEX, etc.)

source: Generally too low - ties up I/O, locks objects while swapping memory
de: Ist im allgemeinen zu niedrig gesetzt - bindet I/O, sperrt Objekte während es den Speicher auslagert
es: Generalmente muy bajo - cierra I/O, bloquea objetos en la memoria de intercambio
fr: Généralement trop faible en I/O, objets verrouillés pendant les permutations de mémoire

source: Recommend 32MB to 1GB on production servers w/lots of RAM, but depends on the # of concurrent users. If you have lots of RAM and few developers:
de: Es werden 32MB bis 1GB auf Produktionsservern mit viel Hauptspeicher empfohlen, was allerdings von der Anzahl der Anwender abhängt. Falls Sie eine Menge an Arbeitsspeicher und wenige Entwickler haben:

source: <ulink url="https://www.postgresql.org/docs/current/static/runtime-config-resource.html#GUC-MAX-PARALLEL-WORKERS-PER-GATHER">max_parallel_workers_per_gather</ulink> This setting is only available for PostgreSQL 9.6+ and will only affect PostGIS 2.3+, since only PostGIS 2.3+ supports parallel queries. If set to higher than 0, then some queries such as those involving relation functions like <code>ST_Intersects</code> can use multiple processes and can run more than twice as fast when doing so. If you have a lot of processors to spare, you should change the value of this to as many processors as you have. Also make sure to bump up <code>max_worker_processes</code> to at least as high as this number.
de: <ulink url="https://www.postgresql.org/docs/current/static/runtime-config-resource.html#GUC-MAX-PARALLEL-WORKERS-PER-GATHER">max_parallel_workers_per_gather</ulink> Diese Enstellung ist erst ab PostgreSQL 9.6+ verfügbar und wirkt sich erst ab PostGIS 2.3+ aus, da nur PostGIS 2.3+ parallel laufende Abfragen unterstützt. Wenn der Parameter auf einen höheren Wert als 0 gestellt wird können manche Abfragen, wie jene die Relationsfunktionen wie <code>ST_Intersects</code> verwenden, mehrere Prozesse benutzen und mehr als doppelt so schnell ablaufen. Falls Sie eine große Anzahl an Prozessoren zur Verfügung haben, sollten Sie diesen Wert auf die Anzahl der Prozessoren setzen. Stellen Sie bitte auch sicher die <code>max_worker_processes</code> auf zumindest die gleiche Anzahl zu erhöhen.

source: Sets the maximum number of workers that can be started by a single <varname>Gather</varname> node. Parallel workers are taken from the pool of processes established by <varname>max_worker_processes</varname>. Note that the requested number of workers may not actually be available at run time. If this occurs, the plan will run with fewer workers than expected, which may be inefficient. Setting this value to 0, which is the default, disables parallel query execution.
de: Setzt die maximale Anzahl von Workern, die durch einen einzelnen <varname>Gather</varname> Knoten aufgerufen werden können. Parallele Worker werden aus einem Pool von Prozessen, welche von <varname>max_worker_processes</varname> aufgespannt sind, entnommen. Beachten Sie bitte, das die angeforderte Anzahl von Workern zur Laufzeit nicht tatsächlich zur Verfügung stehen kann. Falls dies auftritt wird der Plan mit weniger Workern als erwartet ausgeführt, was leistungsschwach sein kann. Setzt man den Wert auf 0, was der Standardeinstellung entspricht, wird die parallele Ausführung von Abfragen unterbunden.

source: Current PostgreSQL versions (including 8.0) suffer from a query optimizer weakness regarding TOAST tables. TOAST tables are a kind of "extension room" used to store large (in the sense of data size) values that do not fit into normal data pages (like long texts, images or complex geometries with lots of vertices), see <ulink url="http://www.postgresql.org/docs/current/static/storage-toast.html">the PostgreSQL Documentation for TOAST</ulink> for more information).
es: Versiones actuales de PostgreSQL (incluyendo la 8.0) tienen algunas debilidades en la optimización de consultas respecto a tablas TOAST. Las tablas TOAST son una especie de "cámara de extensiones" utilizadas para almacenar valores grandes (en sentido de tamaño de datos) que no se pueden mostrar en paginas de datos (como textos largos, imágenes o geometrías complejas con muchos vértices). Para mas información visita <ulink url="http://www.postgresql.org/docs/current/static/storage-toast.html">the PostgreSQL Documentation for TOAST</ulink>
fr: Les versions de PostgreSQL actuelles (y compris 8.0) souffrent d'une faiblesse optimiseur de requête relative les tables TOAST. Tables TOAST sont une sorte de «salle de l'extension" utilisé pour stocker de grandes valeurs (dans le sens de la taille des données) qui ne rentrent pas dans les pages de données normales (comme de longs textes, images ou des géométries complexes avec beaucoup de sommets), voir <ulink url="http://www.postgresql.org/docs/current/static/storage-toast.html"> Documentation PostgreSQL pour TOAST </ulink> pour plus d'informations).

source: The problem appears if you happen to have a table with rather large geometries, but not too much rows of them (like a table containing the boundaries of all European countries in high resolution). Then the table itself is small, but it uses lots of TOAST space. In our example case, the table itself had about 80 rows and used only 3 data pages, but the TOAST table used 8225 pages.
es: El problema aparece si ocurre que tienes una tabla con geometrías bastante grandes, pero no demasiadas filas de ellas (como una tabla que contiene los límites de todos los países europeos en alta resolución). A continuación, la tabla en sí es pequeña, pero utiliza una gran cantidad de espacio TOAST. En nuestro caso de ejemplo, la tabla en sí tenía alrededor de 80 filas y se utiliza sólo 3 páginas de datos, pero la tabla TOAST utiliza 8225 páginas.
fr: Le problème apparaît s'il vous arrive d'avoir une table avec d'assez grandes géométries, mais pas beaucoup de lignes d'entre elles (comme un tableau contenant les frontières de tous les pays européens en haute résolution). Ensuite, le tableau lui-même est petit, mais il utilise beaucoup d'espace TOAST. Dans notre exemple, le cas, la table elle-même avait environ 80 lignes et seulement 3 pages de données utilisées, mais la table TOAST 8225 pages utilisé.

source: Now issue a query where you use the geometry operator &amp;&amp; to search for a bounding box that matches only very few of those rows. Now the query optimizer sees that the table has only 3 pages and 80 rows. He estimates that a sequential scan on such a small table is much faster than using an index. And so he decides to ignore the GIST index. Usually, this estimation is correct. But in our case, the &amp;&amp; operator has to fetch every geometry from disk to compare the bounding boxes, thus reading all TOAST pages, too.
es: Ahora al emitir una consulta en la que utilizas el operador geométrico &amp;&amp; para buscar un límite que coincide sólo unas pocas de esas filas, el optimizador de consultas ve que la tabla sólo tiene 3 páginas y 80 filas. Se estima que un escaseo secuencial en una tabla pequeña de este tipo es mucho más rápida que usando un índice. Y por lo que decide ignorar el índice de GIST. Por lo general, esta estimación es correcta. Pero en nuestro caso, el operador &amp;&amp; tiene que buscar en cada geometría del disco la comparación de los limites, y leer todas las páginas TOAST también.
fr: Maintenant émettre une requête en utilisant l'opérateur de géométrie &amp;&amp; pour rechercher une boîte englobante qui correspond que très peu de ces lignes. Maintenant l'optimiseur de requêtes voit que la table n'a que 3 pages et 80 lignes. Il estime qu'une analyse séquentielle sur une telle petite table est beaucoup plus rapide que d'utiliser un index. Et alors il décide d'ignorer l'index GIST. Habituellement, cette estimation est correcte. Mais dans notre cas, l'opérateur &amp;&amp; doit aller chercher chaque géométrie à partir du disque pour comparer les boîtes englobantes, et par conséquent la lecture de toutes les pages TOAST également.

source: To see whether your suffer from this bug, use the "EXPLAIN ANALYZE" postgresql command. For more information and the technical details, you can read the thread on the postgres performance mailing list: http://archives.postgresql.org/pgsql-performance/2005-02/msg00030.php
es: Para comprobar si padeces de este error, utiliza el comando "EXPLAIN ANALYZE" postgresql. Para obtener más información y los detalles técnicos, puedes leer el hilo en la lista de correo de rendimiento postgres: http://archives.postgresql.org/pgsql-performance/2005-02/msg00030.php
fr: Pour voir si votre souffrent de ce bogue, utilisez la commande "EXPLAIN ANALYZE" de postgresql. Pour plus d'informations et détails techniques, vous pouvez lire le fil sur la liste de diffusion des performances de postgres: http://archives.postgresql.org/pgsql-performance/2005-02/msg00030.php

source: These tips are taken from Kevin Neufeld's presentation "Tips for the PostGIS Power User" at the FOSS4G 2007 conference. Depending on your use of PostGIS (for example, static data and complex analysis vs frequently updated data and lots of users) these changes can provide significant speedups to your queries.
es: Estos consejos han sido tomados de la presentación de Kevin Neufeld "Tips for the PostGIS Power User" en la conferencia FOSS4G 2007. Dependiendo de tu uso de PostGIS (por ejemplo, datos estáticos y análisis complejo frente a un montón de actualizaciones frecuentes de datos de los usuarios), estos cambios pueden proporcionar aceleraciones significativas a tus consultas.
fr: Ces conseils sont tirés de la présentation de Kevin Neufeld "Conseils pour l'utilisateur PostGIS " lors de la conférence FOSS4G 2007. En fonction de votre utilisation de PostGIS (par exemple, les données statiques et des analyses complexes contre données fréquemment mises à jour et beaucoup d'utilisateurs), ces changements peuvent fournir des accélérations significatives à vos requêtes..

source: For a more tips (and better formatting), the original presentation is at <ulink url="http://2007.foss4g.org/presentations/view.php?abstract_id=117"> http://2007.foss4g.org/presentations/view.php?abstract_id=117</ulink>.
es: Para más consejos (y mejoras de formato), la presentación original se encuentra en <ulink url="http://2007.foss4g.org/presentations/view.php?abstract_id=117"> http://2007.foss4g.org/presentations/view.php?abstract_id=117</ulink>.
fr: Pour plus d'astuces (et un meilleur format), la présentation original est ici <ulink url="http://2007.foss4g.org/presentations/view.php?abstract_id=117"> http://2007.foss4g.org/presentations/view.php?abstract_id=117</ulink>.

source: Maximum number of log file segments between automatic WAL checkpoints (each segment is normally 16MB); default is 3
es: Numero máximo de segmentos del fichero log entre puntos de control WAL automáticos (cada segmento tiene normalmente 16MB); el valor por defecto es 3
fr: Le nombre maximum de secteurs du fichier journal entre les points de contrôle automatiques WAL (chaque secteur est normalement à 16MB); par défaut : 3

source: Set to at least 10 or 30 for databases with heavy write activity, or more for large database loads. Another article on the topic worth reading <ulink url="http://www.westnet.com/~gsmith/content/postgresql/chkp-bgw-83.htm">Greg Smith: Checkpoint and Background writer</ulink>
es: Se establece en al menos entre 10 o 30 para las bases de datos con la actividad de escritura pesada, o más para las grandes cargas de bases de datos. Otro artículo sobre el tema que vale la pena leer <ulink url="http://www.westnet.com/~gsmith/content/postgresql/chkp-bgw-83.htm">Greg Smith: Checkpoint and Background writer</ulink>
fr: Régler à au moins 10 ou 30 pour des bases de données ayant une activité d'écriture lourde, ou plus pour les bases de données à grosses charges. Un autre article sur le sujet mérite d'être lu <ulink url="http://www.westnet.com/~gsmith/content/postgresql/chkp-bgw-83.htm">Greg Smith: Checkpoint and Background writer</ulink>

source: Possibly store the xlog on a separate disk device
es: Posibilidad de almacenar el xlog en un dispositivo de disco independiente
fr: Il est possible de stocker le xlog sur une disque dur externe

source: Default: off (prior to PostgreSQL 8.4 and for PostgreSQL 8.4+ is set to partition)
es: Por defecto:off (anterior a PostgreSQL 8.4 y para PostgreSQL 8.4+ esta seleccionado como partición)
fr: Par défaut: off (avant PostgreSQL 8.4 et PostgreSQL 8.4 + est réglé sur partition)

source: This is generally used for table partitioning. If you are running PostgreSQL versions below 8.4, set to "on" to ensure the query planner will optimize as desired. As of PostgreSQL 8.4, the default for this is set to "partition" which is ideal for PostgreSQL 8.4 and above since it will force the planner to only analyze tables for constraint consideration if they are in an inherited hierarchy and not pay the planner penalty otherwise.
es: Esto se utiliza generalmente para la partición de tablas. Si estás ejecutando versiones anteriores a PostgreSQL 8.4 , se establece en "on" para garantizar que el planeador de consultas optimizará. A partir de PostgreSQL 8.4, el valor predeterminado para este está ajustado a "partición", que es ideal para PostgreSQL 8.4 y superiores, ya que obligará al planificador a analizar sólo las tablas para considerar las restricciones si están en una jerarquía hereditaria y no penalizar al planificador de otra manera .
fr: Ceci est généralement utilisé pour le partitionnement de table. Si vous utilisez des versions de PostgreSQL inférieur à 8.4 , régler sur "on" pour s'assurer que le planificateur de requêtes optimisera comme désiré. Pour PostgreSQL 8.4, la valeur par défaut pour ce paramètre est réglé à "partition" qui est idéal pour PostgreSQL 8.4 et au-dessus, car il va forcer le planificateur à analyser uniquement les tables pour les contraintes, si elles sont dans une hiérarchie héritée et si elles ne vont pas pénaliser le planificateur d'un autre coté.

source: Default: ~32MB
es: Por defecto: ~32MB
fr: Par défaut : ~32MB

source: Set to about 1/3 to 3/4 of available RAM
es: Cambialo a un valor entre 1/3 a 3/4 de la memoria RAM disponible.
fr: Régler à environ 1/3 jusqu'à 3/4 de la RAM disponible

source: Default: 1MB
es: Por defecto: 1MB
fr: Par défaut : 1MB

source: Default: 16MB
es: Por defecto: 16MB
fr: Par défaut : 16MB

source: Recommend 32MB to 256MB on production servers w/lots of RAM, but depends on the # of concurrent users. If you have lots of RAM and few developers:
es: Se recomienda de 32MB a 256MB en servidores de producción con mucha RAM, pero depende del numero de usuarios simultáneos. Si tienes mucha memoria RAM y algunos desarrolladores:
fr: 32MB à 256MB sont recommandé sur des serveur de production avec beaucoup de RAM, but cela dépend du nombre d'accès concurrents. Si vous avez beaucoup de RAM et peu de développeurs:

source: SET maintainence_work_mem TO 1200000;
fr: SET maintenance_work_mem TO 1200000;
