Repository: postgis/postgis
Catalog: doc/po/*/reference_processing.xml.po
Languages: de, ja, ko_kr, zh_hans

source: Geometry Collections are often difficult to deal with with third party tools, so use ST_Polygonize in conjunction with <xref linkend="ST_Dump"/> to dump the polygons out into individual polygons.
de: Tools von Drittanbietern haben öfters Probleme mit einer Sammelgeometrie. Verwenden Sie daher ST_Polygonize in Verbindung mit <xref linkend="ST_Dump"/>, um die Polygone in Einzelpoygone zu zerlegen.
ja: ジオメトリコレクションはしばしばサードパーティのツールでは扱いにくいことがあります。ST_Polygonizeを<xref linkend="ST_Dump"/>と併用して、ポリゴンを個々のポリゴンにダンプします。
ko_kr: 도형 집합은 종종 제 3자 도구로 처리하기 어렵기 때문에, 폴리곤들을 개별 폴리곤으로 덤프하기 위해 ST_Polygonize를 <xref linkend="ST_Dump"/> 와 결합해서 이용하곤 합니다.

source: Availability: 1.0.0RC1 - requires GEOS &gt;= 2.1.0.
de: Verfügbarkeit: 1.0 - benötigt GEOS &gt;= 2.1.0.
ja: Availability: 1.0.0RC1 - GEOS 2.1.0が必要です。
ko_kr: 1.0.0RC1 버전부터 사용할 수 있습니다. GEOS 2.1.0 이상 버전이 필요합니다.

source: Examples: Polygonizing single linestrings
de: Beispiele: Einzelne Linienzüge in ein Polygon umwandeln.
ja: 例: 単一ラインストリングのポリゴン化
ko_kr: 예시: 단일 라인스트링의 폴리곤화

source: SELECT ST_AsEWKT(ST_Polygonize(the_geom_4269)) As geomtextrep FROM (SELECT the_geom_4269 FROM ma.suffolk_edges ORDER BY tlid LIMIT 45) As foo; geomtextrep ------------------------------------- SRID=4269;GEOMETRYCOLLECTION(POLYGON((-71.040878 42.285678,-71.040943 42.2856,-71.04096 42.285752,-71.040878 42.285678)), POLYGON((-71.17166 42.353675,-71.172026 42.354044,-71.17239 42.354358,-71.171794 42.354971,-71.170511 42.354855, -71.17112 42.354238,-71.17166 42.353675))) (1 row) --Use ST_Dump to dump out the polygonize geoms into individual polygons SELECT ST_AsEWKT((ST_Dump(foofoo.polycoll)).geom) As geomtextrep FROM (SELECT ST_Polygonize(the_geom_4269) As polycoll FROM (SELECT the_geom_4269 FROM ma.suffolk_edges ORDER BY tlid LIMIT 45) As foo) As foofoo; geomtextrep ------------------------ SRID=4269;POLYGON((-71.040878 42.285678,-71.040943 42.2856,-71.04096 42.285752, -71.040878 42.285678)) SRID=4269;POLYGON((-71.17166 42.353675,-71.172026 42.354044,-71.17239 42.354358 ,-71.171794 42.354971,-71.170511 42.354855,-71.17112 42.354238,-71.17166 42.353675)) (2 rows)
de: SELECT ST_AsEWKT(ST_Polygonize(the_geom_4269)) As geomtextrep FROM (SELECT the_geom_4269 FROM ma.suffolk_edges ORDER BY tlid LIMIT 45) As foo; geomtextrep ------------------------------------- SRID=4269;GEOMETRYCOLLECTION(POLYGON((-71.040878 42.285678,-71.040943 42.2856,-71.04096 42.285752,-71.040878 42.285678)), POLYGON((-71.17166 42.353675,-71.172026 42.354044,-71.17239 42.354358,-71.171794 42.354971,-71.170511 42.354855, -71.17112 42.354238,-71.17166 42.353675))) (1 row) --Verwendung von ST_Dump um die polygonisierten Geometrien in einzelne Polygone auszuladen SELECT ST_AsEWKT((ST_Dump(foofoo.polycoll)).geom) As geomtextrep FROM (SELECT ST_Polygonize(the_geom_4269) As polycoll FROM (SELECT the_geom_4269 FROM ma.suffolk_edges ORDER BY tlid LIMIT 45) As foo) As foofoo; geomtextrep ------------------------ SRID=4269;POLYGON((-71.040878 42.285678,-71.040943 42.2856,-71.04096 42.285752, -71.040878 42.285678)) SRID=4269;POLYGON((-71.17166 42.353675,-71.172026 42.354044,-71.17239 42.354358 ,-71.171794 42.354971,-71.170511 42.354855,-71.17112 42.354238,-71.17166 42.353675)) (2 rows)
ja: SELECT ST_AsEWKT(ST_Polygonize(the_geom_4269)) As geomtextrep FROM (SELECT the_geom_4269 FROM ma.suffolk_edges ORDER BY tlid LIMIT 45) As foo; geomtextrep ------------------------------------- SRID=4269;GEOMETRYCOLLECTION(POLYGON((-71.040878 42.285678,-71.040943 42.2856,-71.04096 42.285752,-71.040878 42.285678)), POLYGON((-71.17166 42.353675,-71.172026 42.354044,-71.17239 42.354358,-71.171794 42.354971,-71.170511 42.354855, -71.17112 42.354238,-71.17166 42.353675))) (1 row) -- ポリゴン化ジオメトリを個々のポリゴンにダンプするためST_Dumpを使います SELECT ST_AsEWKT((ST_Dump(foofoo.polycoll)).geom) As geomtextrep FROM (SELECT ST_Polygonize(the_geom_4269) As polycoll FROM (SELECT the_geom_4269 FROM ma.suffolk_edges ORDER BY tlid LIMIT 45) As foo) As foofoo; geomtextrep ------------------------ SRID=4269;POLYGON((-71.040878 42.285678,-71.040943 42.2856,-71.04096 42.285752, -71.040878 42.285678)) SRID=4269;POLYGON((-71.17166 42.353675,-71.172026 42.354044,-71.17239 42.354358 ,-71.171794 42.354971,-71.170511 42.354855,-71.17112 42.354238,-71.17166 42.353675)) (2 rows)
ko_kr: SELECT ST_AsEWKT(ST_Polygonize(the_geom_4269)) As geomtextrep FROM (SELECT the_geom_4269 FROM ma.suffolk_edges ORDER BY tlid LIMIT 45) As foo; geomtextrep ------------------------------------- SRID=4269;GEOMETRYCOLLECTION(POLYGON((-71.040878 42.285678,-71.040943 42.2856,-71.04096 42.285752,-71.040878 42.285678)), POLYGON((-71.17166 42.353675,-71.172026 42.354044,-71.17239 42.354358,-71.171794 42.354971,-71.170511 42.354855, -71.17112 42.354238,-71.17166 42.353675))) (1 row) -- ST_Dump를 통해 폴리곤화시킨 도형들을 개별 폴리곤으로 덤프합니다. SELECT ST_AsEWKT((ST_Dump(foofoo.polycoll)).geom) As geomtextrep FROM (SELECT ST_Polygonize(the_geom_4269) As polycoll FROM (SELECT the_geom_4269 FROM ma.suffolk_edges ORDER BY tlid LIMIT 45) As foo) As foofoo; geomtextrep ------------------------ SRID=4269;POLYGON((-71.040878 42.285678,-71.040943 42.2856,-71.04096 42.285752, -71.040878 42.285678)) SRID=4269;POLYGON((-71.17166 42.353675,-71.172026 42.354044,-71.17239 42.354358 ,-71.171794 42.354971,-71.170511 42.354855,-71.17112 42.354238,-71.17166 42.353675)) (2 rows)

source: Node a set of linestrings.
de: Knotenberechnung für eine Menge von Linienzügen.
ja: ラインストリングの集合にノードを作成します。
ko_kr: 라인스트링들의 집합에 노드를 적용합니다.

source: Fully node a set of linestrings using the least possible number of nodes while preserving all of the input ones.
de: Komplette Knotenberechnung für eine Menge von Linienzügen unter Verwendung der kleinstmöglichen Knotenanzahl und Erhaltung aller bestehenden Knoten.
ja: 最小の可能なノード数を使ってラインストリングにノードを作成します。全ての入力ラインストリングは保存されます。
ko_kr: 입력 라인스트링의 모든 노드를 보전하면서 가능한 한 가장 적은 개수의 노드를 이용해서 라인스트링 집합 전체에 노드를 적용합니다.

source: Availability: 2.0.0 - requires GEOS &gt;= 3.3.0.
de: Verfügbarkeit: 2.0.0 - benötigt GEOS &gt;= 3.3.0.
ja: Availability: 2.0.0 - GEOS 3.3.0以上が必要
ko_kr: 2.0.0 버전부터 사용할 수 있습니다. GEOS 3.3.0 이상 버전이 필요합니다.

source: Due to a bug in GEOS up to 3.3.1 this function fails to node self-intersecting lines. This is fixed with GEOS 3.3.2 or higher.
de: Aufgrund eines Fehlers in GEOS &lt; 3.3.1 versagt diese Funktion bei der Knotenberechnung von selbstüberschneidenden Linien. Dies wurde mit GEOS 3.3.2 und höher behoben.
ja: GEOS 3.3.1までのバグのため、この関数は自己インタセクトするラインのノード作成に失敗します。GEOS 3.3.2以上で訂正されています。
ko_kr: GEOS 3.3.1 버전까지의 버그 때문에 이 함수가 자체 교차하는 라인에 노드를 적용할 수 없었습니다. GEOS 3.3.2 버전부터 이 버그가 수정됐습니다.

source: Changed: 2.4.0 this function uses GEOSNode internally instead of GEOSUnaryUnion. This may cause the resulting linestrings to have a different order and direction compared to Postgis &lt; 2.4.
de: Änderung: Ab 2.4.0 verwendet diese Funktion intern GEOSNode anstatt GEOSUnaryUnion. Dies kann bedingen, dass die resultierenden Linienzüge eine andere Reihenfolge und Ausrichtung haben als bei PostGIS &lt; 2.4.
ja: Changed: 2.4.0 この関数は内部でGEOSUnaryUnionの替わりにGEOSNodeを使用しています。ラインストリングの並び順と方向がPostGIS 2.4より前のものと違うことになるかも知れません。

source: Return an offset line at a given distance and side from an input line. Useful for computing parallel lines about a center line
de: Gibt eine Linie zurück, die um eine gegebenen Entfernung und Seite von der Eingabelinie versetzt ist. Nützlich zur Berechnung von Linien, die zu einer Mittellinie parallel verlaufen
ja: 与えられた距離と方面に入力ラインをずらしたラインを返します。中心線と平行する線を引く際に使えます。
ko_kr: 입력라인으로부터 주어진 거리 및 방향에 있는 오프셋 라인을 반환합니다. 중심선을 기준으로 평행한 라인들을 계산하는 데 유용합니다.

source: Return an offset line at a given distance and side from an input line. All points of the returned geometries are not further than the given distance from the input geometry.
de: Gibt eine versetzte Linie zurück; in der gegebenen Entfernung und auf der Seite der Eingabelinie, die angegebenen wurden. Alle Punkte der Ausgabegeometrie liegen nicht weiter weg, als die zur Eingangsgeometrie angegebene Entfernung.
ja: 与えられた距離と方面に入力ラインをずらしたラインを返します。返されるジオメトリの全てのポイントは、入力ジオメトリより与えられた距離以上には離れません。
ko_kr: 입력라인으로부터 주어진 거리 및 방향에 있는 오프셋 라인을 반환합니다. 반환된 도형의 모든 포인트들은 입력 도형으로부터 주어진 거리를 넘지 않습니다.

source: For positive distance the offset will be at the left side of the input line and retain the same direction. For a negative distance it'll be at the right side and in the opposite direction.
de: Bei positiven Entfernungsangaben/distance findet der Versatz auf der linken Seite der Eingabelinie statt und die Richtung wird beibehalten. Bei negativen Entfernungsangaben auf der rechten Seite und in entgegengesetzter Richtung.
ja: 距離が正の場合には、入力ラインの左側にずらして、方向が保持されます。負の場合には、右側にずらし、逆方向のラインになります。
ko_kr: 양의 거리를 설정한 경우 오프셋은 입력 라인의 왼쪽에 생성되며 동일한 방향을 유지할 것입니다. 음의 거리를 설정하면 오른쪽에 생성되며 반대 방향을 향할 것입니다.

source: Availability: 2.0 - requires GEOS &gt;= 3.2, improved with GEOS &gt;= 3.3
de: Verfügbarkeit: 2.0 - benötigt GEOS &gt;= 3.2, verbessert mi GEOS &gt;= 3.3
ja: Availability: 2.0 - GEOS 3.2以上、GEOS 3.3以上で改善されました。
ko_kr: 2.0 버전부터 사용할 수 있습니다. GEOS 3.2 이상 버전이 필요합니다. GEOS 3.3 버전에서 개선됐습니다.

source: The optional third parameter allows specifying a list of blank-separated key=value pairs to tweak operations as follows:
de: Der optionale dritte Parameter ermöglicht es eine Liste von leerzeichengetrennten key=value Paaren anzulegen, um die Berechnungen wie folgt zu optimieren:
ja: 任意指定の第3引数では、空白区切りのkey=valueペアの一覧を指定して、次のような操作をすることができます。
ko_kr: 다음과 같이 연산을 조정하기 위해 선택적인 세 번째 파라미터로 공백으로 구분된 키=값 쌍의 목록을 설정할 수 있습니다:
zh_hans: 可选的第三个参数允许指定空白分隔的键=值对的列表来调整操作，如下所示：

source: 'join=round|mitre|bevel' : join style (defaults to "round"). 'miter' is also accepted as a synonym for 'mitre'.
de: 'join=round|mitre|bevel' : join style (defaults to "round"). 'miter' kann auch als Synonym für 'mitre' verwendet werden.
ja: 'join=round|mitre|bevel' : 接続スタイル (デフォルトは"round")。'miter'も'mitre'の同義語として受け付けます。
ko_kr: 'join=round|mitre|bevel' : 접합 스타일(기본값은 "원형(round)"). '마이터(mitre)'의 동의어로 '마이터(miter)'도 쓸 수 있습니다.
zh_hans: 'join=round|mitre|bevel' ：连接样式（默认为“round”）。 “mitre”也被认为是“mitre”的同义词。

source: 'mitre_limit=#.#' : mitre ratio limit (only affects mitred join style). 'miter_limit' is also accepted as a synonym for 'mitre_limit'.
de: 'mitre_limit=#.#' : Gehrungsobergrenze (beeinflusst nur Gehrungsverbindungen). 'miter_limit' kann auch als Synonym von 'mitre_limit' verwendet werden.
ja: 'mitre_limit=#.#' : マイターの割合制限 (接続スタイルがマイターである場合のみ影響が出ます)。'miter_limit'も'mitre_limit'の同義語として受け付けます。
ko_kr: 'mitre_limit=#.#' : 마이터 비율 제한(마이터 접합 스타일만 영향을 받습니다). 'mitre_limit'의 동의어로 'miter_limit'도 쓸 수 있습니다.
zh_hans: 'mitre_limit=#.#' ：斜接比率限制（仅影响斜接连接样式）。 “miter_limit”也被接受为“mitre_limit”的同义词。

source: Units of distance are measured in units of the spatial reference system.
de: Die Einheiten der Entfernung werden in den Einheiten des Koordinatenreferenzsystems gemessen.
ja: 距離の単位は空間参照系の単位です。
ko_kr: 거리의 단위는 공간 참조 시스템의 단위로 측정됩니다.
zh_hans: 距离单位以空间参考系的单位来测量。

source: The inputs can only be LINESTRINGS.
de: Als Eingabe gelten nur Linienzüge.
ja: 入力はLINESTRINGのみ可能です。
ko_kr: 라인스트링만 입력할 수 있습니다.

source: This function ignores the third dimension (z) and will always give a 2-d result even when presented with a 3d-geometry.
de: Diese Funktion ignoriert die dritte Dimension (z) und gibt immer ein 2-D Ergebnis zurück, sogar dann wenn eine 3D-Geometrie überreicht wird.
ja: この関数は第3次元 (Z)を無視し、3次元ジオメトリが与えられたとしても、常に2次元の結果を返します。
ko_kr: 이 함수는 3차원 도형을 입력받더라도 세 번째 차원(Z)을 무시하고 언제나 2차원 결과를 반환할 것입니다.

source: Compute an open buffer around roads
de: Einen offenen Puffer um die Straßen rechnen
ja: 道路の周りの開いたバッファの算出
ko_kr: 도로 주위로 열린 버퍼를 계산합니다.
zh_hans: 计算道路周围的开放缓冲区

source: 15, 'quad_segs=4 join=round' original line and its offset 15 units.
de: 15, 'quad_segs=4 join=round' Ausgangslinie und die um 15 Einheiten versetzte Parallele.
ja: 15, 'quad_segs=4 join=round' 元のラインと15単位ずらしたライン。
ko_kr: 거리 15, 원본 라인에서 'quad_segs=4 join=round' 및 오프셋은 15단위
zh_hans: 15、'quad_segs=4 join=round' 原始线及其偏移 15 个单位。

source: SELECT ST_AsText(ST_OffsetCurve(ST_GeomFromText( 'LINESTRING(164 16,144 16,124 16,104 16,84 16,64 16, 44 16,24 16,20 16,18 16,17 17, 16 18,16 20,16 40,16 60,16 80,16 100, 16 120,16 140,16 160,16 180,16 195)'), 15, 'quad_segs=4 join=round')); --output -- LINESTRING(164 1,18 1,12.2597485145237 2.1418070123307, 7.39339828220179 5.39339828220179, 5.39339828220179 7.39339828220179, 2.14180701233067 12.2597485145237,1 18,1 195)
ja: SELECT ST_AsText(ST_OffsetCurve(ST_GeomFromText( 'LINESTRING(164 16,144 16,124 16,104 16,84 16,64 16, 44 16,24 16,20 16,18 16,17 17, 16 18,16 20,16 40,16 60,16 80,16 100, 16 120,16 140,16 160,16 180,16 195)'), 15, 'quad_segs=4 join=round')); -- 出力 -- LINESTRING(164 1,18 1,12.2597485145237 2.1418070123307, 7.39339828220179 5.39339828220179, 5.39339828220179 7.39339828220179, 2.14180701233067 12.2597485145237,1 18,1 195)
ko_kr: SELECT ST_AsText(ST_OffsetCurve(ST_GeomFromText( 'LINESTRING(164 16,144 16,124 16,104 16,84 16,64 16, 44 16,24 16,20 16,18 16,17 17, 16 18,16 20,16 40,16 60,16 80,16 100, 16 120,16 140,16 160,16 180,16 195)'), 15, 'quad_segs=4 join=round')); -- 출력물 -- LINESTRING(164 1,18 1,12.2597485145237 2.1418070123307, 7.39339828220179 5.39339828220179, 5.39339828220179 7.39339828220179, 2.14180701233067 12.2597485145237,1 18,1 195)

source: -15, 'quad_segs=4 join=round' original line and its offset -15 units
de: -15, 'quad_segs=4 join=round' Ausgangslinie und die um -15 Einheiten versetzte Parallele.
ja: -15, 'quad_segs=4 join=round' 元のラインと-15単位ずらしたライン。
ko_kr: 거리 -15, 원본 라인에서 'quad_segs=4 join=round' 및 오프셋은 -15단위
zh_hans: -15, 'quad_segs=4 join=round' 原始线及其偏移量-15个单位

source: SELECT ST_AsText(ST_OffsetCurve(geom, -15, 'quad_segs=4 join=round')) As notsocurvy FROM ST_GeomFromText( 'LINESTRING(164 16,144 16,124 16,104 16,84 16,64 16, 44 16,24 16,20 16,18 16,17 17, 16 18,16 20,16 40,16 60,16 80,16 100, 16 120,16 140,16 160,16 180,16 195)') As geom; -- notsocurvy -- LINESTRING(31 195,31 31,164 31)
ja: SELECT ST_AsText(ST_OffsetCurve(geom, -15, 'quad_segs=4 join=round')) As notsocurvy FROM ST_GeomFromText( 'LINESTRING(164 16,144 16,124 16,104 16,84 16,64 16, 44 16,24 16,20 16,18 16,17 17, 16 18,16 20,16 40,16 60,16 80,16 100, 16 120,16 140,16 160,16 180,16 195)') As geom; -- 曲線になりません -- LINESTRING(31 195,31 31,164 31)

source: double-offset to get more curvy, note the first reverses direction, so -30 + 15 = -15
de: doppelter Versatz um es kurviger zu bekommen; beachte die Richtungsänderung, also -30 + 15 = -15
ja: 二重にずらして曲線を得ます。1回目で逆方向にしていて、-30 + 15 = -15としています。
ko_kr: 더 둥글게 만들기 위한 이중 오프셋, 첫 번째 쿼리가 방향을 역전시킨다는 점에 주의하십시오. 즉 -30 + 15 = -15 입니다.
zh_hans: 双偏移以获得更多曲线，请注意第一个反转方向，因此 -30+15 = -15

source: SELECT ST_AsText(ST_OffsetCurve(ST_OffsetCurve(geom, -30, 'quad_segs=4 join=round'), -15, 'quad_segs=4 join=round')) As morecurvy FROM ST_GeomFromText( 'LINESTRING(164 16,144 16,124 16,104 16,84 16,64 16, 44 16,24 16,20 16,18 16,17 17, 16 18,16 20,16 40,16 60,16 80,16 100, 16 120,16 140,16 160,16 180,16 195)') As geom; -- morecurvy -- LINESTRING(164 31,46 31,40.2597485145236 32.1418070123307, 35.3933982822018 35.3933982822018, 32.1418070123307 40.2597485145237,31 46,31 195)
ja: SELECT ST_AsText(ST_OffsetCurve(ST_OffsetCurve(geom, -30, 'quad_segs=4 join=round'), -15, 'quad_segs=4 join=round')) As morecurvy FROM ST_GeomFromText( 'LINESTRING(164 16,144 16,124 16,104 16,84 16,64 16, 44 16,24 16,20 16,18 16,17 17, 16 18,16 20,16 40,16 60,16 80,16 100, 16 120,16 140,16 160,16 180,16 195)') As geom; -- 曲線になります -- LINESTRING(164 31,46 31,40.2597485145236 32.1418070123307, 35.3933982822018 35.3933982822018, 32.1418070123307 40.2597485145237,31 46,31 195)

source: double-offset to get more curvy,combined with regular offset 15 to get parallel lines. Overlaid with original.
de: Doppelter Versatz um es kurviger zu bekommen, kombiniert mit einem normalen Versatz von 15 um parallele Linien zu erhalten. Überlagert mit dem Original.
ja: 二重にずらして曲線を得て、順方向に15ずらして平行線を得ます。元のラインを覆います。
ko_kr: 평행한 라인을 얻기 위한 정규 오프셋 15와 결합된, 더 둥글게 만들기 위한 이중 오프셋. 원본과 중첩.
zh_hans: 双偏移以获得更多曲线，与常规偏移 15 结合以获得平行线。 与原图重叠。

source: SELECT ST_AsText(ST_Collect( ST_OffsetCurve(geom, 15, 'quad_segs=4 join=round'), ST_OffsetCurve(ST_OffsetCurve(geom, -30, 'quad_segs=4 join=round'), -15, 'quad_segs=4 join=round') ) ) As parallel_curves FROM ST_GeomFromText( 'LINESTRING(164 16,144 16,124 16,104 16,84 16,64 16, 44 16,24 16,20 16,18 16,17 17, 16 18,16 20,16 40,16 60,16 80,16 100, 16 120,16 140,16 160,16 180,16 195)') As geom; -- parallel curves -- MULTILINESTRING((164 1,18 1,12.2597485145237 2.1418070123307, 7.39339828220179 5.39339828220179,5.39339828220179 7.39339828220179, 2.14180701233067 12.2597485145237,1 18,1 195), (164 31,46 31,40.2597485145236 32.1418070123307,35.3933982822018 35.3933982822018, 32.1418070123307 40.2597485145237,31 46,31 195))
ja: SELECT ST_AsText(ST_Collect( ST_OffsetCurve(geom, 15, 'quad_segs=4 join=round'), ST_OffsetCurve(ST_OffsetCurve(geom, -30, 'quad_segs=4 join=round'), -15, 'quad_segs=4 join=round') ) ) As parallel_curves FROM ST_GeomFromText( 'LINESTRING(164 16,144 16,124 16,104 16,84 16,64 16, 44 16,24 16,20 16,18 16,17 17, 16 18,16 20,16 40,16 60,16 80,16 100, 16 120,16 140,16 160,16 180,16 195)') As geom; -- parallel curves (平行曲線) -- MULTILINESTRING((164 1,18 1,12.2597485145237 2.1418070123307, 7.39339828220179 5.39339828220179,5.39339828220179 7.39339828220179, 2.14180701233067 12.2597485145237,1 18,1 195), (164 31,46 31,40.2597485145236 32.1418070123307,35.3933982822018 35.3933982822018, 32.1418070123307 40.2597485145237,31 46,31 195))
ko_kr: SELECT ST_AsText(ST_Collect( ST_OffsetCurve(geom, 15, 'quad_segs=4 join=round'), ST_OffsetCurve(ST_OffsetCurve(geom, -30, 'quad_segs=4 join=round'), -15, 'quad_segs=4 join=round') ) ) As parallel_curves FROM ST_GeomFromText( 'LINESTRING(164 16,144 16,124 16,104 16,84 16,64 16, 44 16,24 16,20 16,18 16,17 17, 16 18,16 20,16 40,16 60,16 80,16 100, 16 120,16 140,16 160,16 180,16 195)') As geom; -- 평행 곡선 -- MULTILINESTRING((164 1,18 1,12.2597485145237 2.1418070123307, 7.39339828220179 5.39339828220179,5.39339828220179 7.39339828220179, 2.14180701233067 12.2597485145237,1 18,1 195), (164 31,46 31,40.2597485145236 32.1418070123307,35.3933982822018 35.3933982822018, 32.1418070123307 40.2597485145237,31 46,31 195))

source: 15, 'quad_segs=4 join=bevel' shown with original line
de: 15, 'quad_segs=4 join=bevel' gemeinsam mit der Ausgangslinie
ja: 15, 'quad_segs=4 join=bevel' と元のライン
ko_kr: 거리 15, 원본 라인과 함께 표출된 'quad_segs=4 join=round'
zh_hans: 15、'quad_segs=4 join=bevel' 显示为原始线

source: SELECT ST_AsText(ST_OffsetCurve(ST_GeomFromText( 'LINESTRING(164 16,144 16,124 16,104 16,84 16,64 16, 44 16,24 16,20 16,18 16,17 17, 16 18,16 20,16 40,16 60,16 80,16 100, 16 120,16 140,16 160,16 180,16 195)'), 15, 'quad_segs=4 join=bevel')); -- output -- LINESTRING(164 1,18 1,7.39339828220179 5.39339828220179, 5.39339828220179 7.39339828220179,1 18,1 195)
ja: SELECT ST_AsText(ST_OffsetCurve(ST_GeomFromText( 'LINESTRING(164 16,144 16,124 16,104 16,84 16,64 16, 44 16,24 16,20 16,18 16,17 17, 16 18,16 20,16 40,16 60,16 80,16 100, 16 120,16 140,16 160,16 180,16 195)'), 15, 'quad_segs=4 join=bevel')); -- 出力 -- LINESTRING(164 1,18 1,7.39339828220179 5.39339828220179, 5.39339828220179 7.39339828220179,1 18,1 195)
ko_kr: SELECT ST_AsText(ST_OffsetCurve(ST_GeomFromText( 'LINESTRING(164 16,144 16,124 16,104 16,84 16,64 16, 44 16,24 16,20 16,18 16,17 17, 16 18,16 20,16 40,16 60,16 80,16 100, 16 120,16 140,16 160,16 180,16 195)'), 15, 'quad_segs=4 join=bevel')); -- 출력 -- LINESTRING(164 1,18 1,7.39339828220179 5.39339828220179, 5.39339828220179 7.39339828220179,1 18,1 195)

source: 15,-15 collected, join=mitre mitre_limit=2.1
ja: join=mitre mitre_limit=2.1で、15ずらしたものと-15ずらしたものとを集めたもの。
ko_kr: 수집된 15, -15. join=mitre mitre_limit=2.1
zh_hans: 15、-15收集，join=mitre mitre_limit=2.1

source: SELECT ST_AsText(ST_Collect( ST_OffsetCurve(geom, 15, 'quad_segs=4 join=mitre mitre_limit=2.2'), ST_OffsetCurve(geom, -15, 'quad_segs=4 join=mitre mitre_limit=2.2') ) ) FROM ST_GeomFromText( 'LINESTRING(164 16,144 16,124 16,104 16,84 16,64 16, 44 16,24 16,20 16,18 16,17 17, 16 18,16 20,16 40,16 60,16 80,16 100, 16 120,16 140,16 160,16 180,16 195)') As geom; -- output -- MULTILINESTRING((164 1,11.7867965644036 1,1 11.7867965644036,1 195), (31 195,31 31,164 31))
ja: SELECT ST_AsText(ST_Collect( ST_OffsetCurve(geom, 15, 'quad_segs=4 join=mitre mitre_limit=2.2'), ST_OffsetCurve(geom, -15, 'quad_segs=4 join=mitre mitre_limit=2.2') ) ) FROM ST_GeomFromText( 'LINESTRING(164 16,144 16,124 16,104 16,84 16,64 16, 44 16,24 16,20 16,18 16,17 17, 16 18,16 20,16 40,16 60,16 80,16 100, 16 120,16 140,16 160,16 180,16 195)') As geom; -- 出力 -- MULTILINESTRING((164 1,11.7867965644036 1,1 11.7867965644036,1 195), (31 195,31 31,164 31))
ko_kr: SELECT ST_AsText(ST_Collect( ST_OffsetCurve(geom, 15, 'quad_segs=4 join=mitre mitre_limit=2.2'), ST_OffsetCurve(geom, -15, 'quad_segs=4 join=mitre mitre_limit=2.2') ) ) FROM ST_GeomFromText( 'LINESTRING(164 16,144 16,124 16,104 16,84 16,64 16, 44 16,24 16,20 16,18 16,17 17, 16 18,16 20,16 40,16 60,16 80,16 100, 16 120,16 140,16 160,16 180,16 195)') As geom; -- 출력물 -- MULTILINESTRING((164 1,11.7867965644036 1,1 11.7867965644036,1 195), (31 195,31 31,164 31))

source: Returns a version of the given geometry with duplicated points removed.
de: Gibt eine Version der Eingabegeometrie zurück, wobei duplizierte Punkte entfernt werden.
ja: 入力ジオメトリから重複ポイントを除いたものを返します。
ko_kr: 입력 도형을 중복된 포인트들을 제거한 상태로 반환합니다.

source: Returns a version of the given geometry with duplicated points removed. Will actually do something only with (multi)lines, (multi)polygons and multipoints but you can safely call it with any kind of geometry. Since simplification occurs on a object-by-object basis you can also feed a GeometryCollection to this function.
de: Gibt eine Version der gegebenen Geometrie zurück, wobei duplizierte Punkte gelöscht werden. Tut zurzeit nur mit (Multi)Lines, (Multi)Polygons und MultiPoints etwas, kann aber gefahrlos mit jedem geometrischen Datentyp verwendet werden. Da die Vereinfachung auf einer Objekt zu Objekt Basis passiert, können Sie diese Funktion auch mit einer Sammelgeometrie speisen.
ja: 入力ジオメトリから重複ポイントを除いたものを返します。実際には(MULTI)LINE, (MULTI)POLYGONとMULTIPOINTで動作します。あらゆる種類のジオメトリで安全に呼び出せます。簡略化がオブジェクトごとに行われるので、ジオメトリコレクションでこの関数を呼ぶことができます。
ko_kr: 입력 도형을 중복된 포인트들을 제거한 상태로 반환합니다. 실제로는 [멀티]포인트, [멀티]라인, [멀티]폴리곤과만 작동하지만, 어떤 종류의 도형도 입력할 수 있다고 해도 과언은 아닙니다. 객체별 기반으로 단순화 작업을 하기 때문에 이 함수에 도형 집합도 입력할 수 있습니다.

source: If the tolerance parameter is provided, vertices within the tolerance of one another will be considered the "same" for the purposes of removal.
de: Wenn der Parameter "tolerance" angegeben ist, werden Knoten, die einen geringeren Abstand untereinander haben zwecks Löschen als ident betrachtet.
ja: tolerance引数を与えると、他の頂点との距離が許容値内にある頂点は、削除の目的から、「同じ」と考えます。
ko_kr: 허용 오차 파라미터를 설정할 경우, 서로 허용 오차 거리 안에 있는 꼭짓점들을 "동일"하다고 간주, 제거할 것입니다.

source: Returns a collection containing paths shared by the two input linestrings/multilinestrings.
de: Gibt eine Sammelgeometrie zurück, welche die gemeinsamen Strecken der beiden eingegebenen LineStrings/MultiLinestrings enthält.
ja: 二つのLINESTRING/MULTILINESTRINGの入力が共有するパスのコレクションを返します。
ko_kr: 두 입력 라인스트링/멀티라인스트링이 공유하는 경로를 담고 있는 집합을 반환합니다.
zh_hans: 返回一个集合，其中包含两个输入线串/多线串共享的路径。
