Repository: postgis/postgis
Catalog: doc/po/*/reference_processing.xml.po
Languages: de, ja, ko_kr, zh_hans

source: The <parameter>path</parameter> component of <varname>geometry_dump</varname> (an <varname>integer[]</varname>) is an index reference enumerating the <varname>POINT</varname>s of the supplied geometry. For example, if a <varname>LINESTRING</varname> is supplied, a path of <varname>{i}</varname> is returned where <varname>i</varname> is the <varname>nth</varname> coordinate in the <varname>LINESTRING</varname>. If a <varname>POLYGON</varname> is supplied, a path of <varname>{i,j}</varname> is returned where <varname>i</varname> is the ring number (1 is outer; inner rings follow) and <varname>j</varname> enumerates the <varname>POINT</varname>s (again 1-based index).
de: Die <parameter>path</parameter> Komponente des <varname>geometry_dump</varname> (ein <varname>integer[]</varname>) ist eine Indexreferenz, welche die <varname>POINT</varname>s der eingegebenen Geometrie abzählt. Wenn zum Beispiel ein <varname>LINESTRING</varname> eingegeben wird, wird ein path von <varname>{i}</varname> zurückgegeben, wobei <varname>i</varname> die <varname>nte</varname> Koordinate in dem <varname>LINESTRING</varname> ist. Falls ein <varname>POLYGON</varname> eingegeben wird, wird ein Pfad von <varname>{i,j}</varname> zurückgegeben, wobei <varname>i</varname> die Ringnummer ist (1 ist äußerer Ring; die inneren Ringe folgen) und <varname>j</varname> zählt die <varname>POINT</varname>s ab (Index beginnt mit 1).
ja: <varname>geometry_dump</varname>の<parameter>path</parameter>要素 (<varname>integer[]</varname>)は、与えられたジオメトリの<varname>POINT</varname>を列挙するインデクス参照です。たとえば、<varname>LINESTRING</varname>が与えられた場合に、<varname>{i}</varname>のpathが返ります。ここで、<varname>i</varname>は<varname>LINESTRING</varname>の<varname>n番目</varname>の座標です。<varname>POLYGON</varname>が与えられた場合には、<varname>{i,j}</varname>のpathが返ります。ここで、<varname>i</varname>は環番号 (1が外環で、内環が続きます)で、<varname>j</varname>は<varname>POINT</varname>を列挙するものです (1始まり)。
ko_kr: <varname>geometry_dump</varname> (<varname>integer[]</varname>)의 <parameter>path</parameter> 구성 요소는 입력 도형의 <varname>POINT</varname> 들을 열거하는 참조 인덱스입니다. 예를 들어 <varname>LINESTRING</varname> 을 입력할 경우, <varname>i</varname> 가 <varname>LINESTRING</varname> 에 있는 <varname>nth</varname> 좌표인 <varname>{i}</varname> 의 경로를 반환합니다. <varname>POLYGON</varname> 을 입력할 경우, <varname>i</varname> 가 고리 번호(1이 외곽 고리이며, 내곽 고리들은 순차적으로 다음 숫자)이며 <varname>j</varname> 가 <varname>POINT</varname> 들을 (1-기반 인덱스에 대해) 열거하는 <varname>{i,j}</varname> 의 경로를 반환합니다.

source: Enhanced: 2.1.0 Faster speed. Reimplemented as native-C.
de: Erweiterung: 2.1.0 Schnellere Geschwindigkeit. In nativem C neu implementiert.
ja: Enhanced: 2.1.0 速度向上しました。C言語で実装しなおしました。
ko_kr: 개선 사항: 2.1.0 버전에서 속도가 향상됐습니다. native-C로 재구현됐습니다.

source: Classic Explode a Table of LineStrings into nodes
de: Eine Tabelle von LineStrings auf klassische Art in Knoten zerlegen
ja: ラインストリングのテーブルのノードへの古典的な分割
ko_kr: 라인스트링 테이블을 노드로 분해하는 전형적인 예시

source: Standard Geometry Examples
de: Geometrische Standardbeispiele
ja: 標準的なジオメトリの例
ko_kr: 표준 도형 예시

source: -- Polyhedral surface cube -- SELECT (g.gdump).path, ST_AsEWKT((g.gdump).geom) as wkt FROM (SELECT ST_DumpPoints(ST_GeomFromEWKT('POLYHEDRALSURFACE( ((0 0 0, 0 0 1, 0 1 1, 0 1 0, 0 0 0)), ((0 0 0, 0 1 0, 1 1 0, 1 0 0, 0 0 0)), ((0 0 0, 1 0 0, 1 0 1, 0 0 1, 0 0 0)), ((1 1 0, 1 1 1, 1 0 1, 1 0 0, 1 1 0)), ((0 1 0, 0 1 1, 1 1 1, 1 1 0, 0 1 0)), ((0 0 1, 1 0 1, 1 1 1, 0 1 1, 0 0 1)) )') ) AS gdump ) AS g; -- result -- path | wkt ---------+-------------- {1,1,1} | POINT(0 0 0) {1,1,2} | POINT(0 0 1) {1,1,3} | POINT(0 1 1) {1,1,4} | POINT(0 1 0) {1,1,5} | POINT(0 0 0) {2,1,1} | POINT(0 0 0) {2,1,2} | POINT(0 1 0) {2,1,3} | POINT(1 1 0) {2,1,4} | POINT(1 0 0) {2,1,5} | POINT(0 0 0) {3,1,1} | POINT(0 0 0) {3,1,2} | POINT(1 0 0) {3,1,3} | POINT(1 0 1) {3,1,4} | POINT(0 0 1) {3,1,5} | POINT(0 0 0) {4,1,1} | POINT(1 1 0) {4,1,2} | POINT(1 1 1) {4,1,3} | POINT(1 0 1) {4,1,4} | POINT(1 0 0) {4,1,5} | POINT(1 1 0) {5,1,1} | POINT(0 1 0) {5,1,2} | POINT(0 1 1) {5,1,3} | POINT(1 1 1) {5,1,4} | POINT(1 1 0) {5,1,5} | POINT(0 1 0) {6,1,1} | POINT(0 0 1) {6,1,2} | POINT(1 0 1) {6,1,3} | POINT(1 1 1) {6,1,4} | POINT(0 1 1) {6,1,5} | POINT(0 0 1) (30 rows)
de: -- polyedrische Würfeloberfläche -- SELECT (g.gdump).path, ST_AsEWKT((g.gdump).geom) as wkt FROM (SELECT ST_DumpPoints(ST_GeomFromEWKT('POLYHEDRALSURFACE( ((0 0 0, 0 0 1, 0 1 1, 0 1 0, 0 0 0)), ((0 0 0, 0 1 0, 1 1 0, 1 0 0, 0 0 0)), ((0 0 0, 1 0 0, 1 0 1, 0 0 1, 0 0 0)), ((1 1 0, 1 1 1, 1 0 1, 1 0 0, 1 1 0)), ((0 1 0, 0 1 1, 1 1 1, 1 1 0, 0 1 0)), ((0 0 1, 1 0 1, 1 1 1, 0 1 1, 0 0 1)) )') ) AS gdump ) AS g; -- result -- path | wkt ---------+-------------- {1,1,1} | POINT(0 0 0) {1,1,2} | POINT(0 0 1) {1,1,3} | POINT(0 1 1) {1,1,4} | POINT(0 1 0) {1,1,5} | POINT(0 0 0) {2,1,1} | POINT(0 0 0) {2,1,2} | POINT(0 1 0) {2,1,3} | POINT(1 1 0) {2,1,4} | POINT(1 0 0) {2,1,5} | POINT(0 0 0) {3,1,1} | POINT(0 0 0) {3,1,2} | POINT(1 0 0) {3,1,3} | POINT(1 0 1) {3,1,4} | POINT(0 0 1) {3,1,5} | POINT(0 0 0) {4,1,1} | POINT(1 1 0) {4,1,2} | POINT(1 1 1) {4,1,3} | POINT(1 0 1) {4,1,4} | POINT(1 0 0) {4,1,5} | POINT(1 1 0) {5,1,1} | POINT(0 1 0) {5,1,2} | POINT(0 1 1) {5,1,3} | POINT(1 1 1) {5,1,4} | POINT(1 1 0) {5,1,5} | POINT(0 1 0) {6,1,1} | POINT(0 0 1) {6,1,2} | POINT(1 0 1) {6,1,3} | POINT(1 1 1) {6,1,4} | POINT(0 1 1) {6,1,5} | POINT(0 0 1) (30 rows)
ja: -- 多面体サーフェスの立方体-- SELECT (g.gdump).path, ST_AsEWKT((g.gdump).geom) as wkt FROM (SELECT ST_DumpPoints(ST_GeomFromEWKT('POLYHEDRALSURFACE( ((0 0 0, 0 0 1, 0 1 1, 0 1 0, 0 0 0)), ((0 0 0, 0 1 0, 1 1 0, 1 0 0, 0 0 0)), ((0 0 0, 1 0 0, 1 0 1, 0 0 1, 0 0 0)), ((1 1 0, 1 1 1, 1 0 1, 1 0 0, 1 1 0)), ((0 1 0, 0 1 1, 1 1 1, 1 1 0, 0 1 0)), ((0 0 1, 1 0 1, 1 1 1, 0 1 1, 0 0 1)) )') ) AS gdump ) AS g; -- 結果 -- path | wkt ---------+-------------- {1,1,1} | POINT(0 0 0) {1,1,2} | POINT(0 0 1) {1,1,3} | POINT(0 1 1) {1,1,4} | POINT(0 1 0) {1,1,5} | POINT(0 0 0) {2,1,1} | POINT(0 0 0) {2,1,2} | POINT(0 1 0) {2,1,3} | POINT(1 1 0) {2,1,4} | POINT(1 0 0) {2,1,5} | POINT(0 0 0) {3,1,1} | POINT(0 0 0) {3,1,2} | POINT(1 0 0) {3,1,3} | POINT(1 0 1) {3,1,4} | POINT(0 0 1) {3,1,5} | POINT(0 0 0) {4,1,1} | POINT(1 1 0) {4,1,2} | POINT(1 1 1) {4,1,3} | POINT(1 0 1) {4,1,4} | POINT(1 0 0) {4,1,5} | POINT(1 1 0) {5,1,1} | POINT(0 1 0) {5,1,2} | POINT(0 1 1) {5,1,3} | POINT(1 1 1) {5,1,4} | POINT(1 1 0) {5,1,5} | POINT(0 1 0) {6,1,1} | POINT(0 0 1) {6,1,2} | POINT(1 0 1) {6,1,3} | POINT(1 1 1) {6,1,4} | POINT(0 1 1) {6,1,5} | POINT(0 0 1) (30 rows)
ko_kr: -- 다면체 표면 정육면체 -- SELECT (g.gdump).path, ST_AsEWKT((g.gdump).geom) as wkt FROM (SELECT ST_DumpPoints(ST_GeomFromEWKT('POLYHEDRALSURFACE( ((0 0 0, 0 0 1, 0 1 1, 0 1 0, 0 0 0)), ((0 0 0, 0 1 0, 1 1 0, 1 0 0, 0 0 0)), ((0 0 0, 1 0 0, 1 0 1, 0 0 1, 0 0 0)), ((1 1 0, 1 1 1, 1 0 1, 1 0 0, 1 1 0)), ((0 1 0, 0 1 1, 1 1 1, 1 1 0, 0 1 0)), ((0 0 1, 1 0 1, 1 1 1, 0 1 1, 0 0 1)) )') ) AS gdump ) AS g; -- 결과 -- path | wkt ---------+-------------- {1,1,1} | POINT(0 0 0) {1,1,2} | POINT(0 0 1) {1,1,3} | POINT(0 1 1) {1,1,4} | POINT(0 1 0) {1,1,5} | POINT(0 0 0) {2,1,1} | POINT(0 0 0) {2,1,2} | POINT(0 1 0) {2,1,3} | POINT(1 1 0) {2,1,4} | POINT(1 0 0) {2,1,5} | POINT(0 0 0) {3,1,1} | POINT(0 0 0) {3,1,2} | POINT(1 0 0) {3,1,3} | POINT(1 0 1) {3,1,4} | POINT(0 0 1) {3,1,5} | POINT(0 0 0) {4,1,1} | POINT(1 1 0) {4,1,2} | POINT(1 1 1) {4,1,3} | POINT(1 0 1) {4,1,4} | POINT(1 0 0) {4,1,5} | POINT(1 1 0) {5,1,1} | POINT(0 1 0) {5,1,2} | POINT(0 1 1) {5,1,3} | POINT(1 1 1) {5,1,4} | POINT(1 1 0) {5,1,5} | POINT(0 1 0) {6,1,1} | POINT(0 0 1) {6,1,2} | POINT(1 0 1) {6,1,3} | POINT(1 1 1) {6,1,4} | POINT(0 1 1) {6,1,5} | POINT(0 0 1) (30 rows)

source: -- Triangle -- SELECT (g.gdump).path, ST_AsText((g.gdump).geom) as wkt FROM (SELECT ST_DumpPoints( ST_GeomFromEWKT('TRIANGLE (( 0 0, 0 9, 9 0, 0 0 ))') ) AS gdump ) AS g; -- result -- path | wkt ------+------------ {1} | POINT(0 0) {2} | POINT(0 9) {3} | POINT(9 0) {4} | POINT(0 0)
de: -- Dreieck -- SELECT (g.gdump).path, ST_AsText((g.gdump).geom) as wkt FROM (SELECT ST_DumpPoints( ST_GeomFromEWKT('TRIANGLE (( 0 0, 0 9, 9 0, 0 0 ))') ) AS gdump ) AS g; -- result -- path | wkt ------+------------ {1} | POINT(0 0) {2} | POINT(0 9) {3} | POINT(9 0) {4} | POINT(0 0)
ja: -- 三角形 -- SELECT (g.gdump).path, ST_AsText((g.gdump).geom) as wkt FROM (SELECT ST_DumpPoints( ST_GeomFromEWKT('TRIANGLE (( 0 0, 0 9, 9 0, 0 0 ))') ) AS gdump ) AS g; -- 結果 -- path | wkt ------+------------ {1} | POINT(0 0) {2} | POINT(0 9) {3} | POINT(9 0) {4} | POINT(0 0)
ko_kr: -- 삼각형 -- SELECT (g.gdump).path, ST_AsText((g.gdump).geom) as wkt FROM (SELECT ST_DumpPoints( ST_GeomFromEWKT('TRIANGLE (( 0 0, 0 9, 9 0, 0 0 ))') ) AS gdump ) AS g; -- 결과 -- path | wkt ------+------------ {1} | POINT(0 0) {2} | POINT(0 9) {3} | POINT(9 0) {4} | POINT(0 0)

source: -- TIN -- SELECT (g.gdump).path, ST_AsEWKT((g.gdump).geom) as wkt FROM (SELECT ST_DumpPoints( ST_GeomFromEWKT('TIN ((( 0 0 0, 0 0 1, 0 1 0, 0 0 0 )), (( 0 0 0, 0 1 0, 1 1 0, 0 0 0 )) )') ) AS gdump ) AS g; -- result -- path | wkt ---------+-------------- {1,1,1} | POINT(0 0 0) {1,1,2} | POINT(0 0 1) {1,1,3} | POINT(0 1 0) {1,1,4} | POINT(0 0 0) {2,1,1} | POINT(0 0 0) {2,1,2} | POINT(0 1 0) {2,1,3} | POINT(1 1 0) {2,1,4} | POINT(0 0 0) (8 rows)
ja: -- TIN -- SELECT (g.gdump).path, ST_AsEWKT((g.gdump).geom) as wkt FROM (SELECT ST_DumpPoints( ST_GeomFromEWKT('TIN ((( 0 0 0, 0 0 1, 0 1 0, 0 0 0 )), (( 0 0 0, 0 1 0, 1 1 0, 0 0 0 )) )') ) AS gdump ) AS g; -- 結果 -- path | wkt ---------+-------------- {1,1,1} | POINT(0 0 0) {1,1,2} | POINT(0 0 1) {1,1,3} | POINT(0 1 0) {1,1,4} | POINT(0 0 0) {2,1,1} | POINT(0 0 0) {2,1,2} | POINT(0 1 0) {2,1,3} | POINT(1 1 0) {2,1,4} | POINT(0 0 0) (8 rows)
ko_kr: -- TIN -- SELECT (g.gdump).path, ST_AsEWKT((g.gdump).geom) as wkt FROM (SELECT ST_DumpPoints( ST_GeomFromEWKT('TIN ((( 0 0 0, 0 0 1, 0 1 0, 0 0 0 )), (( 0 0 0, 0 1 0, 1 1 0, 0 0 0 )) )') ) AS gdump ) AS g; -- 결과 -- path | wkt ---------+-------------- {1,1,1} | POINT(0 0 0) {1,1,2} | POINT(0 0 1) {1,1,3} | POINT(0 1 0) {1,1,4} | POINT(0 0 0) {2,1,1} | POINT(0 0 0) {2,1,2} | POINT(0 1 0) {2,1,3} | POINT(1 1 0) {2,1,4} | POINT(0 0 0) (8 rows)

source: Returns a set of <varname>geometry_dump</varname> rows, representing the exterior and interior rings of a polygon.
de: Gibt eine Menge an <varname>geometry_dump</varname> Zeilen zurück, welche die äußeren und inneren Ringe eines Polygons darstellen.
ja: ポリゴンの外環と内環を表す<varname>geometry_dump</varname>行の集合を返します。
ko_kr: 폴리곤의 외곽 및 내곽 고리를 표현하는 <varname>geometry_dump</varname> 행들의 집합을 반환합니다.

source: This is a set-returning function (SRF). It returns a set of <varname>geometry_dump</varname> rows, defined as an <varname>integer[]</varname> and a <varname>geometry</varname>, aliased "path" and "geom" respectively. The "path" field holds the polygon ring index containing a single integer: 0 for the shell, >0 for holes. The "geom" field contains the corresponding ring as a polygon.
de: Dies ist eine Funktion mit Ergebnismenge (SRF). Sie gibt eine Menge an <varname>geometry_dump</varname> Zeilen zurück, die durch einen <varname>Integer[]</varname> und eine <varname>Geometrie</varname>, beziehungsweise durch die Aliasse "path" und "geom", definiert sind. Das Attribut "path" enthält den Index des Polygonringes als einzelne Ganzzahl: 0 für die Hülle, >0 für Lücken/Inseln. Das Attribut "geom" enthält den entsprechenden Ring als Polygon.
ja: これは集合を返す関数 (SRF=set-returning function)です。それぞれ"path", "geom"と別名が付けられた<varname>integer[]</varname>と<varname>geometry</varname>で定義さた<varname>geometry_dump</varname>行の集合を返します。"path"フィールドは、単一整数を持つ環のインデクスで、0が外環で、0より大きい値は内環です。"geom"フィールドは、対応する環をポリゴンで持ちます。
ko_kr: 집합 반환 함수(SRF)입니다. 각각 "path"와 "geom"이라는 변수명으로 불리는 <varname>integer[]</varname> 와 <varname>geometry</varname> 로 정의되는 <varname>geometry_dump</varname> 행들의 집합을 반환합니다. "path" 항목은 단일 정수를 담고 있는 폴리곤 고리 인덱스를 들고 있습니다. 외곽 고리일 경우 이 정수가 0, 구멍일 경우 양수가 됩니다. "geom" 항목은 각각 상응하는 고리를 폴리곤으로 담고 있습니다.

source: Availability: PostGIS 1.1.3. Requires PostgreSQL 7.3 or higher.
de: Verfügbarkeit: PostGIS 1.1.3. Benötigt PostgreSQL 7.3 oder höher.
ja: Availability: PostGIS 1.1.3 PostgreSQL 7.3以上が必要です。
ko_kr: PostGIS 1.1.3 버전부터 사용할 수 있습니다. PostgreSQL 7.3 이상 버전이 필요합니다.

source: This only works for POLYGON geometries. It will not work for MULTIPOLYGONS
de: Dies funktioniert nur mit POLYGON Geometrien und nicht mit MULTIPOLYGONS
ja: POLYGONジオメトリでのみ動作します。MULTIPOLYGONでは動作しません。
ko_kr: 이 함수는 폴리곤만 입력받을 수 있습니다. 멀티폴리곤은 입력받지 못 합니다.

source: Returns a version of the given geometry with X and Y axis flipped. Useful for people who have built latitude/longitude features and need to fix them.
de: Gibt eine Version der gegebenen Geometrie zurück, wobei die X und Y Achse vertauscht sind. Nützlich wenn man Geoobjekte in Breite/Länge vorliegen hat und dies beheben möchte.
ja: 与えられたジオメトリのX軸とY軸とを入れ替えたものを返します。緯度/経度のフィーチャーを構築して、これを訂正したい場合に使えます。
ko_kr: 입력 도형을 X축과 Y축을 뒤집은 상태로 반환합니다. 위도/경도 피처를 빌드해서 수정해야 하는 경우 유용합니다.

source: Returns a version of the given geometry with X and Y axis flipped.
de: Gibt eine Version der gegebenen Geometrie zurück, wobei die X und Y Achse vertauscht sind.
ja: 与えられたジオメトリのX軸とY軸とを入れ替えたものを返します。
ko_kr: 입력 도형을 X축과 Y축을 뒤집은 상태로 반환합니다.

source: Example
de: Beispiel
ja: 例
ko_kr: 예시
zh_hans: 示例

source: Converts a polygon or multi-polygon into a multi-point composed of randomly location points within the original areas.
de: Wandelt ein Polygon oder ein MultiPolygon in einen MultiPoint um, welcher aus wahllos angeordeten, innerhalb der ursprünglichen Flächen liegenden Punkten besteht.
ja: ポリゴンまたはマルチポリゴンから、元の領域の内部の、乱数で決められた位置に置かれた点からなるマルチポイントに変換します。
ko_kr: 폴리곤 또는 멀티폴리곤을 원본 면의 내부에 임의로 배치한 포인트들로 구성된 멀티포인트로 변환합니다.

source: ST_GeneratePoints generates pseudo-random points until the requested number are found within the input area.
de: ST_GeneratePoints erzeugt solange pseudomäßige Zufallspunkte, bis die angefragte Anzahl innerhalb der Eingabefläche gefunden wurde.
ja: ST_GeneratePointsは、指定された個数が入力領域内に出現するまで、擬似乱数による点を生成します。
ko_kr: ST_GeneratePoints 함수는 요청한 개수가 될 때까지 입력된 면 내부에 의사무작위(pseudo-random) 포인트를 생성합니다.

source: Original Polygon
de: Ursprüngliches Polygon
ja: 元のポリゴン
ko_kr: 원본 폴리곤

source: Generated 12 Points overlaid on top of original polygon
de: Ursprungspolygon mit 12 erzeugten Punkte überlagert
ja: 元のポリゴンの上に重ねた、生成された12個のポイント
ko_kr: 원본 폴리곤 위에 중첩한 포인트 12개를 생성

source: (T) Returns a geometry that represents the shared portion of geomA and geomB.
de: (T) Gibt eine Geometrie zurück, welche den gemeinsamen Anteil von geomA und geomB repräsentiert.
ja: (T) geomAとgeomBの共有する部分を表現するジオメトリを返します。
ko_kr: geomA와 geomB의 공유 부분을 표현하는 도형을 반환합니다.

source: Returns a geometry that represents the point set intersection of the Geometries.
de: Gibt eine Geometrie zurück, welche der mengentheoretischen Verschneidung der Geometrien entspricht.
ja: ジオメトリのインタセクションとなる点集合を表現するジオメトリを返します。
ko_kr: 도형들의 포인트 집합 교차 부분을 표현하는 도형을 반환합니다.

source: In other words - that portion of geometry A and geometry B that is shared between the two geometries.
de: Mit anderen Worten - jener Teil von der Geometrie A und der Geometrie B den sich die beiden Geometrien teilen.
ja: 言い換えると、ジオメトリAとジオメトリBとで共有されている部分のことです。
ko_kr: 다시 말해서, 도형 A와 도형 B가 공유하는 부분을 반환합니다.

source: If the geometries do not share any space (are disjoint), then an empty geometry collection is returned.
de: Wenn sich die Geometrien keinen gemeinsamen Raum teilen (sind getrennt), so wird eine leere GeometryCollection zurückgegeben.
ja: ジオメトリの共有部分が無い (非接触になる)場合には、空ジオメトリコレクションが返されます。
ko_kr: 도형들이 어떤 공간도 공유하지 않을 (분리돼 있을) 경우, 텅 빈 도형 집합을 반환합니다.

source: ST_Intersection in conjunction with ST_Intersects is very useful for clipping geometries such as in bounding box, buffer, region queries where you only want to return that portion of a geometry that sits in a country or region of interest.
de: ST_Intersection ist in Verbindung mit ST_Intersects zum Ausscchneiden von Geometrien sehr nützlich. Wie bei einem Umgebungsrechteck, einem Buffer, oder bei regionalen Abfragen, bei denen nur jener Teil der Geometrie zurückgegeben werden soll, der in einem bestimmten Staat oder einer bestimmten Interessensregion liegt.
ja: ST_IntersectionとST_Intersectsとの併用は、バウンディングボックス、バッファ、領域のクエリ等で、対象とする国または地域にあるジオメトリの部分の返ってほしいところを切り取るのに、非常に便利です。
ko_kr: ST_Intersection 함수를 ST_Intersects 함수와 결합하면, 관심 지역 또는 국가에 들어가는 도형의 일부분만 반환받고자 할 때 경계 상자, 버퍼, 지역 쿼리 내부와 같은 잘라내기(clipping) 도형을 생성하는 데 매우 유용합니다.

source: Geography: For geography this is really a thin wrapper around the geometry implementation. It first determines the best SRID that fits the bounding box of the 2 geography objects (if geography objects are within one half zone UTM but not same UTM will pick one of those) (favoring UTM or Lambert Azimuthal Equal Area (LAEA) north/south pole, and falling back on mercator in worst case scenario) and then intersection in that best fit planar spatial ref and retransforms back to WGS84 geography.
de: Geographie: Beim geographischen Datentyp handelt es sich lediglich um einen schlanken Adapter, der um die geometrische Implementation herumgelegt wurde. Zuerst wird die passenste SRID für das Umgebungsrechteck der beiden geographischen Objekte bestimmt (wenn die geographischen Objekte innerhalb eines UTM Überlappungsbereichs, aber nicht in derselben UTM Zone liegen, wird eine Zone herausgepickt) (bevorzugt UTM oder Lambert Azimuthal Equal Area (LAEA) Nord/Süd Pol, im schlimmsten Fall wird auf Mercator zurückgegriffen), dann im planaren Koordinatenreferenzsystem verschnitten und anschließend nach WGS84 Geographie zurück transformiert.
ja: ジオグラフィ: ジオメトリ実装にかぶさる、薄いラッパです。ジオグラフィオブジェクトのバウンディングボックスに最適なSRIDを決定し (UTMが望ましいですが、ランベルト正積方位図法 (北/南)、最悪のシナリオでメルカトルに頼ります)、その平面でバッファを生成し、WGS84ジオグラフィに戻します。
ko_kr: 지리형: 지리형에 대해, 이 함수는 도형 구현을 둘러싼 정말로 얇은 래퍼입니다. 이 함수는 먼저 (지리형 객체들이 절반의 UTM 구역 내부에 있지만 동일한 UTM이 어떤 도형도 선택하지 않을 경우) 두 지리형 객체들의 경계 상자에 가장 어울리는 SRID를 (UTM 또는 람베르트 북극/남극 방위정적도법(Lambert Azimuthal Equal Area)을 선호하며, 최악의 경우 메르카토르 도법에 의지해서) 결정한 다음 가장 어울리는 평면 공간 참조 시스템 상에서 교차시킨 다음 WGS84 지리형으로 다시 변환합니다.

source: Do not call with a <varname>GEOMETRYCOLLECTION</varname> as an argument
de: Bitte nicht mit einer <varname>GEOMETRYCOLLECTION</varname> als Parameter aufrufen
ja: <varname>GEOMETRYCOLLECTION</varname>を引数として呼ばないでください。
ko_kr: <varname>GEOMETRYCOLLECTION</varname> 을 인수로 호출하지 마십시오.

source: This function will drop the M coordinate values if present.
de: Diese Funktion löscht die Werte der M-Koordinate, falls vorhanden.
ja: この関数はM値が存在している場合には削除します。

source: If working with 3D geometries, you may want to use SFGCAL based <xref linkend="ST_3DIntersection"/> which does a proper 3D intersection for 3D geometries. Although this function works with Z-coordinate, it does an averaging of Z-Coordinate values when <code>postgis.backend=geos</code>. <code>postgis.backend=sfcgal</code>, it will return a 2D geometry regardless ignoring the Z-Coordinate. Refer to <xref linkend="postgis_backend"/> for details.
de: Wenn Sie mit 3D-Geometrie arbeiten kann es sinnvoll sein die SFGCAL basierte Funktion <xref linkend="ST_3DIntersection"/> zu verwenden, da diese eine korrekte 3D Verschneidung mit 3D Geometrie ausführt. Obwohl die Funktion mit der Z-Koordinate arbeitet, führt sie eine Mittelung der Z-Koordinatenwerte durch, wenn <code>postgis.backend=geos</code>. Auch wenn <code>postgis.backend=sfcgal</code> wird die Z-Koordinate ignoriert und eine 2D-Geometrie ausgegeben. Siehe <xref linkend="postgis_backend"/> für Details.
ja: 3次元ジオメトリで動作させるにはSFCGALベースの<xref linkend="ST_3DIntersection"/>を使います。3次元ジオメトリに適切な3次元インタセクションを生成します。この関数はZ軸を持っていても動作しますが、<code>postgis.backend=geos</code>の時はZ値の平均をとります。<code>postgis.backend=sfcgal</code>とすると、Z軸を無視して2次元ジオメトリを返します。詳細については<xref linkend="postgis_backend"/>を参照してください。
ko_kr: 3차원 도형을 작업할 경우, 3차원 도형에 대해 제대로 된 3차원 교차 작업을 하는 SFCGAL 기반 <xref linkend="ST_3DIntersection"/> 을 이용하는 편이 좋을 수도 있습니다. 비록 이 함수가 Z 좌표를 처리하기는 하지만, <code>postgis.backend=geos</code> 로 설정했을 때 Z 좌표값의 평균을 냅니다. <code>postgis.backend=sfcgal</code> 로 설정하면, Z 좌표에 상관없이 2차원 도형을 반환할 것입니다. 자세한 내용은 <xref linkend="postgis_backend"/> 를 참조하십시오.

source: Availability: 1.5 support for geography data type was introduced.
de: Verfügbarkeit: 1.5 die Unterstützung des geograpischen Datentyps wurde eingeführt
ja: Availability: 1.5 ジオグラフィ型が導入されました。
ko_kr: 1.5 버전부터 지리형 데이터형을 지원합니다.
