Repository: postgis/postgis
Catalog: doc/po/*/reference_processing.xml.po
Languages: de, ja, ko_kr, zh_hans

source: Output type can be a MULTI*, single geometry, or Geometry Collection. Comes in 2 variants. Variant 1 unions 2 geometries resulting in a new geometry with no intersecting regions. Variant 2 is an aggregate function that takes a set of geometries and unions them into a single ST_Geometry resulting in no intersecting regions.
de: Der Ausgabetyp kann eine MULTI*/Mehrfach-, eine Einzel- oder eine Sammelgeometrie sein. Hat 2 Varianten. Variante 1 vereinigt 2 Geometrien zu einer neuen Geometrie, welche keine überschneidenden Bereiche mehr aufweist. Variante 2 ist eine Aggregatfunktion, die eine Geometriemenge entgegennimmt und diese zu einer einzelnen ST_Geometry vereinigt, welche ebenfalls keine überschneidenden Bereiche mehr aufweist.
ja: MULTI系、単一ジオメトリ、ジオメトリコレクションのいずれでも出力されます。二つの形式があります。一つ目は、二つのジオメトリを結合して、インタセクトしている領域の無い新しいジオメトリを返します。二つ目は、ジオメトリの集合を結合して、インタセクトしている領域の無い単一のST_Geometryを返すものです。
ko_kr: 멀티 도형, 단일 도형 또는 도형 집합을 출력할 수 있습니다. 두 가지 변종이 존재합니다. 변종 1은 도형 2개를 통합해서 교차 지역이 없는 새 도형을 출력합니다. 변종 2는 도형들의 집합을 입력받아 교차 지역이 없는 단일 ST_Geometry로 통합하는 종합 함수입니다.

source: Aggregate version: This function returns a MULTI geometry or NON-MULTI geometry from a set of geometries. The ST_Union() function is an "aggregate" function in the terminology of PostgreSQL. That means that it operates on rows of data, in the same way the SUM() and AVG() functions do and like most aggregates, it also ignores NULL geometries.
de: Aggregat Version:: Diese Funktion gibt eine Mehrfachgeometrie oder eine Einzelgeometrie von einem Satz an Geometrien zurück. Die Funktion ST_Union() ist in der Terminologie von PostgreSQL eine Aggregatfunktion. Dies bedeutet, dass sie so wie die SUM() und AVG() Funktionen und so wie die meisten Aggregatfunktionen mit Datenzeilen arbeitet. Eine NULL-Geometrie wird ignoriert.
ja: 集約関数版: この関数は、ジオメトリの集合から、MULTI系ジオメトリまたは非MULTI系ジオメトリを返します。ST_Union()関数は、PostgreSQL用語で言うところの「集約関数」です。SUM()やMEAN()と同じ方法でデータリストの操作を行い、NULLジオメトリを無視することを意味します。
ko_kr: 종합 버전: 이 함수는 도형들의 집합으로부터 멀티 또는 멀티가 아닌 도형을 반환합니다. ST_Union() 함수는 PostgreSQL 전문 용어로 "종합(aggregate)" 함수입니다. 즉 SUM() 및 AVG() 함수와 마찬가지로 데이터 행들을 대상으로 연산한다는 뜻입니다. 또 대부분의 종합 함수와 마찬가지로, NULL 도형을 무시합니다.

source: Non-Aggregate version: This function returns a geometry being a union of two input geometries. Output type can be a MULTI*, NON-MULTI or GEOMETRYCOLLECTION. If any are NULL, then NULL is returned.
de: Nicht-Aggregat Version: Diese Funktion gibt eine Geometrie zurück, die eine Vereinigung von zwei Eingabegeometrien darstellt. Der Ausgabetyp kann eine MULTI*, NON-MULTI oder eine GEOMETRYCOLLECTION sein. Wenn eine der beiden Geometrien NULL ist, so wird NULL zurückgegeben.
ja: 非集約関数版: この関数は二つの入力ジオメトリの結合したジオメトリを返します。出力型はMULTI系、非MULTI系またはGEOMETRYCOLLECTIONです。入力が全てNULLならNULLを返します。
ko_kr: 비(非)종합 버전: 이 함수는 입력 도형 2개를 통합한 도형을 반환합니다. 멀티 도형, 멀티가 아닌 도형 또는 도형 집합 유형을 출력할 수 있습니다. 입력 도형 가운데 NULL 도형이 있을 경우, NULL 도형을 반환합니다.

source: ST_Collect and ST_Union are often interchangeable. ST_Union is in general orders of magnitude slower than ST_Collect because it tries to dissolve boundaries and reorder geometries to ensure that a constructed Multi* doesn't have intersecting regions.
de: ST_Collect und ST_Union sind oftmals untereinander austauschbar. ST_Union ist im Allgemeinen um Größenordnungen langsamer als ST_Collect, da es versucht die Grenzen aufzulösen und die Geometrie neu zu sortieren um sicherzustellen, dass eine erzeugte MULTI* keine überschneidenden Bereiche aufweist.
ja: ST_CollectとST_Unionはしばしば交換して使うことができます。ST_Unionは境界を更新し、生成されるMULTI系ジオメトリがインタセクトした領域を持たないようにするため、一般的にST_Collectよりも桁違いに遅く動きます。
ko_kr: 종종 ST_Union와 ST_Collect를 서로 바꿔 사용할 수 있습니다. 일반적인 자릿수의 경우 ST_Union이 ST_Collect보다 더 느린데, ST_Union이 작성된 멀티 도형에 교차하는 부분이 없는 것을 입증하려고 도형들을 재정렬하고 경계선을 없애려 하기 때문입니다.

source: NOTE: this function was formerly called GeomUnion(), which was renamed from "Union" because UNION is an SQL reserved word.
de: Anmerkung: diese Funktion wurde früher GeomUnion() genannt und wurde von "Union" umbenannt, da UNION ein reserviertes SQL-Wort ist.
ja: ご注意: この関数は以前は、"Union"から名称変更してGeomUnion()と呼ばれていました。UNIONはSQLの予約語であるためです。
ko_kr: 주의: 이 함수는 이전에 GeomUnion()이라는 명칭이었는데, UNION이 SQL이 보유한 용어이기 때문에 "Union"으로 재명명됐습니다.

source: Availability: 1.4.0 - ST_Union was enhanced. ST_Union(geomarray) was introduced and also faster aggregate collection in PostgreSQL. If you are using GEOS 3.1.0+ ST_Union will use the faster Cascaded Union algorithm described in <ulink url="http://blog.cleverelephant.ca/2009/01/must-faster-unions-in-postgis-14.html">http://blog.cleverelephant.ca/2009/01/must-faster-unions-in-postgis-14.html</ulink>
de: Verfügbarkeit: 1.4.0 - ST_Union wurde erweitert. ST_Union(geomarray) wurde eingeführt und ebenso wurde die Aggragatfunktion in PostgreSQL schneller gemacht. Wenn Sie GEOS 3.1.0+ verwenden, so verwendet ST_Union den schnelleren, kaskadierenden Algorithmus für die Vereinigung. Letzterer ist unter <ulink url="http://blog.cleverelephant.ca/2009/01/must-faster-unions-in-postgis-14.html">http://blog.cleverelephant.ca/2009/01/must-faster-unions-in-postgis-14.html</ulink> beschrieben
ja: Availability: 1.4.0 - ST_Unionが強化されました。ST_Union(geomarray)が導入され、また、PostgreSQL内での集計が速くなりました。GEOS 3.1.0以上を使用している場合は、ST_Unionは、<ulink url="http://blog.cleverelephant.ca/2009/01/must-faster-unions-in-postgis-14.html">http://blog.cleverelephant.ca/2009/01/must-faster-unions-in-postgis-14.html</ulink>に記述がある、Cascaded Unionアルゴリズムを使います。
ko_kr: 1.4.0 버전부터 사용할 수 있습니다. ST_Union 함수가 개선됐습니다. 도형 배열 유형을 지원하기 시작했고, PostgreSQL에서 집합을 더 빨리 종합할 수 있게 됐습니다. GEOS 3.1.0 이상 버전을 사용하고 있다면 ST_Union 함수가 <ulink url="http://blog.cleverelephant.ca/2009/01/must-faster-unions-in-postgis-14.html">http://blog.cleverelephant.ca/2009/01/must-faster-unions-in-postgis-14.html</ulink> 에 설명돼 있는 더 빠른 종속 통합(Cascaded Union) 알고리즘을 이용할 것입니다.

source: Aggregate version is not explicitly defined in OGC SPEC.
de: Die Aggregatversion ist in der OGC SPEC nicht ausdrücklich definiert.
ja: 集約関数版は、OGC仕様に明示的に定義されていません。
ko_kr: 종합 버전은 OGC 사양서에 명확하게 정의돼 있지 않습니다.

source: &sqlmm_compliant; SQL-MM 3: 5.1.19 the z-index (elevation) when polygons are involved.
de: &sqlmm_compliant; SQL-MM 3: 5.1.19 der Z-Index (Höhe) wenn Polygone beteiligt sind.
ja: &sqlmm_compliant; SQL-MM 3: 5.1.19 ポリゴンが含まれる時、Z値 (標高)を持ちます。
ko_kr: &sqlmm_compliant; SQL-MM 3: 5.1.19 폴리곤이 연관된 경우 Z-인덱스(고도)

source: SELECT ST_AsText(ST_Union(ST_GeomFromText('POINT(1 2)'), ST_GeomFromText('POINT(-2 3)') ) ) st_astext ---------- MULTIPOINT(-2 3,1 2) SELECT ST_AsText(ST_Union(ST_GeomFromText('POINT(1 2)'), ST_GeomFromText('POINT(1 2)') ) ); st_astext ---------- POINT(1 2) --3d example - sort of supports 3d (and with mixed dimensions!) SELECT ST_AsEWKT(st_union(the_geom)) FROM (SELECT ST_GeomFromEWKT('POLYGON((-7 4.2,-7.1 4.2,-7.1 4.3, -7 4.2))') as the_geom UNION ALL SELECT ST_GeomFromEWKT('POINT(5 5 5)') as the_geom UNION ALL SELECT ST_GeomFromEWKT('POINT(-2 3 1)') as the_geom UNION ALL SELECT ST_GeomFromEWKT('LINESTRING(5 5 5, 10 10 10)') as the_geom ) as foo; st_asewkt --------- GEOMETRYCOLLECTION(POINT(-2 3 1),LINESTRING(5 5 5,10 10 10),POLYGON((-7 4.2 5,-7.1 4.2 5,-7.1 4.3 5,-7 4.2 5))); --3d example not mixing dimensions SELECT ST_AsEWKT(st_union(the_geom)) FROM (SELECT ST_GeomFromEWKT('POLYGON((-7 4.2 2,-7.1 4.2 3,-7.1 4.3 2, -7 4.2 2))') as the_geom UNION ALL SELECT ST_GeomFromEWKT('POINT(5 5 5)') as the_geom UNION ALL SELECT ST_GeomFromEWKT('POINT(-2 3 1)') as the_geom UNION ALL SELECT ST_GeomFromEWKT('LINESTRING(5 5 5, 10 10 10)') as the_geom ) as foo; st_asewkt --------- GEOMETRYCOLLECTION(POINT(-2 3 1),LINESTRING(5 5 5,10 10 10),POLYGON((-7 4.2 2,-7.1 4.2 3,-7.1 4.3 2,-7 4.2 2))) --Examples using new Array construct SELECT ST_Union(ARRAY(SELECT the_geom FROM sometable)); SELECT ST_AsText(ST_Union(ARRAY[ST_GeomFromText('LINESTRING(1 2, 3 4)'), ST_GeomFromText('LINESTRING(3 4, 4 5)')])) As wktunion; --wktunion--- MULTILINESTRING((3 4,4 5),(1 2,3 4))
de: SELECT ST_AsText(ST_Union(ST_GeomFromText('POINT(1 2)'), ST_GeomFromText('POINT(-2 3)') ) ) st_astext ---------- MULTIPOINT(-2 3,1 2) SELECT ST_AsText(ST_Union(ST_GeomFromText('POINT(1 2)'), ST_GeomFromText('POINT(1 2)') ) ); st_astext ---------- POINT(1 2) --3D-Beispiel - Eine Art 3D-Unterstützung (mit gemischten Dimensionen!) SELECT ST_AsEWKT(st_union(the_geom)) FROM (SELECT ST_GeomFromEWKT('POLYGON((-7 4.2,-7.1 4.2,-7.1 4.3, -7 4.2))') as the_geom UNION ALL SELECT ST_GeomFromEWKT('POINT(5 5 5)') as the_geom UNION ALL SELECT ST_GeomFromEWKT('POINT(-2 3 1)') as the_geom UNION ALL SELECT ST_GeomFromEWKT('LINESTRING(5 5 5, 10 10 10)') as the_geom ) as foo; st_asewkt --------- GEOMETRYCOLLECTION(POINT(-2 3 1),LINESTRING(5 5 5,10 10 10),POLYGON((-7 4.2 5,-7.1 4.2 5,-7.1 4.3 5,-7 4.2 5))); --3D-Beispiel ohne gemischte Dimensionen SELECT ST_AsEWKT(st_union(the_geom)) FROM (SELECT ST_GeomFromEWKT('POLYGON((-7 4.2 2,-7.1 4.2 3,-7.1 4.3 2, -7 4.2 2))') as the_geom UNION ALL SELECT ST_GeomFromEWKT('POINT(5 5 5)') as the_geom UNION ALL SELECT ST_GeomFromEWKT('POINT(-2 3 1)') as the_geom UNION ALL SELECT ST_GeomFromEWKT('LINESTRING(5 5 5, 10 10 10)') as the_geom ) as foo; st_asewkt --------- GEOMETRYCOLLECTION(POINT(-2 3 1),LINESTRING(5 5 5,10 10 10),POLYGON((-7 4.2 2,-7.1 4.2 3,-7.1 4.3 2,-7 4.2 2))) --Beispiele mit dem neuen Feld/Array Konstrukt SELECT ST_Union(ARRAY(SELECT the_geom FROM sometable)); SELECT ST_AsText(ST_Union(ARRAY[ST_GeomFromText('LINESTRING(1 2, 3 4)'), ST_GeomFromText('LINESTRING(3 4, 4 5)')])) As wktunion; --wktunion--- MULTILINESTRING((3 4,4 5),(1 2,3 4))
ja: SELECT ST_AsText(ST_Union(ST_GeomFromText('POINT(1 2)'), ST_GeomFromText('POINT(-2 3)') ) ) st_astext ---------- MULTIPOINT(-2 3,1 2) SELECT ST_AsText(ST_Union(ST_GeomFromText('POINT(1 2)'), ST_GeomFromText('POINT(1 2)') ) ); st_astext ---------- POINT(1 2) -- 3次元の例 - 対応する3次元 (次元の混合があります!)の一覧 SELECT ST_AsEWKT(st_union(the_geom)) FROM (SELECT ST_GeomFromEWKT('POLYGON((-7 4.2,-7.1 4.2,-7.1 4.3, -7 4.2))') as the_geom UNION ALL SELECT ST_GeomFromEWKT('POINT(5 5 5)') as the_geom UNION ALL SELECT ST_GeomFromEWKT('POINT(-2 3 1)') as the_geom UNION ALL SELECT ST_GeomFromEWKT('LINESTRING(5 5 5, 10 10 10)') as the_geom ) as foo; st_asewkt --------- GEOMETRYCOLLECTION(POINT(-2 3 1),LINESTRING(5 5 5,10 10 10),POLYGON((-7 4.2 5,-7.1 4.2 5,-7.1 4.3 5,-7 4.2 5))); -- 3次元で次元の混合がない例 SELECT ST_AsEWKT(st_union(the_geom)) FROM (SELECT ST_GeomFromEWKT('POLYGON((-7 4.2 2,-7.1 4.2 3,-7.1 4.3 2, -7 4.2 2))') as the_geom UNION ALL SELECT ST_GeomFromEWKT('POINT(5 5 5)') as the_geom UNION ALL SELECT ST_GeomFromEWKT('POINT(-2 3 1)') as the_geom UNION ALL SELECT ST_GeomFromEWKT('LINESTRING(5 5 5, 10 10 10)') as the_geom ) as foo; st_asewkt --------- GEOMETRYCOLLECTION(POINT(-2 3 1),LINESTRING(5 5 5,10 10 10),POLYGON((-7 4.2 2,-7.1 4.2 3,-7.1 4.3 2,-7 4.2 2))) -- 新しい配列構築を用いた例 SELECT ST_Union(ARRAY(SELECT the_geom FROM sometable)); SELECT ST_AsText(ST_Union(ARRAY[ST_GeomFromText('LINESTRING(1 2, 3 4)'), ST_GeomFromText('LINESTRING(3 4, 4 5)')])) As wktunion; --wktunion--- MULTILINESTRING((3 4,4 5),(1 2,3 4))
ko_kr: SELECT ST_AsText(ST_Union(ST_GeomFromText('POINT(1 2)'), ST_GeomFromText('POINT(-2 3)') ) ) st_astext ---------- MULTIPOINT(-2 3,1 2) SELECT ST_AsText(ST_Union(ST_GeomFromText('POINT(1 2)'), ST_GeomFromText('POINT(1 2)') ) ); st_astext ---------- POINT(1 2) -- 3D 예시: 3D를 (혼합 차원도!) 지원하는 편입니다. SELECT ST_AsEWKT(st_union(the_geom)) FROM (SELECT ST_GeomFromEWKT('POLYGON((-7 4.2,-7.1 4.2,-7.1 4.3, -7 4.2))') as the_geom UNION ALL SELECT ST_GeomFromEWKT('POINT(5 5 5)') as the_geom UNION ALL SELECT ST_GeomFromEWKT('POINT(-2 3 1)') as the_geom UNION ALL SELECT ST_GeomFromEWKT('LINESTRING(5 5 5, 10 10 10)') as the_geom ) as foo; st_asewkt --------- GEOMETRYCOLLECTION(POINT(-2 3 1),LINESTRING(5 5 5,10 10 10),POLYGON((-7 4.2 5,-7.1 4.2 5,-7.1 4.3 5,-7 4.2 5))); -- 3D 예시: 혼합 차원 아님 SELECT ST_AsEWKT(st_union(the_geom)) FROM (SELECT ST_GeomFromEWKT('POLYGON((-7 4.2 2,-7.1 4.2 3,-7.1 4.3 2, -7 4.2 2))') as the_geom UNION ALL SELECT ST_GeomFromEWKT('POINT(5 5 5)') as the_geom UNION ALL SELECT ST_GeomFromEWKT('POINT(-2 3 1)') as the_geom UNION ALL SELECT ST_GeomFromEWKT('LINESTRING(5 5 5, 10 10 10)') as the_geom ) as foo; st_asewkt --------- GEOMETRYCOLLECTION(POINT(-2 3 1),LINESTRING(5 5 5,10 10 10),POLYGON((-7 4.2 2,-7.1 4.2 3,-7.1 4.3 2,-7 4.2 2))) -- 새로운 배열 구조를 이용한 예시 SELECT ST_Union(ARRAY(SELECT the_geom FROM sometable)); SELECT ST_AsText(ST_Union(ARRAY[ST_GeomFromText('LINESTRING(1 2, 3 4)'), ST_GeomFromText('LINESTRING(3 4, 4 5)')])) As wktunion; --wktunion--- MULTILINESTRING((3 4,4 5),(1 2,3 4))

source: Like ST_Union, but working at the geometry component level.
de: Wie ST_Union, arbeitet aber auf der Ebene der Geometriebestandteile.
ja: ST_Unionに似ていますが、ジオメトリ要素レベルで動作します。
ko_kr: ST_Union과 비슷하지만, 도형 구성 요소 레벨에서 동작합니다.

source: Unlike ST_Union, ST_UnaryUnion does dissolve boundaries between components of a multipolygon (invalid) and does perform union between the components of a geometrycollection. Each components of the input geometry is assumed to be valid, so you won't get a valid multipolygon out of a bow-tie polygon (invalid).
de: Anders als ST_union löst ST_UnaryUnion die Grenzen zwischen den Bestandteilen des Mehrfachpolygons (invalid) auf und führt eine Vereinigung der Komponenten einer Sammelgeometrie durch. Alle Bestandteile der Eingabegeometrie werden als valide angenommen, sodass Sie kein valides Mehrfachpolygon von einem invaliden, sich selbst überschneidenden Polygon erhalten können.
ja: ST_UnaryUnionは、ST_Unionと違い、マルチポリゴンの要素間の境界更新を行い、ジオメトリコレクションの要素間の結合を行います。入力ジオメトリの要素は、それぞれ妥当であると仮定しているので、蝶ネクタイポリゴン (不正なポリゴンです)から妥当なマルチポリゴンを得ることはできません。
ko_kr: ST_Union과는 달리, ST_UnaryUnion은 (유효하지 않은) 멀티폴리곤의 구성 요소들 사이의 경계선을 없애지 않고 도형 집합의 구성 요소들 사이에서 통합 작업을 수행합니다. 입력 도형의 각 구성 요소를 유효하다고 가정하기 때문에, (유효하지 않은) 나비 넥타이 모양의 폴리곤으로부터 유효한 멀티폴리곤을 얻을 수는 없을 겁니다.

source: You may use this function to node a set of linestrings. You may mix ST_UnaryUnion with ST_Collect to fine-tune how many geometries at once you want to dissolve to be nice on both memory size and CPU time, finding the balance between ST_Union and ST_MemUnion.
de: Diese Funktion kann für Knotenberechnungen an einer Menge von Linienzügen verwendet werden. Sie können ST_UnaryUnion und ST_Collect mischen, um die Anzahl der Geometrien, bei denen die Grenzen auf einmal aufgelöst werden abzustimmen. Auf diese Weise kann eine Balance zwischen ST_Union und ST_MemUnion gefunden werden, die sowohl den Arbeitsspeicher als auch die CPU-Zeit schont.
ja: この関数はラインストリングの集合にノードを作成するのに使えます。ST_UnaryUnionとST_Collectを混ぜて、ST_UnionとST_MemUnionの釣り合いを見つけて、メモリサイズとCPU時間の両方について適切になるように、一度に結合したいジオメトリ数を微調整することができます。
ko_kr: 라인스트링들의 집합에 노드를 적용하는 데 이 함수를 쓸 수도 있습니다. ST_UnaryUnion을 ST_Collect와 결합해서, ST_Union과 ST_MemUnion 사이의 균형을 맞춰서 메모리 용량 및 CPU 시간 양쪽 모두 만족시키며 한꺼번에 얼마나 많은 도형을 통합할지 상세하게 조정할 수도 있습니다.

source: Returns the boundaries between the cells of the Voronoi diagram constructed from the vertices of a geometry.
de: Gibt die Grenzen zwischen den Zellen des Voronoi Diagramms aus, das aus den Knoten der Geometrie konstruiert wurde.
ja: ジオメトリの頂点からボロノイ図のセル間の境界を返します。

source: ST_VoronoiLines computes a two-dimensional <ulink url="https://en.wikipedia.org/wiki/Voronoi_diagram">Voronoi diagram</ulink> from the vertices of the supplied geometry and returns the boundaries between cells in that diagram as a MultiLineString.
de: ST_VoronoiLines berechnet ein zweidimensonales <ulink url="https://en.wikipedia.org/wiki/Voronoi_diagram">Voronoi Diagramm</ulink> aus den Knoten der gegebenen Geometrie und stellt die Grenzen zwischen den Zellen des Diagramms als MultiLineString dar.
ja: ST_VoronoiLines は、与えられたジオメトリの頂点から、2次元<ulink url="https://ja.wikipedia.org/wiki/%E3%83%9C%E3%83%AD%E3%83%8E%E3%82%A4%E5%9B%B3">ボロノイ図</ulink>を計算します。図の細胞間の境界をMULTILINESTRINGで返します。

source: Optional parameters:
de: Optionale Parameter:
ja: 任意パラメータ:
ko_kr: 선택할 수 있는 파라미터:
zh_hans: 可选参数：

source: 'tolerance' : The distance within which vertices will be considered equivalent. Robustness of the algorithm can be improved by supplying a nonzero tolerance distance. (default = 0.0)
de: 'tolerance' : Die Entfernung innerhalb derer Knoten als ident betrachtet werden. Die Robustheit des Algorithmus kann verbessert werden, wenn die Entfernungstoleranz nicht mit Null angegeben wird. (Standardwert = 0.0)
ja: 'tolerance' : この距離以内の点は等価とします。0でない許容距離を指定することで、アルゴリズムのロバスト性が改善します。デフォルトは0.0です。
ko_kr: 'tolerance' : 그보다 가까운 꼭짓점들을 동일하다고 간주할 허용 오차 거리입니다. 0이 아닌 허용 오차 거리를 설정하면 알고리즘의 강력함을 향상시킬 수 있습니다. (기본값 = 0.0)

source: 'extend_to' : If a geometry is supplied as the "extend_to" parameter, the diagram will be extended to cover the envelope of the "extend_to" geometry, unless that envelope is smaller than the default envelope. (default = NULL)
de: 'extend_to' : Wird eine Geometrie als "extend_to" Parameter zur Verfügung gestellt, so wird das Diagramm erweitert, um die Einhüllende der "extend_to"-Geometrie zu erfassen. Dies geschieht solange die Einhüllende nicht kleiner als die Standardeinhüllende ist. (Standardwert = NULL)
ja: 'extend_to': ジオメトリが"extend_to"パラメータとして渡された場合には、ボロノイ図は"extend_to"ジオメトリのエンベロープを覆う範囲になります。

source: Availability: 2.3.0 - requires GEOS &gt;= 3.5.0.
de: Verfügbarkeit: 2.3.0 - benötigt GEOS &gt;= 3.5.0.
ja: Availability: 2.3.0 - GEOS 3.5.0以上が必要です。
ko_kr: 2.3.0 버전부터 사용할 수 있습니다. GEOS 3.5.0 이상 버전이 필요합니다.

source: Voronoi lines with tolerance of 30 units
de: Voronoi Linien mit einer Toleranz von 30 Einheiten
ja: 許容範囲を30単位としたボロノイ図

source: -- ST_AsText output MULTILINESTRING((135.555555555556 270,36.8181818181818 92.2727272727273),(36.8181818181818 92.2727272727273,-110 43.3333333333333),(230 -45.7142857142858,36.8181818181818 92.2727272727273))
ja: -- ST_AsText 出力 MULTILINESTRING((135.555555555556 270,36.8181818181818 92.2727272727273),(36.8181818181818 92.2727272727273,-110 43.3333333333333),(230 -45.7142857142858,36.8181818181818 92.2727272727273))
ko_kr: -- ST_AsText 출력물 MULTILINESTRING((135.555555555556 270,36.8181818181818 92.2727272727273),(36.8181818181818 92.2727272727273,-110 43.3333333333333),(230 -45.7142857142858,36.8181818181818 92.2727272727273))

source: Returns the cells of the Voronoi diagram constructed from the vertices of a geometry.
de: Gibt die Zellen des Voronoi Diagramms zurück, die aus den Knoten der Geometrie erzeugt wurden.
ja: ジオメトリの頂点からボロノイ図のセルを返します。

source: ST_VoronoiPolygons computes a two-dimensional <ulink url="https://en.wikipedia.org/wiki/Voronoi_diagram">Voronoi diagram</ulink> from the vertices of the supplied geometry. The result is a GeometryCollection of Polygons that covers an envelope larger than the extent of the input vertices.
de: ST_VoronoiPolygons berechnet ein zweidimensionales <ulink url="https://en.wikipedia.org/wiki/Voronoi_diagram">Voronoi diagram</ulink> aus den Knoten der gegebenen Geometrie. Das Ergebnis ist eine Sammelgeometrie/GeometryCollection von Polygonen, deren Einhüllende größer ist als die Ausdehnung der Ausgangsknoten.
ja: ST_VoronoiPolygonsは、与えられたジオメトリの頂点から、2次元<ulink url="https://ja.wikipedia.org/wiki/%E3%83%9C%E3%83%AD%E3%83%8E%E3%82%A4%E5%9B%B3">ボロノイ図</ulink>を計算します。結果は、入力頂点の範囲より大きいエンベロープを覆うポリゴンのジオメトリコレクションです。

source: -- ST_AsText output GEOMETRYCOLLECTION(POLYGON((-110 43.3333333333333,-110 270,100.5 270,59.3478260869565 132.826086956522,36.8181818181818 92.2727272727273,-110 43.3333333333333)), POLYGON((55 -90,-110 -90,-110 43.3333333333333,36.8181818181818 92.2727272727273,55 79.2857142857143,55 -90)), POLYGON((230 47.5,230 -20.7142857142857,55 79.2857142857143,36.8181818181818 92.2727272727273,59.3478260869565 132.826086956522,230 47.5)),POLYGON((230 -20.7142857142857,230 -90,55 -90,55 79.2857142857143,230 -20.7142857142857)), POLYGON((100.5 270,230 270,230 47.5,59.3478260869565 132.826086956522,100.5 270)))
de: -- Ausgabe mit ST_AsText GEOMETRYCOLLECTION(POLYGON((-110 43.3333333333333,-110 270,100.5 270,59.3478260869565 132.826086956522,36.8181818181818 92.2727272727273,-110 43.3333333333333)), POLYGON((55 -90,-110 -90,-110 43.3333333333333,36.8181818181818 92.2727272727273,55 79.2857142857143,55 -90)), POLYGON((230 47.5,230 -20.7142857142857,55 79.2857142857143,36.8181818181818 92.2727272727273,59.3478260869565 132.826086956522,230 47.5)),POLYGON((230 -20.7142857142857,230 -90,55 -90,55 79.2857142857143,230 -20.7142857142857)), POLYGON((100.5 270,230 270,230 47.5,59.3478260869565 132.826086956522,100.5 270)))
ja: -- ST_AsText 出力 -- GEOMETRYCOLLECTION(POLYGON((-110 43.3333333333333,-110 270,100.5 270,59.3478260869565 132.826086956522,36.8181818181818 92.2727272727273,-110 43.3333333333333)), POLYGON((55 -90,-110 -90,-110 43.3333333333333,36.8181818181818 92.2727272727273,55 79.2857142857143,55 -90)), POLYGON((230 47.5,230 -20.7142857142857,55 79.2857142857143,36.8181818181818 92.2727272727273,59.3478260869565 132.826086956522,230 47.5)),POLYGON((230 -20.7142857142857,230 -90,55 -90,55 79.2857142857143,230 -20.7142857142857)), POLYGON((100.5 270,230 270,230 47.5,59.3478260869565 132.826086956522,100.5 270)))
ko_kr: -- ST_AsText 출력물 GEOMETRYCOLLECTION(POLYGON((-110 43.3333333333333,-110 270,100.5 270,59.3478260869565 132.826086956522,36.8181818181818 92.2727272727273,-110 43.3333333333333)), POLYGON((55 -90,-110 -90,-110 43.3333333333333,36.8181818181818 92.2727272727273,55 79.2857142857143,55 -90)), POLYGON((230 47.5,230 -20.7142857142857,55 79.2857142857143,36.8181818181818 92.2727272727273,59.3478260869565 132.826086956522,230 47.5)),POLYGON((230 -20.7142857142857,230 -90,55 -90,55 79.2857142857143,230 -20.7142857142857)), POLYGON((100.5 270,230 270,230 47.5,59.3478260869565 132.826086956522,100.5 270)))

source: Voronoi with tolerance of 30 units
de: Voronoi mit einer Toleranz von 30 Einheiten
ja: 許容範囲を30単位としたボロノイ図
ko_kr: 허용 오차 거리가 30 단위인 보로노이 다이어그램

source: -- ST_AsText output GEOMETRYCOLLECTION(POLYGON((-110 43.3333333333333,-110 270,100.5 270,59.3478260869565 132.826086956522,36.8181818181818 92.2727272727273,-110 43.3333333333333)), POLYGON((230 47.5,230 -45.7142857142858,36.8181818181818 92.2727272727273,59.3478260869565 132.826086956522,230 47.5)),POLYGON((230 -45.7142857142858,230 -90,-110 -90,-110 43.3333333333333,36.8181818181818 92.2727272727273,230 -45.7142857142858)), POLYGON((100.5 270,230 270,230 47.5,59.3478260869565 132.826086956522,100.5 270)))
de: -- Ausgabe mit ST_AsText GEOMETRYCOLLECTION(POLYGON((-110 43.3333333333333,-110 270,100.5 270,59.3478260869565 132.826086956522,36.8181818181818 92.2727272727273,-110 43.3333333333333)), POLYGON((230 47.5,230 -45.7142857142858,36.8181818181818 92.2727272727273,59.3478260869565 132.826086956522,230 47.5)),POLYGON((230 -45.7142857142858,230 -90,-110 -90,-110 43.3333333333333,36.8181818181818 92.2727272727273,230 -45.7142857142858)), POLYGON((100.5 270,230 270,230 47.5,59.3478260869565 132.826086956522,100.5 270)))
ja: -- ST_AsText 出力 GEOMETRYCOLLECTION(POLYGON((-110 43.3333333333333,-110 270,100.5 270,59.3478260869565 132.826086956522,36.8181818181818 92.2727272727273,-110 43.3333333333333)), POLYGON((230 47.5,230 -45.7142857142858,36.8181818181818 92.2727272727273,59.3478260869565 132.826086956522,230 47.5)),POLYGON((230 -45.7142857142858,230 -90,-110 -90,-110 43.3333333333333,36.8181818181818 92.2727272727273,230 -45.7142857142858)), POLYGON((100.5 270,230 270,230 47.5,59.3478260869565 132.826086956522,100.5 270)))
ko_kr: -- ST_AsText 출력물 GEOMETRYCOLLECTION(POLYGON((-110 43.3333333333333,-110 270,100.5 270,59.3478260869565 132.826086956522,36.8181818181818 92.2727272727273,-110 43.3333333333333)), POLYGON((230 47.5,230 -45.7142857142858,36.8181818181818 92.2727272727273,59.3478260869565 132.826086956522,230 47.5)),POLYGON((230 -45.7142857142858,230 -90,-110 -90,-110 43.3333333333333,36.8181818181818 92.2727272727273,230 -45.7142857142858)), POLYGON((100.5 270,230 270,230 47.5,59.3478260869565 132.826086956522,100.5 270)))
