Repository: postgis/postgis
Catalog: doc/po/*/reference_processing.xml.po
Languages: de, ja, ko_kr, zh_hans

source: Non-Aggregate version: This function returns a geometry being a collection of two input geometries. Output type can be a MULTI* or a GEOMETRYCOLLECTION.
de: Nicht-Aggregat Version: Diese Funktion gibt eine Geometrie zurück, die aus der Ansammlung zweier Eingabegeometrien besteht. Der Ausgabetyp kann eine Mehrfach-/MULTI* oder eine Sammelgeometrie/GEOMETRYCOLLECTION sein.
ja: 非集約関数版: この関数は、二つの入力ジオメトリをまとめたジオメトリを返します。出力タイプはMULTI系またはGEOMETRYCOLLECTIONです。
ko_kr: 비(非)종합 버전: 이 함수는 입력 도형 2개의 집합인 도형을 반환합니다. 멀티 도형 또는 도형 집합 유형을 출력할 수 있습니다.

source: ST_Collect and ST_Union are often interchangeable except that ST_Collect will always return a GeometryCollection or MULTI geometry and ST_Union may return single geometries when it dissolves boundaries. ST_Union will also split linestrings at node intersections, whereas ST_Collect will never split linestrings and in turn just return as MULTILINESTRING. To prevent ST_Collect from returning a Geometry Collection when collecting MULTI geometries, one can use the below trick that utilizes <xref linkend="ST_Dump"/> to expand the MULTIs out to singles and then regroup them.
de: ST_Collect und ST_Union sind oftmals gegeneinander austauschbar, außer das ST_Collect immer eine GeometryCollection oder MULTI-Geometrie zurückgibt und ST_Union kann Einzelgeometrien zurückgeben, wenn es die Grenzlinien auflöst. ST_Union teilt Linienzüge an Überschneidungsknoten, während ST_Collect Linienzüge niemals auftrennt und nur einen MULTILINESTRING zurückgibt. Um ST_Collect von der Ausgabe einer GeometryCollection bei der Sammlung von MULTI-Geometrien abzuhalten, kann man den unteren Trick anwenden, der <xref linkend="ST_Dump"/> nützt, um die MULTIs in Einzelgeometrien zu zerlegen und diese anschließend neu gruppiert.
ja: ST_CollectとST_Unionはしばしば交換して使うことができます。ただし、ST_Collectは常にジオメトリコレクションかマルチ系ジオメトリを返すのに対して、ST_Unionは分解できる時に単一ジオメトリを返すことがあります。また、ST_Unionはラインストリングをインタセクトするノードで分割しますが、ST_Collectは分割せずにマルチラインストリングとして返します。マルチ系ジオメトリを収集する時にST_Collectにジオメトリコレクションを返さないようにするためには、下に示すように、<xref linkend="ST_Dump"/>を利用して、マルチ系ジオメトリを単一ジオメトリにして、再グループ化するというトリックを使います。

source: Availability: 1.4.0 - ST_Collect(geomarray) was introduced. ST_Collect was enhanced to handle more geometries faster.
de: Verfügbarkeit: 1.4.0 - ST_Collect(geomarray) wurde eingeführt. ST_Collect wurde verbessert, um mehrere Geometrien schneller handhaben zu können.
ja: Availability: 1.4.0 - ST_Collect(geometry)が導入されました。ST_Collectがより多くのジオメトリをより早く扱えるよう強化されました。
ko_kr: 1.4.0 버전부터 사용할 수 있습니다. 이 버전부터 도형 배열을 입력받을 수 있습니다. 더 많은 도형들을 더 빨리 처리하도록 ST_Collect를 개선했습니다.

source: &curve_support; This method supports Circular Strings and Curves, but will never return a MULTICURVE or MULTI as one would expect and PostGIS does not currently support those.
de: &curve_support; Diese Methode unterstützt Kreisbögen und Kurven, gibt aber niemals eine MULTICURVE oder MULTI* zurück, so wie man es sich erwarten würde und PostGIS unterstützt diese auch nicht.
ja: &curve_support; このメソッドは曲線ストリングと曲線をサポートします。 ただし、MULTICURVEまたはMULTI系は期待するように返ることはなく、PostGISは現在のところこれに対応していません。
ko_kr: &curve_support; 이 메소드는 원호 스트링 및 만곡 도형을 지원하지만, 사용자가 기대할 만한 멀티커브 또는 멀티 도형을 반환하지는 않습니다. 현재 PostGIS는 이들을 지원하지 않습니다.

source: Aggregate example
de: Aggregat Beispiel
ja: 集約関数版の例
ko_kr: 종합 버전 예시

source: Non-Aggregate example
de: Nicht-Aggregat Beispiel
ja: 非集約関数の例
ko_kr: 비(非)종합 버전 예시

source: SELECT ST_AsText(ST_Collect(ST_GeomFromText('POINT(1 2)'), ST_GeomFromText('POINT(-2 3)') )); st_astext ---------- MULTIPOINT(1 2,-2 3) --Collect 2 d points SELECT ST_AsText(ST_Collect(ST_GeomFromText('POINT(1 2)'), ST_GeomFromText('POINT(1 2)') ) ); st_astext ---------- MULTIPOINT(1 2,1 2) --Collect 3d points SELECT ST_AsEWKT(ST_Collect(ST_GeomFromEWKT('POINT(1 2 3)'), ST_GeomFromEWKT('POINT(1 2 4)') ) ); st_asewkt ------------------------- MULTIPOINT(1 2 3,1 2 4) --Example with curves SELECT ST_AsText(ST_Collect(ST_GeomFromText('CIRCULARSTRING(220268 150415,220227 150505,220227 150406)'), ST_GeomFromText('CIRCULARSTRING(220227 150406,2220227 150407,220227 150406)'))); st_astext ------------------------------------------------------------------------------------ GEOMETRYCOLLECTION(CIRCULARSTRING(220268 150415,220227 150505,220227 150406), CIRCULARSTRING(220227 150406,2220227 150407,220227 150406)) --New ST_Collect array construct SELECT ST_Collect(ARRAY(SELECT the_geom FROM sometable)); SELECT ST_AsText(ST_Collect(ARRAY[ST_GeomFromText('LINESTRING(1 2, 3 4)'), ST_GeomFromText('LINESTRING(3 4, 4 5)')])) As wktcollect; --wkt collect -- MULTILINESTRING((1 2,3 4),(3 4,4 5))
de: SELECT ST_AsText(ST_Collect(ST_GeomFromText('POINT(1 2)'), ST_GeomFromText('POINT(-2 3)') )); st_astext ---------- MULTIPOINT(1 2,-2 3) --2D-Punkte sammeln SELECT ST_AsText(ST_Collect(ST_GeomFromText('POINT(1 2)'), ST_GeomFromText('POINT(1 2)') ) ); st_astext ---------- MULTIPOINT(1 2,1 2) --3D-Punkte sammeln SELECT ST_AsEWKT(ST_Collect(ST_GeomFromEWKT('POINT(1 2 3)'), ST_GeomFromEWKT('POINT(1 2 4)') ) ); st_asewkt ------------------------- MULTIPOINT(1 2 3,1 2 4) --Beispiel mit Kurven SELECT ST_AsText(ST_Collect(ST_GeomFromText('CIRCULARSTRING(220268 150415,220227 150505,220227 150406)'), ST_GeomFromText('CIRCULARSTRING(220227 150406,2220227 150407,220227 150406)'))); st_astext ------------------------------------------------------------------------------------ GEOMETRYCOLLECTION(CIRCULARSTRING(220268 150415,220227 150505,220227 150406), CIRCULARSTRING(220227 150406,2220227 150407,220227 150406)) --Neues ST_Collect-Array Konstrukt SELECT ST_Collect(ARRAY(SELECT the_geom FROM sometable)); SELECT ST_AsText(ST_Collect(ARRAY[ST_GeomFromText('LINESTRING(1 2, 3 4)'), ST_GeomFromText('LINESTRING(3 4, 4 5)')])) As wktcollect; --wkt collect -- MULTILINESTRING((1 2,3 4),(3 4,4 5))
ja: SELECT ST_AsText(ST_Collect(ST_GeomFromText('POINT(1 2)'), ST_GeomFromText('POINT(-2 3)') )); st_astext ---------- MULTIPOINT(1 2,-2 3) -- 2次元ポイント SELECT ST_AsText(ST_Collect(ST_GeomFromText('POINT(1 2)'), ST_GeomFromText('POINT(1 2)') ) ); st_astext ---------- MULTIPOINT(1 2,1 2) -- 3次元ポイント SELECT ST_AsEWKT(ST_Collect(ST_GeomFromEWKT('POINT(1 2 3)'), ST_GeomFromEWKT('POINT(1 2 4)') ) ); st_asewkt ------------------------- MULTIPOINT(1 2 3,1 2 4) -- 曲線の例 SELECT ST_AsText(ST_Collect(ST_GeomFromText('CIRCULARSTRING(220268 150415,220227 150505,220227 150406)'), ST_GeomFromText('CIRCULARSTRING(220227 150406,2220227 150407,220227 150406)'))); st_astext ------------------------------------------------------------------------------------ GEOMETRYCOLLECTION(CIRCULARSTRING(220268 150415,220227 150505,220227 150406), CIRCULARSTRING(220227 150406,2220227 150407,220227 150406)) -- 配列を構築して渡す新しいST_Collect SELECT ST_Collect(ARRAY(SELECT the_geom FROM sometable)); SELECT ST_AsText(ST_Collect(ARRAY[ST_GeomFromText('LINESTRING(1 2, 3 4)'), ST_GeomFromText('LINESTRING(3 4, 4 5)')])) As wktcollect; --wkt collect -- MULTILINESTRING((1 2,3 4),(3 4,4 5))
ko_kr: SELECT ST_AsText(ST_Collect(ST_GeomFromText('POINT(1 2)'), ST_GeomFromText('POINT(-2 3)') )); st_astext ---------- MULTIPOINT(1 2,-2 3) -- 2차원 포인트 수집 SELECT ST_AsText(ST_Collect(ST_GeomFromText('POINT(1 2)'), ST_GeomFromText('POINT(1 2)') ) ); st_astext ---------- MULTIPOINT(1 2,1 2) -- 3차원 포인트 수집 SELECT ST_AsEWKT(ST_Collect(ST_GeomFromEWKT('POINT(1 2 3)'), ST_GeomFromEWKT('POINT(1 2 4)') ) ); st_asewkt ------------------------- MULTIPOINT(1 2 3,1 2 4) -- 만곡 도형 예시 SELECT ST_AsText(ST_Collect(ST_GeomFromText('CIRCULARSTRING(220268 150415,220227 150505,220227 150406)'), ST_GeomFromText('CIRCULARSTRING(220227 150406,2220227 150407,220227 150406)'))); st_astext ------------------------------------------------------------------------------------ GEOMETRYCOLLECTION(CIRCULARSTRING(220268 150415,220227 150505,220227 150406), CIRCULARSTRING(220227 150406,2220227 150407,220227 150406)) -- 새로운 ST_Collect 배열 구조 SELECT ST_Collect(ARRAY(SELECT the_geom FROM sometable)); SELECT ST_AsText(ST_Collect(ARRAY[ST_GeomFromText('LINESTRING(1 2, 3 4)'), ST_GeomFromText('LINESTRING(3 4, 4 5)')])) As wktcollect; -- WKT 수집 -- MULTILINESTRING((1 2,3 4),(3 4,4 5))

source: The concave hull of a geometry represents a possibly concave geometry that encloses all geometries within the set. You can think of it as shrink wrapping.
de: Die konkave Hülle einer Geometrie stellt eine möglicherweise konkave Geometrie dar, welche alle Geometrien der Menge einschließt. Sie können es sich wie in Folie einpacken vorstellen.
ja: 凹包は、集合の範囲内におけるすべてのジオメトリーを囲む、できる限り凹となるジオメトリを表現するものです。収縮包装とみることができます。
ko_kr: 도형의 오목 껍질(concave hull)이란 집합 내부의 모든 도형들을 둘러싸는 오목할 수도 있는 도형을 말합니다. 진공 수축 포장이라는 식으로 생각할 수 있습니다.

source: The concave hull of a geometry represents a possibly concave geometry that encloses all geometries within the set. Defaults to false for allowing polygons with holes. The result is never higher than a single polygon.
de: Die konkave Hülle einer Geometrie stellt eine möglicherweise konkave Geometrie dar, welche alle Geometrien der Menge einschließt. Ob Polygone Lücken aufweisen dürfen ist standardmäßig auf FALSE gesetzt. Das Ergebnis ist niemals mehr als ein einzelnes Polygon.
ja: 凹包は、集合の範囲内におけるすべてのジオメトリを囲む、できる限り凹となるジオメトリを表現するものです。ポリゴンの穴を認めるのはデフォルトではfalseです。結果はシングルポリゴンより高くなることはありません。
ko_kr: 도형의 오목 껍질(concave hull)이란 집합 내부의 모든 도형들을 둘러싸는 오목할 수도 있는 도형을 말합니다. 구멍을 가진 폴리곤을 사용할지에 대한 파라미터의 기본값은 거짓입니다. 산출물은 절대로 단일 폴리곤을 넘지 않습니다.

source: The target_percent is the target percent of area of convex hull the PostGIS solution will try to approach before giving up or exiting. One can think of the concave hull as the geometry you get by vacuum sealing a set of geometries. The target_percent of 1 will give you the same answer as the convex hull. A target_percent between 0 and 0.99 will give you something that should have a smaller area than the convex hull. This is different from a convex hull which is more like wrapping a rubber band around the set of geometries.
de: Der Eingabeparameter "target_percent" ist der Flächenanteil der konvexen Hülle für den PostGIS eine Lösung annähert bevor es aufgibt oder beendet. Man kann sich eine konkave Hülle als eine Geometrie vorstellen, die man erhält wenn man einen Satz an Geometrien vakuumversiegelt. Ein target_percent von 1 führt zum selben Ergebnis wie die konvexe Hülle. Ein target_percent zwischen 0 und 0.99 ergibt eine kleinere Fläche als die konvexe Hülle. Dies unterscheidet sich von der konvexen Hülle, welche eher einem Gummiband entspricht, das den Satz an Geometrien umwickelt.
ja: target_percentは、凸包からPostGISがあきらめるか終了するまでに接近を試みる、凸包に対する目標割合です。凹包はジオメトリの集合を真空パックしたジオメトリと考えることができます。target_percentが1の場合には、凸包と同じ答えになります。target_parcetが0から0.99までの間では、凸包より小さい面積が得られます。これが、ジオメトリ集合を輪ゴムで囲うのに似ている凸包との違いです。
ko_kr: target_percent는 PostGIS 솔루션이 포기 또는 종료하기 전에 접근하려 할 볼록 껍질(convex hull) 면적의 목표 퍼센트입니다. 도형들의 집합을 둘러싼 봉지를 진공청소기로 빨아들여 봉한 도형을 오목 껍질이라고 생각해볼 수 있습니다. target_percent를 1로 설정하면 볼록 껍질과 동일한 답을 얻을 것입니다. target_percent를 0에서 0.99 사이의 값으로 설정하면 볼록 껍질보다 적은 면적을 가진 무언가를 얻을 것입니다. 오목 껍질은 도형들의 집합 주위로 고무줄을 두른 것에 가까운 볼록 껍질과 이렇게 다릅니다.

source: It is usually used with MULTI and Geometry Collections. Although it is not an aggregate - you can use it in conjunction with ST_Collect or ST_Union to get the concave hull of a set of points/linestring/polygons ST_ConcaveHull(ST_Collect(somepointfield), 0.80).
de: Wird üblicherweise auf Mehrfach/MULTI- und Sammelgeometrien/GeometryCollections angewandt. Obwohl es sich nicht um eine Aggregatfunktion handelt, können Sie es in Verbindung mit ST_Collect oder ST_Union verwenden um die konkave Hülle eines Satzes an Points/Linestrings/Polygons zu erhalten - ST_ConcaveHull(ST_Collect(somepointfield), 0.80).
ja: 通常はMULTI系とジオメトリコレクションに使われます。 集約関数ではないのですが、ST_CollectやST_Unionと併用して、ポイント/ラインストリング/ポリゴンの凹包を得ることができます。"ST_ConcaveHull(ST_Collect(somepointfield), 0.80)"といったようにします。
ko_kr: 이 함수는 주로 멀티 도형 및 도형 집합을 입력받습니다. 비록 종합 함수는 아니지만, ST_Collect 또는 ST_Union과 결합해서 포인트/라인스트링/폴리곤 집합의 오목 껍질을 얻을 수 있습니다. 예: ST_ConcaveHull(ST_Collect(somepointfield), 0.80)

source: It is much slower to compute than convex hull but encloses the geometry better and is also useful for image recognition.
de: Die Berechnung der konkaven Hülle ist wesentlich langsamer als bei der konvexen Hülle, aber die Geometrie wird besser umhüllt und ist auch nützlich bei der Bilderkennung.
ja: 凸包の計算よりも非常に遅いですが、よりよくジオメトリを囲みますし、画像認識にも使用されます。
ko_kr: 계산하는 데 볼록 껍질보다 더 오래 걸리지만 도형을 더 잘 둘러싸고 또 시각적으로 인식하는 데에도 유용합니다.

source: Performed by the GEOS module
de: Wird vom GEOS Modul ausgeführt
ja: GEOSモジュールによって実現しています。
ko_kr: GEOS 모듈로 실행
zh_hans: 它是通过GEOS模块实现的

source: Note - If you are using with points, linestrings, or geometry collections use ST_Collect. If you are using with polygons, use ST_Union since it may fail with invalid geometries.
de: Anmerkung - Wenn Sie es auf Punkte, Linienzüge oder Sammelgeometrien anwenden, werwenden Sie bitte ST_Collect. Bei Polygonen verwenden Sie bitte ST_Union, da es bei invaliden Geometrien fehlschlagen kann.
ja: ご注意 - ポイント、ラインストリング、ジオメトリコレクションで使用する場合には、ST_Collectを使用して下さい。ポリゴンで使用する場合には、不正なジオメトリで失敗する可能性があるため、ST_Unionを使用して下さい。
ko_kr: 주의: 포인트, 라인스트링 또는 도형 집합을 입력받을 경우 ST_Collect 함수를 이용하십시오. 폴리곤을 입력받을 경우, 유효하지 않은 도형이 오류를 일으킬 수도 있으므로 ST_Union 함수를 이용하십시오.

source: Note - The smaller you make the target percent, the longer it takes to process the concave hull and more likely to run into topological exceptions. Also the more floating points and number of points you accrue. First try a 0.99 which does a first hop, is usually very fast, sometimes as fast as computing the convex hull, and usually gives much better than 99% of shrink since it almost always overshoots. Second hope of 0.98 it slower, others get slower usually quadratically. To reduce precision and float points, use <xref linkend="ST_SimplifyPreserveTopology"/> or <xref linkend="ST_SnapToGrid"/> after ST_ConcaveHull. ST_SnapToGrid is a bit faster, but could result in invalid geometries where as ST_SimplifyPreserveTopology almost always preserves the validity of the geometry.
de: Anmerkung - Umso kleiner Sie die target_percent ansetzen, desto länger dauert die Berechnung der konkaven Hülle und desto wahrscheinlicher ist es, das topologische Fehler auftreten. Dies gilt auch umso größer die Anzahl der Kommastellen und die Anzahl der Punkte ist. Versuchen Sie zuerst eine 0.99, dies ist üblicherweise sehr schnell, manchmal so schnell wie die Berechnung der konvexen Hülle und ergibt meist einen viel besseren Wert als 99% Schrumpfung, da es fast immer über das Ziel hinausschießt. Als nächstes versuchen Sie 0.98; üblicherweise verlangsamt sich die Berechnung quadratisch. Um die Präzision und Kommastellen zu verringern, verwenden Sie bitte <xref linkend="ST_SimplifyPreserveTopology"/> oder<xref linkend="ST_SnapToGrid"/> nach ST_ConcaveHull. ST_SnapToGrid ist ein wenig schneller, kann allerdings zu invaliden Geometrien führen, während ST_SimplifyPreserveTopology meist die Validität der Geometrie erhält.
ja: ご注意 - 目標割合を小さくすると、凹包処理が長くなり、トポロジ例外が発生しやすくなります。蓄積される浮動小数点数とポイントの数もまた多くなります。最初に0.99で実行してみて下さい。普通は非常に速く、時々凸包と同じ速さです。99%縮小ではほとんどの場合行き過ぎになるので、通常は99%縮小より良い結果になります。次に0.98で実行すると、2乗のオーダーで遅くなります。ST_ConcaveHull実行後に、精度と浮動小数点数を減らすために、<xref linkend="ST_SimplifyPreserveTopology"/>や<xref linkend="ST_SnapToGrid"/>を使用します。ST_SnapToGridは少し早くなりますが、不正なジオメトリが得られることがあります。ST_SimplifyPreserveTopologyは常にジオメトリの妥当性を確保します。
ko_kr: 주의: 목표 퍼센트를 적게 만들수록, 처리 시간이 더 오래 걸리며 위상기하학적 예외가 발생할 가능성이 커집니다. 또 부동소수점이 많을수록 누적되는 포인트의 개수도 많아집니다. 먼저 첫 단계인 0.99로 설정해보십시오. 보통 매우 빠르고, 어떨 때는 볼록 껍질 계산만큼 빠르며, 거의 언제나 초과 작업을 하기 때문에 일반적으로 수축(shrink)의 99%보다 더 잘 반환합니다. 두 번째 단계인 0.98은 더 느리고, 단계가 올라갈수록 보통 2차급수적으로(quadratically) 느려집니다. 부동소수점과 정확도를 줄이려면, ST_ConcaveHull 실행 후 <xref linkend="ST_SimplifyPreserveTopology"/> 또는 <xref linkend="ST_SnapToGrid"/> 를 이용하십시오. ST_SnapToGrid가 조금 더 빠르지만, 유효하지 않은 도형을 반환할 수도 있는 반면 ST_SimplifyPreserveTopology는 거의 언제나 도형의 유효성을 보전합니다.

source: More real world examples and brief explanation of the technique are shown <ulink url="http://www.bostongis.com/postgis_concavehull.snippet">http://www.bostongis.com/postgis_concavehull.snippet</ulink>
de: Ein konkreteres Beispiel und eine kurze Erklärung der Technik finden Sie unter <ulink url="http://www.bostongis.com/postgis_concavehull.snippet">http://www.bostongis.com/postgis_concavehull.snippet</ulink>
ja: 現実世界の例と技術面でのしっかりした説明は、<ulink url="http://www.bostongis.com/postgis_concavehull.snippet">http://www.bostongis.com/postgis_concavehull.snippet</ulink>にあります。
ko_kr: 좀더 현실에 가까운 예시 및 간단한 기술 설명을 <ulink url="http://www.bostongis.com/postgis_concavehull.snippet">http://www.bostongis.com/postgis_concavehull.snippet</ulink> 에서 찾아볼 수 있습니다.

source: Also check out Simon Greener's article on demonstrating ConcaveHull introduced in Oracle 11G R2. <ulink url="http://www.spatialdbadvisor.com/oracle_spatial_tips_tricks/172/concave-hull-geometries-in-oracle-11gr2">http://www.spatialdbadvisor.com/oracle_spatial_tips_tricks/172/concave-hull-geometries-in-oracle-11gr2</ulink>. The solution we get at 0.75 target percent of convex hull is similar to the shape Simon gets with Oracle SDO_CONCAVEHULL_BOUNDARY.
de: Siehe auch Simon Greeners Artikel über ConcaveHull, die in Oracle 11G-R2 eingeführt wurde. <ulink url="http://www.spatialdbadvisor.com/oracle_spatial_tips_tricks/172/concave-hull-geometries-in-oracle-11gr2">http://www.spatialdbadvisor.com/oracle_spatial_tips_tricks/172/concave-hull-geometries-in-oracle-11gr2</ulink>. Die Lösung, die wir mit 0.75 target_percent der konvexen Hülle erhalten ähnelt der Geometrieform, die Simon mit Oracle SDO_CONCAVEHULL_BOUNDARY erhält.
ja: Oracle 11G R2で導入された凹包のデモンストレーションに関するSimon Greenerさんの記事も見てください。<ulink url="http://www.spatialdbadvisor.com/oracle_spatial_tips_tricks/172/concave-hull-geometries-in-oracle-11gr2">http://www.spatialdbadvisor.com/oracle_spatial_tips_tricks/172/concave-hull-geometries-in-oracle-11gr2</ulink>にあります。凸包に対する目標割合を0.75にした際の形状がSimonさんOracleのSDO_CONCAVEHULL_BOUNDARYで得た形状と似ています。
ko_kr: 또 Oracle 11G R2에 소개된 사이먼 그리너(Simon Greener)의 오목 껍질 시연에 대한 글 <ulink url="http://www.spatialdbadvisor.com/oracle_spatial_tips_tricks/172/concave-hull-geometries-in-oracle-11gr2">http://www.spatialdbadvisor.com/oracle_spatial_tips_tricks/172/concave-hull-geometries-in-oracle-11gr2</ulink> 도 확인해보십시오. 이 함수가 볼록 껍질의 목표 퍼센트 0.75로 얻을 수 있는 모양이 사이먼 그리너가 Oracle의 SDO_CONCAVEHULL_BOUNDARY로 얻은 것과 비슷합니다.

source: --Get estimate of infected area based on point observations SELECT d.disease_type, ST_ConcaveHull(ST_Collect(d.pnt_geom), 0.99) As geom FROM disease_obs As d GROUP BY d.disease_type;
de: --Abschätzung der infizierten Fläche aus Punktbeobachtungen SELECT d.disease_type, ST_ConcaveHull(ST_Collect(d.pnt_geom), 0.99) As geom FROM disease_obs As d GROUP BY d.disease_type;
ja: -- 観察ポイントを基に感染域の見積もりを得ます SELECT d.disease_type, ST_ConcaveHull(ST_Collect(d.pnt_geom), 0.99) As geom FROM disease_obs As d GROUP BY d.disease_type;
ko_kr: -- 포인트 관찰에 기반한 영향 면적 추산하기 SELECT d.disease_type, ST_ConcaveHull(ST_Collect(d.pnt_geom), 0.99) As geom FROM disease_obs As d GROUP BY d.disease_type;

source: ST_ConcaveHull of 2 polygons encased in target 100% shrink concave hull
de: ST_ConcaveHull von 2 Polygonen die von einer konkaven Hülle mit 100% Schrumpfung umhüllt werden.
ja: 縮小目標割合100%にした場合の2ポリゴンのST_ConcaveHull
ko_kr: 목표 100% 수축 오목 껍질에 둘러싸인 두 폴리곤의 ST_ConcaveHull

source: -- geometries overlaid with concavehull -- at target 100% shrink (this is the same as convex hull - since no shrink) SELECT ST_ConcaveHull( ST_Union(ST_GeomFromText('POLYGON((175 150, 20 40, 50 60, 125 100, 175 150))'), ST_Buffer(ST_GeomFromText('POINT(110 170)'), 20) ), 1) As convexhull;
de: -- Geometrien mit konkaver Hülle überlagert -- Ziel 100% Schrumpfung (dies entspricht der konvexen Hülle - keine Schrumpfung) SELECT ST_ConcaveHull( ST_Union(ST_GeomFromText('POLYGON((175 150, 20 40, 50 60, 125 100, 175 150))'), ST_Buffer(ST_GeomFromText('POINT(110 170)'), 20) ), 1) As convexhull;
ja: -- 目標縮小率を100%にした (凸包と同じとなり、縮小していません)場合の凹包で -- 覆ったジオメトリ SELECT ST_ConcaveHull( ST_Union(ST_GeomFromText('POLYGON((175 150, 20 40, 50 60, 125 100, 175 150))'), ST_Buffer(ST_GeomFromText('POINT(110 170)'), 20) ), 1) As convexhull;
ko_kr: -- 오목 껍질과 중첩한 도형들 -- 목표 100% 수축(수축이 없으므로 볼록 껍질과 동일함) SELECT ST_ConcaveHull( ST_Union(ST_GeomFromText('POLYGON((175 150, 20 40, 50 60, 125 100, 175 150))'), ST_Buffer(ST_GeomFromText('POINT(110 170)'), 20) ), 1) As convexhull;

source: -- geometries overlaid with concavehull at target 90% of convex hull area
de: -- Geometrien überlagert mit der konkaven Hülle mit einem Zielwert von 90% der konvexen Hülle
ja: 凸包に対する縮小目標割合を90%にした凹包で覆われるジオメトリ
ko_kr: -- 볼록 껍질 면적의 목표 90%에서 오목 껍질과 중첩한 도형들

source: -- geometries overlaid with concavehull at target 90% shrink SELECT ST_ConcaveHull( ST_Union(ST_GeomFromText('POLYGON((175 150, 20 40, 50 60, 125 100, 175 150))'), ST_Buffer(ST_GeomFromText('POINT(110 170)'), 20) ), 0.9) As target_90;
de: -- Geometrien überlagert mit der konkaven Hülle, die einen Zielwert von 90% Schrumpfung hat SELECT ST_ConcaveHull( ST_Union(ST_GeomFromText('POLYGON((175 150, 20 40, 50 60, 125 100, 175 150))'), ST_Buffer(ST_GeomFromText('POINT(110 170)'), 20) ), 0.9) As target_90;
ja: -- 目標縮小率を900%にした 場合の凹包で覆ったジオメトリ SELECT ST_ConcaveHull( ST_Union(ST_GeomFromText('POLYGON((175 150, 20 40, 50 60, 125 100, 175 150))'), ST_Buffer(ST_GeomFromText('POINT(110 170)'), 20) ), 0.9) As target_90;
ko_kr: -- 목표 90% 수축에서 오목 껍질과 중첩한 도형들 SELECT ST_ConcaveHull( ST_Union(ST_GeomFromText('POLYGON((175 150, 20 40, 50 60, 125 100, 175 150))'), ST_Buffer(ST_GeomFromText('POINT(110 170)'), 20) ), 0.9) As target_90;

source: L Shape points overlaid with convex hull
de: Als L angeordnete Punkte mit der konvexen Hülle überlagert.
ja: 凸包で覆われたL字型のポイント群
ko_kr: 볼록 껍질과 중첩한 L 형상 포인트들

source: -- this produces a table of 42 points that form an L shape SELECT (ST_DumpPoints(ST_GeomFromText( 'MULTIPOINT(14 14,34 14,54 14,74 14,94 14,114 14,134 14, 150 14,154 14,154 6,134 6,114 6,94 6,74 6,54 6,34 6, 14 6,10 6,8 6,7 7,6 8,6 10,6 30,6 50,6 70,6 90,6 110,6 130, 6 150,6 170,6 190,6 194,14 194,14 174,14 154,14 134,14 114, 14 94,14 74,14 54,14 34,14 14)'))).geom INTO TABLE l_shape; SELECT ST_ConvexHull(ST_Collect(geom)) FROM l_shape;
de: -- Erzeugt eine Tabelle mit 42 Punkten, die eine L-Form bilden SELECT (ST_DumpPoints(ST_GeomFromText( 'MULTIPOINT(14 14,34 14,54 14,74 14,94 14,114 14,134 14, 150 14,154 14,154 6,134 6,114 6,94 6,74 6,54 6,34 6, 14 6,10 6,8 6,7 7,6 8,6 10,6 30,6 50,6 70,6 90,6 110,6 130, 6 150,6 170,6 190,6 194,14 194,14 174,14 154,14 134,14 114, 14 94,14 74,14 54,14 34,14 14)'))).geom INTO TABLE l_shape; SELECT ST_ConvexHull(ST_Collect(geom)) FROM l_shape;
ja: -- 42ポイントでL字型を形成するテーブルを生成 SELECT (ST_DumpPoints(ST_GeomFromText( 'MULTIPOINT(14 14,34 14,54 14,74 14,94 14,114 14,134 14, 150 14,154 14,154 6,134 6,114 6,94 6,74 6,54 6,34 6, 14 6,10 6,8 6,7 7,6 8,6 10,6 30,6 50,6 70,6 90,6 110,6 130, 6 150,6 170,6 190,6 194,14 194,14 174,14 154,14 134,14 114, 14 94,14 74,14 54,14 34,14 14)'))).geom INTO TABLE l_shape; SELECT ST_ConvexHull(ST_Collect(geom)) FROM l_shape;
ko_kr: -- 이 쿼리는 L 형상을 이루고 있는 포인트 42개의 테이블을 생성합니다. SELECT (ST_DumpPoints(ST_GeomFromText( 'MULTIPOINT(14 14,34 14,54 14,74 14,94 14,114 14,134 14, 150 14,154 14,154 6,134 6,114 6,94 6,74 6,54 6,34 6, 14 6,10 6,8 6,7 7,6 8,6 10,6 30,6 50,6 70,6 90,6 110,6 130, 6 150,6 170,6 190,6 194,14 194,14 174,14 154,14 134,14 114, 14 94,14 74,14 54,14 34,14 14)'))).geom INTO TABLE l_shape; SELECT ST_ConvexHull(ST_Collect(geom)) FROM l_shape;

source: ST_ConcaveHull of L points at target 99% of convex hull
de: ST_ConcaveHull der als L angeordneten Punkte mit einem Zielwert von 99% der konvexen Hülle
ja: 凸包に対する縮小目標割合を99%としたL字型のポイント群の凹包
ko_kr: 볼록 껍질의 목표 99%에서 L 형상의 ST_ConcaveHull

source: Concave Hull of L points at target 80% convex hull area
de: ST_ConcaveHull der als L angeordneten Punkte mit einem Zielwert von 80% der Fläche der konvexen Hülle
ja: 凸包に対する縮小目標割合を80%としたL字型のポイント群の凹包
ko_kr: 볼록 껍질 면적의 목표 80%에서 L 형상 포인트들의 오목 껍질
