Repository: postgis/postgis
Catalog: doc/po/*/reference_processing.xml.po
Languages: de, ja, ko_kr, zh_hans

source: select ST_AsText(ST_SimplifyVW(geom,30)) simplified FROM (SELECT 'LINESTRING(5 2, 3 8, 6 20, 7 25, 10 10)'::geometry geom) As foo; -result simplified -----------+-------------------+ LINESTRING(5 2,7 25,10 10)
ja: select ST_AsText(ST_SimplifyVW(geom,30)) simplified FROM (SELECT 'LINESTRING(5 2, 3 8, 6 20, 7 25, 10 10)'::geometry geom) As foo; -- 結果 -- simplified -----------+-------------------+ LINESTRING(5 2,7 25,10 10)
ko_kr: select ST_AsText(ST_SimplifyVW(geom,30)) simplified FROM (SELECT 'LINESTRING(5 2, 3 8, 6 20, 7 25, 10 10)'::geometry geom) As foo; -- 결과 -- simplified -----------+-------------------+ LINESTRING(5 2,7 25,10 10)

source: Sets the effective area for each vertex, storing the value in the M ordinate. A simplified geometry can then be generated by filtering on the M ordinate.
de: Setzt die Nutzfläche für jeden Knoten und speichert den Wert in der M-Ordinate. Eine vereinfachte Geometrie kann dann über einen Filter auf die M-Ordinate erzeugt werden.
ja: 個々の頂点について有効範囲を設定し、M値として保存します。M値でフィルタリングすると、単純化したジオメトリを生成できます。
ko_kr: M 세로 좌표(ordinate)에 값을 저장해서 각 꼭짓점에 대한 유효 범위(effective area)를 설정합니다. 그 다음 M 세로 좌표에 대해 필터링해서 단순화시킨 도형을 생성할 수 있습니다.

source: Sets the effective area for each vertex, using the Visvalingam-Whyatt algorithm. The effective area is stored as the M-value of the vertex. If the optional "theshold" parameter is used, a simplified geometry will be returned, containing only vertices with an effective area greater than or equal to the threshold value.
de: Setzt die Nutzfläche für jeden Knoten. Verwendet den Visvalingam-Whyatt Algorithmus. Die Nutzfläche wird als M-Wert des Knoten gespeichert. Wird der optionale Parameter "threshold" verwendet, so wird eine vereinfachte Geometrie zurückgegeben, die nur jene Knoten enthält, deren Nutzfläche größer oder gleich dem Schwellenwert ist.
ja: Visvalingam-Whyattアルゴリズムから有効範囲となる個々の頂点を置きます。有効範囲はジオメトリのM値として格納されます。任意引数である第2引数を使うと、しきい値以上の有効範囲となる頂点だけで構築されるジオメトリを返します。
ko_kr: 비스베일링검-와이어트 알고리즘을 이용해서 각 꼭짓점에 대한 유효 범위를 설정합니다. 유효 범위는 꼭짓점의 M값으로 저장됩니다. 선택적인 "임계" 파라미터를 설정할 경우, 임계치 이상의 유효 범위를 가진 꼭짓점만을 담고 있는 단순화된 도형을 반환할 것입니다.
zh_hans: 使用 Visvalingam-Whyatt 算法设置每个顶点的有效区域。 有效区域存储为顶点的 M 值。 如果使用可选的“theshold”参数，则将返回简化的几何图形，仅包含有效区域大于或等于阈值的顶点。

source: This function can be used for server-side simplification when a threshold is specified. Another option is to use a threshold value of zero. In this case, the full geometry will be returned with effective areas as M-values, which can be used by the client to simplify very quickly.
de: Diese Funktion kann für die serverseitige Vereinfachung, mittels eines Schwellenwerts verwendet werden. Eine andere Möglichkeit besteht darin, einen Schwellenwert von null anzugeben. In diesem Fall wird die gesamte Geometrie inklusive der Nutzflächen als M-Werte zurückgegeben, welche dann am Client für eine rasche Vereinfachung genutzt werden können.
ja: この関数は、しきい値を使うことでサーバサイド簡略化に使えます。もう一つの任意引数はしきい値を0にする際に使用します。この場合、完全なジオメトリを得ますが、クライアントが非常に高速に簡略化するために使うM値として格納している有効範囲を持っています。
ko_kr: 임계치를 설정할 경우 이 함수를 서버측 단순화 작업에 이용할 수 있습니다. 또다른 옵션은 임계치를 0으로 설정하는 것입니다. 이럴 경우, 유효 범위를 M값으로 가진 전체 도형을 반환하는데, 이 도형을 클라이언트측에서 매우 빨리 단순화하는 데 쓸 수 있습니다.
zh_hans: 当指定阈值时，此函数可用于服务器端简化。 另一种选择是使用零阈值。 在这种情况下，将返回完整的几何图形，其中有效区域作为 M 值，客户端可以使用它来快速简化。

source: Will actually do something only with (multi)lines and (multi)polygons but you can safely call it with any kind of geometry. Since simplification occurs on a object-by-object basis you can also feed a GeometryCollection to this function.
de: Tut zurzeit nur mit (Multi)Lines und (Multi)Polygons etwas, kann aber gefahrlos mit jedem geometrischen Datentyp verwendet werden. Da die Vereinfachung auf einer Objekt zu Objekt Basis passiert, können Sie diese Funktion auch mit einer Sammelgeometrie speisen.
ja: (MULTI)LINEと(MULTI)POLYGONとで実際に動作をしますが、どのような種類のジオメトリでも安全に呼ぶことができます。簡略化はオブジェクトごとに行われるので、ジオメトリコレクションでこの関数を呼ぶことができます。
ko_kr: 실제로는 [멀티]라인, [멀티]폴리곤과만 작동하지만, 어떤 종류의 도형도 입력할 수 있다고 해도 과언은 아닙니다. 객체별 기반으로 단순화 작업을 하기 때문에 이 함수에 도형 집합도 입력할 수 있습니다.
zh_hans: 实际上只会对（多）线和（多）多边形执行某些操作，但您可以使用任何类型的几何体安全地调用它。 由于简化是在逐个对象的基础上进行的，因此您还可以将 GeometryCollection 提供给此函数。

source: The output geometry will lose all previous information in the M-values
de: Die Ausgabegeometrie verliert die gesamte vorhandene Information über die M-Werte
ja: 出力ジオメトリは、入力時に持っていたM値の情報の全てを失います。
ko_kr: 출력 도형은 M값으로 가지고 있던 정보를 모두 잃게 될 것입니다.
zh_hans: 输出几何图形将丢失 M 值中的所有先前信息

source: This function handles 3D and the third dimension will affect the effective area
de: Diese Funktion kann mit 3D umgehen und die dritte Dimension beeinflusst auch die tatsächliche Fläche
ja: この関数は3次元を扱います。第3次元は結果に影響を与えます。
ko_kr: 이 함수는 3차원을 처리하며, 세 번째 차원이 유효 범위에 영향을 미칠 것입니다.
zh_hans: 此功能处理 3D，三维度会影响有效区域

source: Calculating the effective area of a LineString. Because we use a threshold value of zero, all vertices in the input geometry are returned.
de: Berechnung der Nutzfläche eines Linienzugs. Da wir einen Schwellenwert von null verwenden, werden alle Knoten der Eingabegeomettrie zurückgegeben.
ja: ラインストリングの有効範囲の計算。しきい値を0にしているので、入力ジオメトリの全ての頂点が返ります。
ko_kr: 라인스트링의 유효 범위를 계산합니다. 임계치를 0으로 설정하기 때문에, 입력 도형 안에 있는 모든 꼭짓점을 반환합니다.
zh_hans: 计算 LineString 的有效区域。 因为我们使用阈值为零，所以返回输入几何体中的所有顶点。

source: select ST_AsText(ST_SetEffectiveArea(geom)) all_pts, ST_AsText(ST_SetEffectiveArea(geom,30) ) thrshld_30 FROM (SELECT 'LINESTRING(5 2, 3 8, 6 20, 7 25, 10 10)'::geometry geom) As foo; -result all_pts | thrshld_30 -----------+-------------------+ LINESTRING M (5 2 3.40282346638529e+38,3 8 29,6 20 1.5,7 25 49.5,10 10 3.40282346638529e+38) | LINESTRING M (5 2 3.40282346638529e+38,7 25 49.5,10 10 3.40282346638529e+38)
ja: select ST_AsText(ST_SetEffectiveArea(geom)) all_pts, ST_AsText(ST_SetEffectiveArea(geom,30) ) thrshld_30 FROM (SELECT 'LINESTRING(5 2, 3 8, 6 20, 7 25, 10 10)'::geometry geom) As foo; -- 結果 -- all_pts | thrshld_30 -----------+-------------------+ LINESTRING M (5 2 3.40282346638529e+38,3 8 29,6 20 1.5,7 25 49.5,10 10 3.40282346638529e+38) | LINESTRING M (5 2 3.40282346638529e+38,7 25 49.5,10 10 3.40282346638529e+38)
ko_kr: select ST_AsText(ST_SetEffectiveArea(geom)) all_pts, ST_AsText(ST_SetEffectiveArea(geom,30) ) thrshld_30 FROM (SELECT 'LINESTRING(5 2, 3 8, 6 20, 7 25, 10 10)'::geometry geom) As foo; -- 결과 -- all_pts | thrshld_30 -----------+-------------------+ LINESTRING M (5 2 3.40282346638529e+38,3 8 29,6 20 1.5,7 25 49.5,10 10 3.40282346638529e+38) | LINESTRING M (5 2 3.40282346638529e+38,7 25 49.5,10 10 3.40282346638529e+38)

source: Returns a collection of geometries resulting by splitting a geometry.
de: Gibt eine Sammelgeometrie zurück, die beim Auftrennen einer Geometrie entsteht.
ja: ジオメトリを分割したジオメトリのコレクションを返します。
ko_kr: 도형을 분해(split)해서 나오는 도형들의 집합을 반환합니다.

source: The function supports splitting a line by (multi)point, (multi)line or (multi)polygon boundary, a (multi)polygon by line. The returned geometry is always a collection.
de: Diese Funktion unterstützt das Auftrennen einer Linie durch einen MultiPoint, eine MultiLine oder eine (Multi)Polygongrenze und das Auftrennen eines (Multi)Polygons durch eine Linie. Die zurückgegebene Geometrie ist immer eine Sammelgeometrie.
ja: この関数は、ラインの(MULTI)POINT, (MULTI)LINEまたは(MULTI)POLYGONの境界による分割に対応しています。返されるジオメトリは常にコレクションです。
ko_kr: 이 함수는 [멀티]포인트, [멀티]라인, 또는 [멀티]폴리곤 경계선으로 라인을, 그리고 라인으로 [멀티]폴리곤을 분해합니다. 언제나 도형 집합을 반환합니다.

source: Think of this function as the opposite of ST_Union. Theoretically applying ST_Union to the elements of the returned collection should always yield the original geometry.
de: Diese Funktion ist das Gegenstück zu ST_Union. Theoretisch sollte die Anwendung von ST_Union auf die Elemente der zurückgegebenen Sammelgeometrie immer zur ursprünglichen Geometrie führen.
ja: この関数はST_Unionの逆と考えられます。理論的には、返されたコレクションにST_Unionを適用すると、常に元のジオメトリが得られます。
ko_kr: 이 함수를 ST_Union의 역함수로 생각하십시오. 이론적으로, 반환된 도형의 구성 요소에 ST_Union을 적용하면 언제나 원본 도형을 출력해야 합니다.

source: Changed: 2.2.0 support for splitting a line by a multiline, a multipoint or (multi)polygon boundary was introduced.
de: Änderung: 2.2.0 Unterstützung für das Auftrennen von Linien durch eine MultiLine, einen MultiPoint oder eine (Multi)Polygongrenze eingeführt
ja: Changed: 2.2.0 MULTILINESTRING,MULTIPOINT, (MULTI)POLYGONの境界によるラインの分割に対応しました。
ko_kr: 변경 사항: 2.2.0 버전부터 [멀티]포인트, [멀티]라인, 또는 [멀티]폴리곤 경계선으로 라인을 분해할 수 있습니다.

source: To improve the robustness of ST_Split it may be convenient to <xref linkend="ST_Snap"/> the input to the blade in advance using a very low tolerance. Otherwise the internally used coordinate grid may cause tolerance problems, where coordinates of input and blade do not fall onto each other and the input is not being split correctly (see <ulink url="http://trac.osgeo.org/postgis/ticket/2192">#2192</ulink>).
de: Um die Robustheit von ST_Split zu erhöhen, kann es zweckmäßig sein ein <xref linkend="ST_Snap"/> mit einem sehr niedrigen Toleranzwert auszuführen, bevor die Eingabe an die "Schneide" erfolgt. Andernfalls kann das intern verwendete Koordinatengitter Toleranzprobleme verursachen, wodurch die Koordinaten der Eingabe und der "Schneide" nicht zusammenfallen und die Eingabegeometrie nicht korrekt aufgetrennt wird (siehe <ulink url="http://trac.osgeo.org/postgis/ticket/2192">#2192</ulink>).
ja: ST_Splitのロバスト性を改善するには、非常に低い許容誤差を使用する前に、入力ジオメトリを、刃ジオメトリに対して<xref linkend="ST_Snap"/>すると良いかも知れません。内部で使用されている座標グリッドは、許容誤差に関する問題を引き起こす可能性があります。入力座標と刃がお互いの上に落ちず、入力が正しく分割されない場合があります (<ulink url="http://trac.osgeo.org/postgis/ticket/2192">#2192</ulink>を参照して下さい)。
ko_kr: ST_Split 함수의 강력함을 향상시키려면, 매우 낮은 허용 오차를 이용해서 입력 도형을 날(blade)에 <xref linkend="ST_Snap"/> 시키는 편이 편리할 수도 있습니다. 그렇지 않을 경우 내부적으로 사용되는 좌표 그리드가 허용 오차 문제를 일으킬 수도 있는데, 입력 도형의 좌표와 날이 서로 일치하지 않아 입력 도형이 정확히 분해되지 않는 문제를 말합니다(<ulink url="http://trac.osgeo.org/postgis/ticket/2192">#2192</ulink> 참조).

source: When a (multi)polygon is passed as as the blade, its linear component (the boundary) is used for cutting the input.
de: Wenn ein Mehrfachpolygon als "Schneide" übergeben wird, so wird deren linearer Bestandteil (die Begrenzung) verwendet, um die Eingabegeometrie aufzutrennen.
ja: (MULTI)ポリゴンを刃として渡すと、線要素 (境界)が入力の分割に使われます。
ko_kr: [멀티]폴리곤을 날로서 입력할 경우, 폴리곤의 선형 구성 요소(경계선)가 입력 도형을 자르는 데 쓰입니다.

source: Polygon Cut by Line
de: Polygon aufgetrennt durch eine Linie
ja: ラインに切られるポリゴン
ko_kr: 라인으로 폴리곤을 분해

source: Before Split
de: Vor der Teilungsoperation
ja: 分割前
ko_kr: 분해 전

source: After split
de: Nach der Teilungsoperation
ja: 分割後
ko_kr: 분해 후

source: -- this creates a geometry collection consisting of the 2 halves of the polygon -- this is similar to the example we demonstrated in ST_BuildArea SELECT ST_Split(circle, line) FROM (SELECT ST_MakeLine(ST_MakePoint(10, 10),ST_MakePoint(190, 190)) As line, ST_Buffer(ST_GeomFromText('POINT(100 90)'), 50) As circle) As foo; -- result -- GEOMETRYCOLLECTION(POLYGON((150 90,149.039264020162 80.2454838991936,146.193976625564 70.8658283817455,..), POLYGON(..))) -- To convert to individual polygons, you can use ST_Dump or ST_GeometryN SELECT ST_AsText((ST_Dump(ST_Split(circle, line))).geom) As wkt FROM (SELECT ST_MakeLine(ST_MakePoint(10, 10),ST_MakePoint(190, 190)) As line, ST_Buffer(ST_GeomFromText('POINT(100 90)'), 50) As circle) As foo; -- result -- wkt --------------- POLYGON((150 90,149.039264020162 80.2454838991936,..)) POLYGON((60.1371179574584 60.1371179574584,58.4265193848728 62.2214883490198,53.8060233744357 ..))
de: -- erzeugt eine Sammelgeometrie die aus 2 Hälften des Polygons besteht -- ähnlich dem Beispiel unter ST_BuildArea SELECT ST_Split(circle, line) FROM (SELECT ST_MakeLine(ST_MakePoint(10, 10),ST_MakePoint(190, 190)) As line, ST_Buffer(ST_GeomFromText('POINT(100 90)'), 50) As circle) As foo; -- result -- GEOMETRYCOLLECTION(POLYGON((150 90,149.039264020162 80.2454838991936,146.193976625564 70.8658283817455,..), POLYGON(..))) -- Um in einzelne Polygone umzurechnen können Sie ST_Dump oder ST_GeometryN verwenden SELECT ST_AsText((ST_Dump(ST_Split(circle, line))).geom) As wkt FROM (SELECT ST_MakeLine(ST_MakePoint(10, 10),ST_MakePoint(190, 190)) As line, ST_Buffer(ST_GeomFromText('POINT(100 90)'), 50) As circle) As foo; -- result -- wkt --------------- POLYGON((150 90,149.039264020162 80.2454838991936,..)) POLYGON((60.1371179574584 60.1371179574584,58.4265193848728 62.2214883490198,53.8060233744357 ..))
ja: -- ポリゴンを2個に割ったものからなるジオメトリコレクションを生成します -- ST_BuildAreaの例と似ています SELECT ST_Split(circle, line) FROM (SELECT ST_MakeLine(ST_MakePoint(10, 10),ST_MakePoint(190, 190)) As line, ST_Buffer(ST_GeomFromText('POINT(100 90)'), 50) As circle) As foo; -- 結果 -- GEOMETRYCOLLECTION(POLYGON((150 90,149.039264020162 80.2454838991936,146.193976625564 70.8658283817455,..), POLYGON(..))) -- 個々のポリゴンに変換するには、ST_DumpまたはST_GeometryNを使います SELECT ST_AsText((ST_Dump(ST_Split(circle, line))).geom) As wkt FROM (SELECT ST_MakeLine(ST_MakePoint(10, 10),ST_MakePoint(190, 190)) As line, ST_Buffer(ST_GeomFromText('POINT(100 90)'), 50) As circle) As foo; -- 結果 -- wkt --------------- POLYGON((150 90,149.039264020162 80.2454838991936,..)) POLYGON((60.1371179574584 60.1371179574584,58.4265193848728 62.2214883490198,53.8060233744357 ..))
ko_kr: -- 이 쿼리는 폴리곤의 절반 2개로 이루어진 도형 집합을 생성합니다. -- 이 쿼리는 ST_BuildArea 함수에서 봤던 예시와 유사합니다. SELECT ST_Split(circle, line) FROM (SELECT ST_MakeLine(ST_MakePoint(10, 10),ST_MakePoint(190, 190)) As line, ST_Buffer(ST_GeomFromText('POINT(100 90)'), 50) As circle) As foo; -- 결과 -- GEOMETRYCOLLECTION(POLYGON((150 90,149.039264020162 80.2454838991936,146.193976625564 70.8658283817455,..), POLYGON(..))) -- 개별 폴리곤들로 변환하려면, ST_Dump 또는 ST_GeometryN 함수를 쓰면 됩니다. SELECT ST_AsText((ST_Dump(ST_Split(circle, line))).geom) As wkt FROM (SELECT ST_MakeLine(ST_MakePoint(10, 10),ST_MakePoint(190, 190)) As line, ST_Buffer(ST_GeomFromText('POINT(100 90)'), 50) As circle) As foo; -- 결과 -- wkt --------------- POLYGON((150 90,149.039264020162 80.2454838991936,..)) POLYGON((60.1371179574584 60.1371179574584,58.4265193848728 62.2214883490198,53.8060233744357 ..))

source: Multilinestring Cut by point
de: Ein MultiLiniestring durch einen Punkt aufgetrennt
ja: ポイントで切られるマルチラインストリング
ko_kr: 포인트로 멀티라인스트링을 분해

source: Returns a geometry that represents the portions of A and B that do not intersect. It is called a symmetric difference because ST_SymDifference(A,B) = ST_SymDifference(B,A).
de: Gibt eine Geometrie zurück, die jene Teile von A und B repräsentiert, die sich nicht überlagern. Wird symmetrische Differenz genannt, da ST_SymDifference(A,B) = ST_SymDifference(B,A).
ja: AとBの、インタセクトしていない部分を表現するジオメトリを返します。対称と呼ばれるのは、ST_SymDifference(A,B) = ST_SymDifference(B,A) となるからです。
ko_kr: 도형 A와 B의 서로 교차하지 않는 부분들을 표현하는 도형을 반환합니다. ST_SymDifference(A,B) = ST_SymDifference(B,A)이기 때문에 이를 대칭차(symmetric difference)라고 합니다.

source: Returns a geometry that represents the portions of A and B that do not intersect. It is called a symmetric difference because ST_SymDifference(A,B) = ST_SymDifference(B,A). One can think of this as ST_Union(geomA,geomB) - ST_Intersection(A,B).
de: Gibt eine Geometrie zurück, die jene Teile von A und B repräsentiert, die sich nicht überlagern. Wird symmetrische Differenz genannt, da ST_SymDifference(A,B) = ST_SymDifference(B,A). Man kann sich das auch als ST_Union(geomA,geomB) - ST_Intersection(A,B) vorstellen.
ja: AとBの、インタセクトしていない部分を表現するジオメトリを返します。対称と呼ばれるのは、ST_SymDifference(A,B) = ST_SymDifference(B,A)となるからです。ST_Union(geomA,geomB) - ST_Intersection(A,B)と見ることができます。
ko_kr: 도형 A와 B의 서로 교차하지 않는 부분들을 표현하는 도형을 반환합니다. ST_SymDifference(A,B) = ST_SymDifference(B,A)이기 때문에 이를 대칭차(symmetric difference)라고 합니다. ST_Union(geomA,geomB)에서 ST_Intersection(A,B)를 뺀 것으로 생각할 수도 있습니다.

source: The original linestrings shown together
de: Die ursprünglichen Linienzüge gemeinsam dargesellt
ja: 二つある元のラインストリングの両方
ko_kr: 함께 표출된 원본 라인스트링들

source: The symmetric difference of the two linestrings
de: Die symmetrische Differenz zweier Linienzüge
ja: 二つのラインストリングの対称差
ko_kr: 두 라인스트링의 대칭차(symmetric difference)

source: --Safe for 2d - symmetric difference of 2 linestrings SELECT ST_AsText( ST_SymDifference( ST_GeomFromText('LINESTRING(50 100, 50 200)'), ST_GeomFromText('LINESTRING(50 50, 50 150)') ) ); st_astext --------- MULTILINESTRING((50 150,50 200),(50 50,50 100))
de: --Sicher für 2D - symmetrische Differenz von 2 Linienzügen SELECT ST_AsText( ST_SymDifference( ST_GeomFromText('LINESTRING(50 100, 50 200)'), ST_GeomFromText('LINESTRING(50 50, 50 150)') ) ); st_astext --------- MULTILINESTRING((50 150,50 200),(50 50,50 100))
ja: -- 2次元では安全です - 二つのラインストリングの対称差 SELECT ST_AsText( ST_SymDifference( ST_GeomFromText('LINESTRING(50 100, 50 200)'), ST_GeomFromText('LINESTRING(50 50, 50 150)') ) ); st_astext --------- MULTILINESTRING((50 150,50 200),(50 50,50 100))
ko_kr: -- 2D 도형에 대해 안전합니다. 두 도형의 대칭차입니다. SELECT ST_AsText( ST_SymDifference( ST_GeomFromText('LINESTRING(50 100, 50 200)'), ST_GeomFromText('LINESTRING(50 50, 50 150)') ) ); st_astext --------- MULTILINESTRING((50 150,50 200),(50 50,50 100))

source: --When used in 3d doesn't quite do the right thing SELECT ST_AsEWKT(ST_SymDifference(ST_GeomFromEWKT('LINESTRING(1 2 1, 1 4 2)'), ST_GeomFromEWKT('LINESTRING(1 1 3, 1 3 4)'))) st_astext ------------ MULTILINESTRING((1 3 2.75,1 4 2),(1 1 3,1 2 2.25))
de: --Mit 3D passiert nicht ganz das richtige SELECT ST_AsEWKT(ST_SymDifference(ST_GeomFromEWKT('LINESTRING(1 2 1, 1 4 2)'), ST_GeomFromEWKT('LINESTRING(1 1 3, 1 3 4)'))) st_astext ------------ MULTILINESTRING((1 3 2.75,1 4 2),(1 1 3,1 2 2.25))
ja: -- 3次元で使用すると、完全には正しいものとはなりません SELECT ST_AsEWKT(ST_SymDifference(ST_GeomFromEWKT('LINESTRING(1 2 1, 1 4 2)'), ST_GeomFromEWKT('LINESTRING(1 1 3, 1 3 4)'))) st_astext ------------ MULTILINESTRING((1 3 2.75,1 4 2),(1 1 3,1 2 2.25))
ko_kr: -- 3차원에서 이용할 경우 제대로 동작하지 않습니다. SELECT ST_AsEWKT(ST_SymDifference(ST_GeomFromEWKT('LINESTRING(1 2 1, 1 4 2)'), ST_GeomFromEWKT('LINESTRING(1 1 3, 1 3 4)'))) st_astext ------------ MULTILINESTRING((1 3 2.75,1 4 2),(1 1 3,1 2 2.25))

source: Returns a set of geometry where no geometry in the set has more than the specified number of vertices.
de: Gibt eine Geometriemenge zurück, wobei keine Geometrie der Menge mehr als die festgelegte Anzahl an Knoten aufweist.
ja: 指定した数より多い頂点を持たないジオメトリの集合を返します。
ko_kr: 집합 내의 모든 도형이 설정된 개수 이하의 꼭짓점을 가지는 도형 집합을 반환합니다.

source: Turns a single geometry into a set in which each element has fewer than the maximum allowed number of vertices. Useful for converting excessively large polygons and other objects into small portions that fit within the database page size. Uses the same envelope clipping as ST_ClipByBox2D does, recursively subdividing the input geometry until all portions have less than the maximum vertex count. Minimum vertice count allowed is 8 and if you try to specify lower than 8, it will throw an error.
de: Wandelt eine Einzelgeometrie in eine Menge um, bei der jedes Element weniger als die maximal erlaubte Anzahl an Knoten hat. Nützlich für die Konvertierung von übermäßig großen Polygonen und anderen Geoobjekten in kleine Teile, die dann in die Speicherseite der Datenbank passen. Verwendet dieselbe Methode beim Zerschneiden wie ST_ClipByBox2D, indem die Eingabegeometrie solange rekursiv zerteilt wird bis alle Teile weniger als die maximal erlaubte Knotenanzahl aufweisen. Die kleinste erlaubte Knotenanzahl ist 8; wenn Sie weniger als 8 angeben wird eine Fehlermeldung angezeigt.
ja: 一つのジオメトリを、許された頂点数の最大値より小さい要素の集合にします。非常に大きなポリゴンとオブジェクトをデータベースのページサイズに収まるように、小さい部分に変換するのに使います。ST_ClipByBox2Dが行うような四角形切り抜きと同じことを行い、入力ジオメトリをすべてのポイントが頂点最大値未満になるまで再帰的に分割していきます。指定できる頂点最大値の最小値は8で、8未満を指定しようとすると、エラーが投げられます。
ko_kr: 단일 도형을 최대 허용 개수 이하의 꼭짓점을 가지는 각 구성 요소로 이루어진 집합으로 바꿉니다. 과도하게 대용량인 폴리곤 및 다른 객체들을 데이터베이스의 페이지 용량에 맞는 작은 부분들로 변환하는 데 유용합니다. ST_ClipByBox2D 함수와 동일한 엔벨로프 클리핑을 이용하는데, 모든 부분들이 최대 허용 개수보다 적은 꼭짓점을 가질 때까지 입력 도형을 반복해서 세분화합니다. 최소 꼭짓점 허용 개수는 8로, 8보다 적은 수로 설정하려 하면 오류를 일으킬 것입니다.

source: Clipping performed by the GEOS module.
de: Das Auftrennen wird durch das GEOS Modul ausgeführt.
ja: 切り抜きはGEOSモジュールを使っています。
ko_kr: GEOS 모듈로 클리핑 실행

source: Availability: 2.2.0 requires GEOS &gt;= 3.5.0.
de: Verfügbarkeit: 2.2.0 benötigt GEOS &gt;= 3.5.0.
ja: Availability: 2.2.0 GEOS 3.5.0以上が必要です。
ko_kr: 2.2.0 버전부터 사용할 수 있습니다. GEOS 3.5.0 이상 버전이 필요합니다.

source: -- Create a new subdivided table suitable for joining to the original CREATE TABLE subdivided_geoms AS SELECT pkey, ST_Subdivide(geom) AS geom FROM original_geoms;
de: -- Erzeugt eine neu gegliederte Tabelle, passend um es mit dem Original zu verknüpfen CREATE TABLE subdivided_geoms AS SELECT pkey, ST_Subdivide(geom) AS geom FROM original_geoms;
ja: -- 元のジオメトリに結合するのに適切な、新しい分割されたテーブルの作成 CREATE TABLE subdivided_geoms AS SELECT pkey, ST_Subdivide(geom) AS geom FROM original_geoms;
ko_kr: -- 원본에 결합시키는 데 적합하게 세분화된 새 테이블을 생성합니다. CREATE TABLE subdivided_geoms AS SELECT pkey, ST_Subdivide(geom) AS geom FROM original_geoms;

source: Subdivide max 10 vertices
de: In maximal 10 Knoten unterteilen
ja: 最大10頂点での分割
ko_kr: 최대 꼭짓점 10개로 세분화

source: Useful in conjunction with ST_Segmentize to create additional vertices that can then be used for splitting
de: Nützlich in Verbindung mit ST_Segmentize um zusätzliche Knoten zu erzeugen, die dann zum Auftrennen verwendet werden können
ja: 分割に使うことができる頂点の追加にST_Segmentizeを併用します
ko_kr: ST_Segmentize와 결합해서 이후 분해 작업에 이용할 수 있는 추가 꼭짓점들을 생성하는 데 유용합니다.

source: Returns a version of the given geometry with given ordinate values swapped.
de: Gibt eine Version der Ausgangsgeometrie zurück, in der die angegebenen Ordinatenwerte ausgetauscht werden.
ja: 与えられたジオメトリにおいて与えられた座標の値を入れ替えたジオメトリを返します。
ko_kr: 입력 도형을 좌표값을 뒤바꾼 상태로 반환합니다.

source: Returns a version of the given geometry with given ordinates swapped.
de: Gibt eine Version der Ausgangsgeometrie zurück, in der die angegebenen Ordinaten ausgetauscht werden.
ja: 与えられたジオメトリにおいて与えられた座標の値を入れ替えたジオメトリを返します。
ko_kr: 입력 도형을 좌표값을 뒤바꾼 상태로 반환합니다.

source: The <varname>ords</varname> parameter is a 2-characters string naming the ordinates to swap. Valid names are: x,y,z and m.
de: Der <varname>ords</varname> Parameter ist eine Zeichenkette aus 2 Zeichen, welche die Ordinate benennt die getauscht werden soll. Gültige Bezeichnungen sind: x,y,z und m.
ja: <varname>ords</varname>引数は2文字の文字列で、入れ替える座標名を示します。座標名はx, y, z, mが有効です。
ko_kr: <varname>ords</varname> 파라미터는 뒤바꿀 좌표를 명명하는 문자 2개 길이의 스트링입니다. 유효한 명칭은 x, y, z, 그리고 m입니다.

source: <![CDATA[ -- Scale M value by 2 SELECT ST_AsText( ST_SwapOrdinates( ST_Scale( ST_SwapOrdinates(g,'xm'), 2, 1 ), 'xm') ) FROM ( SELECT 'POINT ZM (0 0 0 2)'::geometry g ) foo; st_astext -------------------- POINT ZM (0 0 0 4) ]]>
ja: <![CDATA[ -- M値を2倍にする -- (訳注: M値の拡大縮小はST_Scaleだけではできません) SELECT ST_AsText( ST_SwapOrdinates( ST_Scale( ST_SwapOrdinates(g,'xm'), 2, 1 ), 'xm') ) FROM ( SELECT 'POINT ZM (0 0 0 2)'::geometry g ) foo; st_astext -------------------- POINT ZM (0 0 0 4) ]]>
ko_kr: <![CDATA[ -- M값을 2배로 만듭니다. SELECT ST_AsText( ST_SwapOrdinates( ST_Scale( ST_SwapOrdinates(g,'xm'), 2, 1 ), 'xm') ) FROM ( SELECT 'POINT ZM (0 0 0 2)'::geometry g ) foo; st_astext -------------------- POINT ZM (0 0 0 4) ]]>

source: Returns a geometry that represents the point set union of the Geometries.
de: Gibt eine Geometrie zurück, welche der mengentheoretischen Vereinigung der Geometrien entspricht.
ja: ジオメトリの結合の点集合を表現するジオメトリを返します。
ko_kr: 도형들의 포인트들을 통합한 집합을 표현하는 도형을 반환합니다.
