Repository: postgis/postgis
Catalog: doc/po/*/reference_type.xml.po
Languages: de, fr, it_it, pt_br

source: This section lists the PostgreSQL data types installed by PostGIS. Note we describe the casting behavior of these which is very important especially when designing your own functions.
de: Dieser Abschnitt listet die von PostGIS installierten PostgreSQL-Datentypen auf. Beachten Sie bitte die hier beschriebene Verhaltensweise bei der Typumwandlung. Diese ist insbesondere dann sehr wesentlich, wenn Sie Ihre eigenen Funktionen entwerfen.
fr: Cette section liste les types de données PostgreSQL installés par PostGIS. Leurs méthodes de transtypage sont également décrites, ce qui est particulièrement important lors de la définition/création de nouvelles fonctions.
it_it: Questa sezione illustra i tipi di dati di PostgreSQL che vengono installati da Postgis. Vengono illustrati anche i metodi per eseguire il cast tra diversi tipi, cosa particolarmente importante per la realizzazione di funzioni proprie.
pt_br: Essa seção lista os tipos de dados PostgreSQL instalados pelo PostGIS. Note que descrevemos que o comportamento desses é muito importante , especialmente quando designando suas próprias funções.

source: A Cast is when one type is coerced into another type. PostgreSQL is unique from most databases in that it allows you to define casting behavior for custom types and the functions used for casting. A cast can be specified as automatic in which case, you do not have to do a CAST(myfoo As otherfootype) or myfoo::otherfootype if you are feeding it to a function that only works with otherfootype and there is an automatic cast in place for it.
de: Ein CAST/Typumwandlung liegt dann vor, wenn die Umwandlung eines Datentyps in einen anderen Datentyp erzwungen wird. PostgreSQL unterscheidet sich von den meisten Datenbanksystemen, indem die Verhaltensweise der Typumwandlung bei benutzerdefinierten Datentypen, als auch die dafür zu verwendenden Funktionen, festgelegt werden können. Eine Typumwandlung kann automatisiert werden, wodurch man sich "CAST(myfoo AS otherfootype)" bzw. myfoo::otherfootype" dann ersparen kann, wenn man eine Funktion damit füttert die nur mit "otherfootype" arbeiten kann und ein automatischer CAST dafür vorhanden ist.
fr: Un transtypage ou cast est l'opération visant à changer un type de données vers un autres type. PostgreSQL offre la fonctionnalité assez unique de pouvoir définir les comportements des types spécifiques lors du transtypage et les fonctions utilisées lors du transtypage. Un transtypage peut être défini comme automatique, auquel cas il n'est pas nécessaire d'utiliser la fonction CAST(myfoo As otherfootype) ou myfoo::otherfootype lors de l'appel d'une fonction supportant uniquement otherfootype: le transtypage sera automatique.
it_it: Effettuare il cast significa forzare un tipo in un altro tipo di dato. PostgreSQL è tra i pochi database che offrono la possibilità di definire comportamento di casting per tipi personalizzati e le funzioni usate per il casting. Un cast può essere definito come automatico: non è necessario utilizzare la funzione CAST(myfoo As otherfootype) oppure myfoo::otherfootype se si esegue una funzione che supporta unicamente il tipo otherfootype. In questo caso il cast avverrà automaticamente.
pt_br: Um Cast é quando um tipo é coagido a outro tipo. O PostgreSQL é o único, em vários banco de dados, que permite que você defina o comportamento casting para tipos personalizados e as funções usadas para casting. Um cast pode ser especificado como automático em cada caso, se você não tem que fazer um CAST(myfoo Como otherfootype) ou myfoo::otherfootype se você está alimentando isso com a função que só funciona com otherfootype e existe um cast automático no lugar.

source: The danger of relying on automatic cast behavior is when you have an overloaded function say one that takes a box2d and one that takes a box3d but no geometry. What happens is that both functions are equally good to use with geometry since geometry has an autocast for both -- so you end up with an ambiguous function error. To force PostgreSQL to choose, you do a CAST(mygeom As box3d) or mygeom::box3d.
de: Wenn man sich auf das Verhalten bei der automatischen Typumwandlung verlässt, besteht ein Risiko bei überladenen Funktionen. Wenn z.B. eine Funktion eine Box2D und eine Box3D aber nicht den geometrischen Datentyp entgegennimmt. Was passiert ist, dass beide Funktionen gleich gut mit dem geometrischen Datentyp verwendet werden können, da dieser eine automatische Typumwandlung für beide hat - somit kommt es wegen Mehrdeutigkeit zu einem Funktionsfehler. Um PostgreSQL eine Wahl aufzuzwingen, verwenden Sie bitte CAST(mygeom As box3d) oder mygeom::box3d.
fr: Le danger lors de l'utilisation d'un transtypage automatique peut survenir si, par exemple, il existe une fonction surchargée prenant en paramètre une box2d et une prenant une box3d, mais aucune acceptant une geometry. Dans ce cas, les deux fonctions peuvent être utilisées avec un type geometry sachant que ce type peut être transtypé automatiquement vers les deux types box2d et box3d. Une erreur survient alors indiquant que la fonction est ambigüe. Pour forcer PostgreSQL à utiliser la bonne fonction, il faut utiliser la fonction CAST(mygeom As box3d) ou mygeom::box3d.
it_it: Un rischio dell'usare un cast automatico può esserci quando si ha una funzione sovraccaricata, per esempio una funzione che accetta come argomento un box2d e un'altra che accetta un box3d ma nessuna che accetti un geometry. In questo caso le due funzioni possono essere utilizzate con un tipo geometry, perché geometry supporta il cast automatico verso box2d e box3d, e si avrà quindi un errore che indica che la funzione è ambigua. Per forzare PostgreSQL ad effettuare la scelta giusta bisogna effettuare un cast specifico con CAST(mygeom AS box3d) oppure mygeom::box3d
pt_br: O perigo de confiar no comportamento cast automático, é quando você tem uma função sobrecarregada que diz que pega uma caixa2d e uma que pega uma caixa3d, mas sem geometria. O que acontece é que ambas funções são igualmente boas com geometria, já que a geometria tem um autocast para ambas -- então, você acaba com um erro de função ambíguo. Para forçar o PostgreSQL a escolher, você faz um CAST(mygeom As box3d) ou mygeom::box3d.

source: <emphasis>At least as of PostgreSQL 8.3</emphasis> - Everything can be CAST to text (presumably because of the magical unknown type), so no defined CASTS for that need to be present for you to CAST an object to text.
de: <emphasis>Zumindest ab PostgreSQL 8.3</emphasis> - können alle Datentypen mit CAST in Text umgewandelt werden (vermutlich wegen des magischen "unknown" Datentyps), weswegen keine vordefinierten CASTs vorhanden sein müssen, um ein Objekt in einen Text umzuwandeln.
fr: <emphasis>A partir de PostgreSQL 8.3</emphasis> - Tout peut être transtypé en texte (type text). Il n'est donc pas nécessaire de définir un opérateur de transtypage spécifique vers le type text..
it_it: <emphasis>A partire dalla versione PostgreSQL 8.3</emphasis> - È possibile effettuare il CAST di ogni tipo a "text" (presumibilmente per merito del magico tipo "unknown"), quindi non è necessario definire esplicitamente il CAST di un oggetto a "text".
pt_br: <emphasis>Ao menos como de PostgreSQL 8.3</emphasis> - Tudo pode ser CAST para o texto (presumidamente por causa do tipo desconhecido mágico), portanto, CASTS indefinidos para isso precisam estar presentes para você CAST um objeto para o texto.

source: PostgreSQL PostGIS Geometry/Geography/Box Types
de: PostgreSQL und PostGIS Datentypen - Geometry/Geography/Box
fr: Les types Geometry/Geography/Box de PostgreSQL PostGIS
it_it: PostgreSQL PostGIS tipi Geometry/Geography/Box

source: A box composed of x min, ymin, xmax, ymax. Often used to return the 2d enclosing box of a geometry.
de: Ein Rechteck das aus Xmin, Ymin, Xmax und Ymax gebildet wird. Wird oft verwendet, um das umschreibende Rechteck einer Geometrie in 2D zu erhalten.
fr: Un rectangle composé des coordonnées xmin, ymin, xmax, ymax. Souvent utilisé pour renvoyer la boite 2d d'une géométrie.
it_it: Un rettangolo composto dalle coordinate xmin,ymin,xmax,ymax. Spesso è usato per ritornare l'estensione 2D della geometria.
pt_br: Uma caixa composta de x min, ymin, xmax, ymax. Normalmente usada para retornar a caixa 2d enclosing de uma geometria.

source: Description
de: Beschreibung
it_it: Descrizione
pt_br: Descrição

source: box2d is a spatial data type used to represent the enclosing box of a geometry or set of geometries. ST_Extent in earlier versions prior to PostGIS 1.4 would return a box2d.
de: Box2D ist ein geometrischer Datentyp, der das umschreibende Rechteck einer oder mehrerer geometrischer Objekte abbildet. In Vorgängerversionen von PostGIS 1.4 wurde von ST_Extent eine Box2D zurückgeben.
fr: box2d est un type spatial utilisé pour représenter la boite englobante d'une géométrie ou d'un ensemble de géométries. Dans les versions de PostGIS antérieures à 1.4, la fonction ST_Extent renvoie une box2d.
it_it: box2d è un tipo di dato spaziale usato per rappresentare in rettangolo contenente una geometria o un insieme di geometrie. In versioni precedenti Postgis 1.4, la funzione ST_Extent ritorna un box2d.
pt_br: a caixa2d é um tipo de dados espacias usados para representar a caixa enclosing de uma geometria ou conjunto de geometrias. A ST_Extent em ersões mais antigas, anteriores a PostGIS 1.4, retornariam uma caixa2d.

source: A box composed of x min, ymin, zmin, xmax, ymax, zmax. Often used to return the 3d extent of a geometry or collection of geometries.
de: Ein Quader der aus Xmin, Ymin, Zmin, Xmax, Ymax und Zmax gebildet wird. Wird oft verwendet, um die 3D Ausdehnung einer Geometrie oder einer Sammelgeometrie zu erhalten.
fr: Une boite composée des coordonnées xmin, ymin, zmin, xmax, ymax, zmax. Souvent utilisé pour renvoyer la boite 3d d'une géométrie ou d'une collection de géométries.
it_it: Un parallelepipedo composto dalle coordinate xmin, ymin, zmin, xmax, ymax, zmax. Spesso usato per ritornare l'estensione 3D di una geometria o di una collezione di geometrie.
pt_br: Uma caixa composta de x min, ymin, zmin, xmax, ymax, zmax. Normalmente usada para a extensão 3d de uma geometria ou coleção de geometrias.

source: box3d is a postgis spatial data type used to represent the enclosing box of a geometry or set of geometries. ST_3DExtent returns a box3d object.
de: Box3D ist ein geometrischer Datentyp, der den umschreibenden Quader einer oder mehrerer geometrischer Objekte abbildet. ST_3DExtent gibt ein Box3D-Objekt zurück.
fr: box3d est un type spatial utilisé pour représenter la boite englobante d'une géométrie ou d'un ensemble de géométries en 3 dimensions. La fonction ST_3DExtent renvoie une box3d.
it_it: box3d è un tipo spaziale di Postgis usato per rappresentare il parallelepipedo contente una geometria o un insieme di geometrie. La funzione ST_3DExtent ritorna un oggetto box3d.
pt_br: a caixa3d é um tipo de dados postgis usados para representar a caixa enclosing de um ageometria ou conjunto de geometrias. A ST_3DExtent retorna um objeto caixa3d.

source: Casting Behavior
de: Typumwandlung
fr: Comportement du transtypage
it_it: Comportamento in caso di CAST
pt_br: Comportamento Casting

source: This section lists the automatic as well as explicit casts allowed for this data type
de: Dieser Abschnitt beschreibt sowohl die automatischen, als auch die expliziten Typumwandlungen, die für diesen Datentyp erlaubt sind.
fr: Cette section liste les transtypages automatiques et explicites autorisés pour ce type de données
it_it: Questa sezione illustra le modalità di CAST - automatici e espliciti - permessi per questo tipo di dato
pt_br: Essa seção lista os casts automáticos bem como os explícitos permitidos para esse tipo de dados

source: Cast To
de: Typumwandlung nach
fr: Transtypage vers
it_it: Cast verso

source: Behavior
de: Verhaltensweise
fr: Comportement
it_it: Comportamento
pt_br: Comportamento

source: automatic
de: automatisch
fr: automatique
it_it: automatico
pt_br: automático

source: Planar spatial data type.
de: Flächiger räumlicher Datentyp.
fr: Type de données spatiales planaires
it_it: Tipi di dati spaziali piani.
pt_br: Tipo de dados espaciais planares

source: geometry is a fundamental PostGIS spatial data type used to represent a feature in the Euclidean coordinate system.
de: Der Datentyp "geometry" ist der elementare räumliche Datentyp von PostGIS zur Abbildung eines Geoobjektes in das kartesische Koordinatensystem.

source: All spatial operations on geometry are using units of the Spatial Reference System the geomtry is in.
de: Alle räumlichen Operationen an einer Geometrie verwenden die Einheiten des Koordinatenreferenzsystems in dem die Geometrie vorliegt.

source: See Also
de: Siehe auch
fr: Voir aussi
it_it: Vedi anche
pt_br: Veja também

source: A spatial datatype with two fields - geom (holding a geometry object) and path[] (a 1-d array holding the position of the geometry within the dumped object.)
de: Ein räumlicher Datentyp mit zwei Attributen - geom (enthält ein Geometrieobjekt) und Path[] (ein 1-dimensionales Feld, welches die Position der Geometrie innherhalb des entladenen Objektes angibt).
fr: Un type spatial comportant deux champs - geom (stockant un objet géométrique) et path[] (un tableau uni dimensionnel 1-d stockant la position de la géométrie dans la collection.)
it_it: Un tipo di dato spaziale composto da due campi: geom (contenente un oggetto geometry) e path[] (un array unidimensionale 1-d contenente la posizione della geometria all'interno della collezione).
pt_br: Um tipo de dados espacias com dois campos - geom (possuindo um objeto geométrico) e path[] (uma ordem 1-d possuindo a posição da geometria com o objeto rejeitado).

source: geometry_dump is a compound data type consisting of a geometry object referenced by the .geom field and path[] a 1-dimensional integer array (starting at 1 e.g. path[1] to get first element) array that defines the navigation path within the dumped geometry to find this element. It is used by the ST_Dump* family of functions as an output type to explode a more complex geometry into its constituent parts and location of parts.
de: geometry_dump ist ein zusammengesetzter Datentyp, der aus einem geometrischen Objekt - wird durch das Attribut .geom referenziert - und path[] - einem 1-dimensionalen ganzzahligen Feld (beginnt mit 1, z.B.: path[1] gibt das erste Element des Feldes) das den Navigationspfad innerhalb der ausgeladenen Geometrie zur Auffindung von einzelnen Elementen bestimmt. Es wird von der Funktionsfamilie "ST_Dump*" als Ausgabetyp verwendet, um eine komplexere Geometrie in ihre Bestandteile und in die Position dieser Bestandteile zu zerlegen.
fr: geometry_dump est un type de données composite consistant en un objet géométrique référencé par le champ .geom et un tableau uni dimensionnel d'entiers référencé par le champ path[] donnant la position de chaque géométrie dans la collection (L'index du tableau démarre à 1. Par ex: path[1] pour obtenir le premier élément). Ce type utilisé par la famille de fonctions ST_Dump* comme type de retour pour exploser une géométrie complexe en ses parties élémentaires et les positions de ces parties.
it_it: geometry_dump è un tipo composto formato da un oggetto geometry, associato al campo .geom, e path[] un array unidimensionale di interi (l'array inizia con 1. Per esempio path[1] ritorna il primo elemento) che definisce il percorso di ogni geometria all'interno della collezione.
pt_br: geometry_dump é um tipo composto de dados, que consiste em um objeto referido pelo campo e path[] .geom, uma ordem de inteiros 1-dimesional (começando por 1 ex.: path[1] para pegar o primeiro elemento), a qual define o path de navegação com a geometria rejeitada para encontrar esse elemento. Isso é usado pela família de funções ST_Dump*, como tipo de saída para detonar uma geometria mais complexa dentro de suas partes constituintes e localização de partes.

source: Ellipsoidal spatial data type.
de: Ein Datentyp mit Ellipsoidkoordinaten.
fr: Type spatial ellipsoïdal
it_it: Tipi spaziali ellissoidi.
pt_br: Tipo de dado espacial elipsoidal.

source: geography is a spatial data type used to represent a feature in the round-earth coordinate system.
de: Der geographische Datentyp "Geography" wird zur Abbildung eines Geoobjektes im geographischen Kugelkoordinatensystem verwendet.
fr: geography est un type de données spatiales utilisé pour représenter une entité dans les coordonnées sphériques de la terre.
it_it: geography è un tipo spaziale usato per rappresentare un'entità in un sistema di coordinate sferico valido per l'intero pianeta.
pt_br: geografia é um tipo de dado espacial usado para representar uma característica no sistema de coordenada da terra-redonda.

source: explicit
de: explizit
fr: explicite
it_it: Esplicito
pt_br: explícito

source: <refname>geometry</refname>
it_it: <entry>geometry</entry>

source: geometry is a fundamental postgis spatial data type used to represent a feature in the Euclidean coordinate system.
fr: Le type geometry est un type de données capital dans PostGIS, utilisé pour modéliser une entité dans un système de coordonées euclidien.
pt_br: geometria é um tipo de dados espaciais do postgis fundamental usado para representar uma característica no sistema de coordenadas euclidianas.

source: text
pt_br: texto

source: <refname>geography</refname>
pt_br: <refname>geografia</refname>
