Repository: postgis/postgis
Catalog: doc/po/*/reference_transaction.xml.po
Languages: de, ko_kr

source: Long Transactions Support
de: Unterstützung für lange andauernde Transaktionen/Long Transactions
ko_kr: 장기 실행 트랜잭션(Long Transaction) 지원

source: This module and associated pl/pgsql functions have been implemented to provide long locking support required by <ulink url="http://www.opengeospatial.org/standards/wfs">Web Feature Service</ulink> specification.
de: Dieses Modul und die zugehörigen pl/pgsql Funktionen wurden implementiert, um "long locking" Unterstützung anzubieten. Dies wird von der <ulink url="http://www.opengeospatial.org/standards/wfs">Web Feature Service</ulink> Spezifikation verlangt.
ko_kr: 이 모듈 및 관련 PL/pgSQL 함수들은 <ulink url="http://www.opengeospatial.org/standards/wfs">웹 피처 서비스(Web Feature Service)</ulink> 사양서가 요구하는 장기 잠금(long locking) 을 지원하기 위해 구현됐습니다.

source: Users must use <ulink url="http://www.postgresql.org/docs/current/static/transaction-iso.html">serializable transaction level</ulink> otherwise locking mechanism would break.
de: Es muss <ulink url="http://www.postgresql.org/docs/current/static/transaction-iso.html">serializable transaction level</ulink> angewandt werden, da sonst der "Locking" Mechanismus versagt.
ko_kr: 사용자는 <ulink url="http://www.postgresql.org/docs/current/static/transaction-iso.html">직렬 가능 트랜잭션 레벨(serializable transaction level)</ulink> 을 이용해야 합니다. 그렇지 않으면 잠금 기제(locking mechanism)가 중단될 것입니다.

source: <refpurpose>Add an authorization token to be used in current transaction.</refpurpose>
de: <refpurpose>Fügt einen Berechtigungsschlüssel für die aktuelle Transaktion hinzu.
ko_kr: <refpurpose>현재 트랜잭션에 이용될 승인 토큰을 추가합니다.</refpurpose>

source: Description
de: Beschreibung
ko_kr: 설명

source: <para>Add an authorization token to be used in current transaction.</para>
de: <para>Fügt einen Berechtigungsschlüssel für die aktuelle Transaktion hinzu.</para>
ko_kr: <para>현재 트랜잭션에 이용될 승인 토큰을 추가합니다.</para>

source: Creates/adds to a temp table called temp_lock_have_table the current transaction identifier and authorization token key.
de: Fügt zu einer temporären Tabelle mit der Bezeichnung "temp_lock_have_table" den aktuellen Identifikator der Transaktion und einen Berechtigungsschlüssel hinzu.
ko_kr: 현재 트랜잭션의 식별자 및 승인 토큰 키를 가진 temp_lock_have_table이란 명칭의 임시 테이블을 생성/추가합니다.

source: Availability: 1.1.3
de: Verfügbarkeit: 1.1.3
ko_kr: 1.1.3 버전부터 사용할 수 있습니다.

source: Examples
de: Beispiele
ko_kr: 예시

source: SELECT LockRow('towns', '353', 'priscilla'); BEGIN TRANSACTION; SELECT AddAuth('joey'); UPDATE towns SET the_geom = ST_Translate(the_geom,2,2) WHERE gid = 353; COMMIT; ---Error-- ERROR: UPDATE where "gid" = '353' requires authorization 'priscilla'
ko_kr: SELECT LockRow('towns', '353', 'priscilla'); BEGIN TRANSACTION; SELECT AddAuth('joey'); UPDATE towns SET the_geom = ST_Translate(the_geom,2,2) WHERE gid = 353; COMMIT; -- 오류 -- ERROR: UPDATE where "gid" = '353' requires authorization 'priscilla'

source: See Also
de: Siehe auch
ko_kr: 참고

source: Creates trigger on a table to prevent/allow updates and deletes of rows based on authorization token.
de: Legt einen Trigger auf eine Tabelle an um, basierend auf einen Token, Updates und Deletes von Zeilen zu verhindern oder zu erlauben.
ko_kr: 승인 토큰을 바탕으로, 테이블에 대해 행들의 업데이트 및 삭제를 금지/허락하는 트리거를 생성합니다.

source: Creates trigger on a table to prevent/allow updates and deletes of rows based on authorization token. Identify rows using &lt;rowid_col&gt; column.
de: Legt einen Trigger auf eine Tabelle an, um über ein Autorisierungs-Token, Updates und Deletes von Zeilen zu verhindern oder zu erlauben. Identifiziert Zeilen über die Spalte &lt;rowid_col&gt;.
ko_kr: 승인 토큰을 바탕으로, 테이블에 대해 행들의 업데이트 및 삭제를 금지/허락하는 트리거를 생성합니다. &lt;rowid_col&gt; 열을 이용해서 행을 식별합니다.

source: If a_schema_name is not passed in, then searches for table in current schema.
de: Wenn "a_schema_name" nicht angegeben ist, wird im aktuellen Schema nach der Tabelle gesucht.
ko_kr: a_schema_name을 설정하지 않으면, 현재 스키마에서 테이블을 검색합니다.

source: If an authorization trigger already exists on this table function errors.
de: Wenn ein Autorisierungstrigger auf dieser Tabelle bereits existiert, gibt die Funktion eine Fehlermeldung aus.
ko_kr: 해당 테이블에 이미 승인 트리거가 존재할 경우, 함수가 오류를 일으킵니다.

source: If Transaction support is not enabled, function throws an exception.
de: Wenn die Transaktionsunterstützung nicht aktiviert wurde, wird ein Fehler gemeldet.
ko_kr: 트랜잭션 지원이 활성화돼 있지 않을 경우, 함수가 예외를 발생시킵니다.

source: <refpurpose>Disable long transaction support. This function removes the long transaction support metadata tables, and drops all triggers attached to lock-checked tables.</refpurpose>
de: <refpurpose>Deaktivert die Unterstützung für lang andauernde Transaktionen. Diese Funktion entfernt die Metadatentabellen der Unterstützung für lang andauernde Transaktionen und löscht alle Trigger der auf Lock geprüften Tabellen.</refpurpose>
ko_kr: <refpurpose>장기 실행 트랜잭션 지원을 비활성화시킵니다. 이 함수는 장기 실행 트랜잭션 지원 메타데이터 테이블을 제거하고, 잠금을 확인한(lock-checked) 테이블에 부여된 모든 트리거를 삭제합니다.</refpurpose>

source: <para>Disable long transaction support. This function removes the long transaction support metadata tables, and drops all triggers attached to lock-checked tables.</para>
de: <para>Deaktiver die Unterstützung von lang andauernden Transaktionen. Diese Funktion entfernt die Metadatentabellen der Unterstützung für lang andauernde Transaktionen und löscht alle Trigger der auf Locks überprüften Tabellen.</para>
ko_kr: <para>장기 실행 트랜잭션 지원을 비활성화시킵니다. 이 함수는 장기 실행 트랜잭션 지원 메타데이터 테이블을 제거하고, 잠금을 확인한(lock-checked) 테이블에 부여된 모든 트리거를 삭제합니다.</para>

source: Drops meta table called <varname>authorization_table</varname> and a view called <varname>authorized_tables</varname> and all triggers called <varname>checkauthtrigger</varname>
de: Löscht die Metadatentabelle mit der Bezeichnung <varname>authorization_table</varname> und den View mit der Bezeichnung <varname>authorized_tables</varname>, sowie alle Trigger mit der Bezeichnung <varname>checkauthtrigger</varname>
ko_kr: <varname>authorization_table</varname> 이라는 메타 테이블, <varname>authorized_tables</varname> 라는 뷰, 그리고 <varname>checkauthtrigger</varname> 라는 모든 트리거들을 삭제합니다.

source: SELECT DisableLongTransactions(); --result-- Long transactions support disabled
ko_kr: SELECT DisableLongTransactions(); -- 결과 -- Long transactions support disabled

source: <refpurpose>Enable long transaction support. This function creates the required metadata tables, needs to be called once before using the other functions in this section. Calling it twice is harmless.</refpurpose>
de: <refpurpose>Akktivert die Unterstützung für lang andauernde Transaktionen. Diese Funktion erzeut die benötigten Metadatentabellen und muss einmal aufgerufen werden bevor die anderen Funktionen dieses Abschnitts angewandt werden. Ein zweimaliger Aufruf ist harmlos.</refpurpose>
ko_kr: <refpurpose>장기 실행 트랜잭션 지원을 활성화시킵니다. 이 함수는 필수적인 메타데이터 테이블들을 생성하는데, 이 단원에 있는 다른 함수들을 이용하기 전에 한번 호출해줘야 합니다. 두 번 호출해도 상관없습니다.</refpurpose>

source: <para>Enable long transaction support. This function creates the required metadata tables, needs to be called once before using the other functions in this section. Calling it twice is harmless.</para>
de: <para>Akktivert die Unterstützung für lang andauernde Transaktionen. Diese Funktion erzeut die benötigten Metadatentabellen und muss einmal aufgerufen werden bevor die anderen Funktionen dieses Abschnitts angewandt werden. Ein zweimaliger Aufruf ist harmlos.</para>
ko_kr: <para>장기 실행 트랜잭션 지원을 활성화시킵니다. 이 함수는 필수적인 메타데이터 테이블들을 생성하는데, 이 단원에 있는 다른 함수들을 이용하기 전에 한번 호출해줘야 합니다. 두 번 호출해도 상관없습니다.</para>

source: Creates a meta table called <varname>authorization_table</varname> and a view called <varname>authorized_tables</varname>
de: Erzeugt eine Metatabelle mit der Bezeichnung <varname>authorization_table</varname> und den View <varname>authorized_tables</varname>
ko_kr: <varname>authorization_table</varname> 이라는 메타 테이블 및 <varname>authorized_tables</varname> 라는 뷰를 생성합니다.

source: SELECT EnableLongTransactions(); --result-- Long transactions support enabled
ko_kr: SELECT EnableLongTransactions(); -- 결과 -- Long transactions support enabled

source: Set lock/authorization for specific row in table
de: Setzt einen Lock/Autorisierung auf eine bestimmte Zeile in der Tabelle
ko_kr: 테이블 내부의 특정 행에 대한 잠금/승인을 설정합니다.

source: Set lock/authorization for specific row in table &lt;authid&gt; is a text value, &lt;expires&gt; is a timestamp defaulting to now()+1hour. Returns 1 if lock has been assigned, 0 otherwise (already locked by other auth)
de: Setzt einen Lock/eine Autorisierung für eine bestimmte Zeile in der Tabelle &lt;authid&gt; . &lt;authid&gt; ist ein Text, &lt;expires&gt; ist ein Zeitstempel mit dem Standardwert now()+1hour. Gibt 1 aus, wenn ein Lock zugewiesen wurde, ansonsten 0 (bereits über eine andere Authentifizierung gesperrt)
ko_kr: 테이블 내부의 특정 행에 대한 잠금/승인을 설정합니다. &lt;authid&gt;는 텍스트 값, &lt;expires&gt;는 기본값이 now()+1시간인 타임스탬프입니다. 잠금이 할당된 경우 1을 반환하고, 그렇지 않을 (이미 다른 승인을 받아 잠겨 있는) 경우 0을 반환합니다.

source: SELECT LockRow('public', 'towns', '2', 'joey'); LockRow ------- 1 --Joey has already locked the record and Priscilla is out of luck SELECT LockRow('public', 'towns', '2', 'priscilla'); LockRow ------- 0
de: SELECT LockRow('public', 'towns', '2', 'joey'); LockRow ------- 1 --Joey hat den Datensatz bereits gesperrt und die arme Priscilla hat das Nachsehen SELECT LockRow('public', 'towns', '2', 'priscilla'); LockRow ------- 0
ko_kr: SELECT LockRow('public', 'towns', '2', 'joey'); LockRow ------- 1 -- 조이가 이미 레코드를 잠궜기 때문에 플리실라가 잠글 수 없습니다. SELECT LockRow('public', 'towns', '2', 'priscilla'); LockRow ------- 0

source: <refpurpose>Remove all locks held by specified authorization id. Returns the number of locks released.</refpurpose>
de: <refpurpose>Entfernt alle Locks einer bestimmten Authorisierungs-ID. Gibt die Anzahl der freigegebenen Locks aus.</refpurpose>
ko_kr: <refpurpose>특정 승인 ID가 실행한 모든 잠금을 제거합니다. 해제된 잠금 개수를 반환합니다.</refpurpose>

source: <para>Remove all locks held by specified authorization id. Returns the number of locks released.</para>
de: <para>Entfernt alle Locks einer bestimmten Authorisierungs-ID. Gibt die Anzahl der freigegebenen Locks aus.</para>
ko_kr: <para>특정 승인 ID가 실행한 모든 잠금을 제거합니다. 해제된 잠금 개수를 반환합니다.</para>
