Repository: postgis/postgis
Catalog: doc/po/*/reference_processing.xml.po
Languages: de, ja, ko_kr, zh_hans

source: Geometry Processing
de: Geometrieverarbeitung
ja: ジオメトリ処理関数
ko_kr: 도형 공간 처리
zh_hans: 几何处理

source: (T) Returns a geometry covering all points within a given distance from the input geometry.
de: (T) Gibt eine Geometrie zurück, welche alle Punkte innerhalb einer gegebenen Entfernung von der Eingabegeometrie beinhaltet.
ja: (T) このジオメトリからの距離が指定された距離以下となる点全てを表現するジオメトリを返します。
ko_kr: 입력 도형으로부터 주어진 거리 안에 있는 모든 포인트들을 커버하는 도형을 반환합니다.

source: Description
de: Beschreibung
ja: 説明
ko_kr: 설명
zh_hans: 描述

source: Returns a geometry/geography that represents all points whose distance from this Geometry/geography is less than or equal to distance.
de: Gibt eine Geometrie/Geographie zurück, die alle Punkte repräsentiert, deren Entfernung von dieser Geometrie/Geographie kleiner oder gleich der gegebenen Entfernung ist.
ja: このジオメトリ/ジオグラフィからの距離が指定された距離以下となる点全てを表現するジオメトリ/ジオグラフィを返します。
ko_kr: 해당 도형/지리형으로부터의 거리가 주어진 거리보다 짧거나 동등한 모든 포인트들을 표현하는 도형/지리형을 반환합니다.

source: Geometry: Calculations are in the Spatial Reference System of the geometry. Introduced in 1.5 support for different end cap and mitre settings to control shape.
de: Geometrie: Berechnungen werden im Koordinatenreferenzsystem der Geometrie durchgeführt. Mit 1.5 wurde die Unterstützung unterschiedlicher Abschlussstücke/end-cap und Gehrungen/mitre eingeführt, um die Gestalt zu kontrollieren.
ja: ジオメトリ: 計算は、ジオメトリの空間参照系で行われます。形状制御のために異なる終端キャップと継ぎ目を設定する機能が1.5で導入されました。
ko_kr: 도형: 도형의 공간 참조 시스템 단위로 계산합니다. 1.5 버전부터 형상을 제어하기 위한 서로 다른 끝모양(endcap) 및 마이터(mitre) 설정을 지원하고 있습니다.

source: Negative radii: For polygons, a negative radius can be used, which will shrink the polygon rather than expanding it.
de: Negative Radien: Bei Polygonen kann ein negativer Radius vergewendet werden, wodurch das Polygon geschrumpft anstatt vergrößert wird.
ja: 負の半径: ポリゴンでは、負の半径が使えます。ポリゴンを拡張させずに縮小させることができます。
ko_kr: 음의 반경(negative radius): 폴리곤에 대해 음의 반경을 쓸 수 있습니다. 음의 반경은 폴리곤을 늘어나게 하기 보다는 줄어들게 할 것입니다.

source: Geography: For geography this is really a thin wrapper around the geometry implementation. It first determines the best SRID that fits the bounding box of the geography object (favoring UTM, Lambert Azimuthal Equal Area (LAEA) north/south pole, and falling back on mercator in worst case scenario) and then buffers in that planar spatial ref and retransforms back to WGS84 geography.
de: Geographie: Beim geographischen Datentyp handelt es sich lediglich um einen schlanken Adapter, der um die geometrische Implementation herumgelegt wurde. Zuerst wird die passenste SRID für das Umgebungsrechteck des geographischen Objektes bestimmt (bevorzugt UTM, Lambert Azimuthal Equal Area (LAEA) Nord/Süd Pol, im schlimmsten Fall wird auf Mercator zurückgegriffen), dann im planaren Koordinatenreferenzsystem gepuffert und anschließend nach WGS84 Geographie zurück transformiert.
ja: ジオグラフィ: ジオメトリ実装にかぶさる、薄いラッパです。ジオグラフィオブジェクトのバウンディングボックスに最適なSRIDを決定し (UTMが望ましいですが、ランベルト正積方位図法 (北/南)や、最悪のシナリオではメルカトルに頼ります)、その平面でバッファを生成し、WGS84ジオグラフィに戻します。
ko_kr: 지리형: 지리형에 대해, 이 함수는 도형 구현을 둘러싼 정말로 얇은 래퍼입니다. 이 함수는 먼저 지리형 객체의 경계 상자에 가장 어울리는 SRID를 (UTM 또는 람베르트 북극/남극 방위정적도법(Lambert Azimuthal Equal Area)을 선호하며, 최악의 경우 메르카토르 도법에 의지해서) 결정한 다음 해당 평면 공간 참조 시스템 상에서 버퍼를 준 다음 WGS84 지리형으로 다시 변환합니다.

source: For geography this may not behave as expected if object is sufficiently large that it falls between two UTM zones or crosses the dateline
de: Beim geographischen Datentyp kann sich dies anders verhalten als erwartet, nämlich dann, wenn das Objekt entrsprechend groß ist und zwischen zwei UTM-Zonen fällt oder eine Datumsgrenze überschreitet.
ja: ジオグラフィでは、オブジェクトが二つのUTMゾーンをまたいだり、日付変更線をまたぐような、相当に大きい場合には、期待した通りの動作をないかも知れません。
ko_kr: 지리형의 경우, 두 UTM 구역에 걸치거나, 날짜변경선을 지나는 등 해당 객체가 충분히 크다면 정상적으로 동작하지 않을 수도 있습니다.

source: Availability: 1.5 - ST_Buffer was enhanced to support different endcaps and join types. These are useful for example to convert road linestrings into polygon roads with flat or square edges instead of rounded edges. Thin wrapper for geography was added. - requires GEOS &gt;= 3.2 to take advantage of advanced geometry functionality.
de: Verfügbarkeit: 1.5 - ST_Buffer wurde um die Unterstützung von Abschlusstücken/endcaps und Join-Typen erweitert. Diese können zum Beispiel dazu verwendet werden, um Linienzüge von Straßen in Straßenpolygone mit flachen oder rechtwinkeligen Abschlüssen anstatt mit runden Enden umzuwandeln. Ein schlanker Adapter für den geographischen Datentyp wurde hinzugefügt. - benötigt GEOS &gt;= 3.2 um diese erweiterte geometrische Funktionalität auszunutzen.
ja: Availability: 1.5 - ST_Bufferが異なる終端と継ぎ目の型に対応するよう強化されました。たとえば、道路ラインストリングを、丸の代わりに平坦や四角形の終端を持つ道路ポリゴンに変換するのに使います。ジオグラフィ用の薄いラッパが追加されました。最新のジオメトリ機能の利点を得るにはGEOS 3.2以上が必要です。
ko_kr: 1.5 버전부터 사용할 수 있습니다. ST_Buffer 함수가 다양한 끝모양(endcap) 및 접합(join) 유형을 지원하도록 개선됐습니다. 예를 들어 도로 라인스트링을 원형(rounded) 대신 절단형(flat) 또는 돌출 사각형(square) 끝모양을 가진 폴리곤 도로로 변환시키는 데 유용합니다. 지리형을 위한 얇은 래퍼도 추가됐습니다. 고급 도형 기능성의 장점을 취하려면 GEOS 3.2 이상 버전이 필요합니다.

source: The optional third parameter (currently only applies to geometry) can either specify number of segments used to approximate a quarter circle (integer case, defaults to 8) or a list of blank-separated key=value pairs (string case) to tweak operations as follows:
de: Der optionale dritte Parameter (zurzeit nur auf den geometrischen Datentyp anwendbar) ermöglicht es die Anzahl der Segmente zur Näherung eines Viertelkreises (Ganzzahl, standardmäßig 8) oder eine Liste von leerzeichengetrennten key=value Paaren (string case) festzulegen, um die Berechnungen wie folgt zu optimieren:
ja: 第3引数 (現在ジオメトリしか適用できません)で、4分の1円に近づけるための区分数を指定でき (整数の場合、デフォルトは8です)、また、空白区切りのkey=valueペア (文字列の場合)を、次に示す操作として指定することができます。
ko_kr: 선택적인 (현재 도형에만 적용되는) 세 번째 파라미터는 다음과 같이 사분원(quarter circle)의 근사치를 계산하는 데 쓰이는 선분의 개수(정수형, 기본값은 8)를 설정하거나, 또는 연산을 조정하기 위한 공백으로 구분된 키=값 쌍의 목록(문자열)을 설정할 수 있습니다.

source: 'quad_segs=#' : number of segments used to approximate a quarter circle (defaults to 8).
de: 'quad_segs=#' : Anzahl der Segmente die verwendet werden um einen Viertelkreis anzunähern (standardmäßig 8).
ja: 'quad_segs=#' : 4分の1円区分数に近づけるために使われる区分の数 (デフォルトは8)。
ko_kr: 'quad_segs=#' : 사분원(quarter circle)의 근사치를 계산하는 데 쓰이는 선분의 개수(기본값은 8)
zh_hans: 'quad_segs=#' ：用于近似四分之一圆的线段数（默认为 8）。

source: 'endcap=round|flat|square' : endcap style (defaults to "round", needs GEOS-3.2 or higher for a different value). 'butt' is also accepted as a synonym for 'flat'.
de: 'endcap=round|flat|square' : endcap style (standardmäßig "round", benötigt GEOS-3.2 oder höher für andere Werte). 'butt' kann auch als Synonym für 'flat' verwendet werden.
ja: 'endcap=round|flat|square' : 終端スタイル (デフォルトは"round"、他の値を取るにはGEOS 3.2以上が必要)。'butt'は'flat'の同意語として受け付けます。
ko_kr: 'endcap=round|flat|square' : 끝모양 스타일(기본값은 "원형(round)"으로 다른 값을 쓰려면 GEOS 3.2 이상 버전이 필요합니다). '절단형(flat)'의 동의어로 '밑동(butt)'도 쓸 수 있습니다.

source: 'join=round|mitre|bevel' : join style (defaults to "round", needs GEOS-3.2 or higher for a different value). 'miter' is also accepted as a synonym for 'mitre'.
de: 'join=round|mitre|bevel' : join style (standardmäßig "round", benötigt GEOS-3.2 oder höher für andere Werte). 'miter' kann auch als Synonym für 'mitre' verwendet werden.
ja: 'join=round|mitre|bevel' : 接続スタイル (デフォルトは"round"、他の値を取るにはGEOS 3.2以上が必要)。'miter'は'mitre'の同義語として受け付けます。
ko_kr: 'join=round|mitre|bevel' : 접합 스타일(기본값은 "원형(round)"으로 다른 값을 쓰려면 GEOS 3.2 이상 버전이 필요합니다). '마이터(mitre)'의 동의어로 '마이터(miter)'도 쓸 수 있습니다.

source: 'mitre_limit=#.#' : mitre ratio limit (only affects mitered join style). 'miter_limit' is also accepted as a synonym for 'mitre_limit'.
de: 'mitre_limit=#.#' : Gehrungsobergrenze (beeinflusst nur Gehrungsverbindungen). 'miter_limit' kann auch als Synonym von 'mitre_limit' verwendet werden.
ja: 'mitre_limit=#.#' : マイター比 (訳注: 継ぎ目の内側と外側の距離と線幅との比)の最大値 (継ぎ目スタイルがmiterである場合のみ有効)。'miter_limit'は'mitre_limit'の同義語として受け付けます。
ko_kr: 'mitre_limit=#.#' : 마이터 비율 제한(마이터 접합 스타일만 영향을 받습니다). 'mitre_limit'의 동의어로 'miter_limit'도 쓸 수 있습니다.

source: Units of radius are measured in units of the spatial reference system.
de: Die Einheiten des Radius werden in den Einheiten des Koordinatenreferenzsystems gemessen.
ja: 半径の単位は空間参照系の単位です。
ko_kr: 반경의 단위는 공간 참조 시스템의 단위로 측정됩니다.

source: The inputs can be POINTS, MULTIPOINTS, LINESTRINGS, MULTILINESTRINGS, POLYGONS, MULTIPOLYGONS, and GeometryCollections.
de: Es können POINTS, MULTIPOINTS, LINESTRINGS, MULTILINESTRINGS, POLYGONS, MULTIPOLYGONS, und Sammelgeometrien/GeometryCollections eingegeben werden.
ja: 入力は、POINT, MULTIPOINT, LINESTRING, MULTILINESTRING, POLYGON, MULTIPOLYGON, GEOMETRYCOLLECTIONが可能です。
ko_kr: 포인트, 멀티포인트, 라인스트링, 멀티라인스트링, 폴리곤, 멀티폴리곤 그리고 도형 집합을 입력받을 수 있습니다.

source: This function ignores the third dimension (z) and will always give a 2-d buffer even when presented with a 3d-geometry.
de: Diese Funktion ignoriert die dritte Dimension (z) und gibt immer einen 2-D Buffer zurück, sogar dann wenn eine 3D-Geometrie überreicht wird.
ja: この関数は第3次元 (Z軸)は無視し、3次元ジオメトリが与えられても、常に2次元バッファを返します。
ko_kr: 이 함수는 3차원 도형을 입력받더라도 세 번째 차원(Z)을 무시하고 언제나 2차원 버퍼를 반환할 것입니다.

source: Performed by the GEOS module.
de: Wird vom GEOS Modul ausgeführt
ja: GEOSモジュールで実現しています。
ko_kr: GEOS 모듈로 실행
zh_hans: 它是通过GEOS模块实现的。

source: People often make the mistake of using this function to try to do radius searches. Creating a buffer to a radius search is slow and pointless. Use <xref linkend="ST_DWithin"/> instead.
de: Fälschlicherweise wird diese Funktion oft zur Umkreissuche verwendet. Die Erzeugung eines Puffers zur Umkreissuche ist langsam und witzlos. Benutzen Sie bitte stattdessen <xref linkend="ST_DWithin"/>.
ja: この関数はしばしば間違って半径探索に使われています。バッファを生成して半径探索に使うのは遅いし無意味です。<xref linkend="ST_DWithin"/>を使います。
ko_kr: 사용자들이 반경 탐색 작업을 하려 할 때 이 함수를 이용하는 실수를 하곤 합니다. 반경 탐색을 위해 버퍼를 만드는 것은 느리고 효과도 없습니다. 대신 <xref linkend="ST_DWithin"/> 함수를 이용하십시오.

source: Examples
de: Beispiele
ja: 例
ko_kr: 예시
zh_hans: 示例

source: quad_segs=8 (default)
de: quad_segs=8 (Standardwert)
ja: quad_segs=8 (デフォルト)
ko_kr: quad_segs=8 (기본값)
zh_hans: quad_segs=8 (默认)

source: quad_segs=2 (lame)
de: quad_segs=2 (lahme Ente)
ja: quad_segs=2 (不十分)
ko_kr: quad_segs=2 (저질)
zh_hans: quad_secs=2（不足）

source: endcap=round join=round (default)
de: endcap=round join=round (Standardwert)
ja: endcap=round join=round (デフォルト)
ko_kr: endcap=round join=round (기본값)
zh_hans: endcap=round join=round (默认)

source: join=mitre mitre_limit=5.0 (default mitre limit)
ja: join=mitre mitre_limit=5.0 (デフォルトの最大マイター比)
ko_kr: join=mitre mitre_limit=5.0 (마이터 제한 기본값)
zh_hans: join=mitre mitre_limit=5.0 (默认最大斜接比率)

source: --A buffered point approximates a circle -- A buffered point forcing approximation of (see diagram) -- 2 points per quarter circle is poly with 8 sides (see diagram) SELECT ST_NPoints(ST_Buffer(ST_GeomFromText('POINT(100 90)'), 50)) As promisingcircle_pcount, ST_NPoints(ST_Buffer(ST_GeomFromText('POINT(100 90)'), 50, 2)) As lamecircle_pcount; promisingcircle_pcount | lamecircle_pcount ------------------------+------------------- 33 | 9 --A lighter but lamer circle -- only 2 points per quarter circle is an octagon --Below is a 100 meter octagon -- Note coordinates are in NAD 83 long lat which we transform to Mass state plane meter and then buffer to get measurements in meters; SELECT ST_AsText(ST_Buffer( ST_Transform( ST_SetSRID(ST_MakePoint(-71.063526, 42.35785),4269), 26986) ,100,2)) As octagon; ---------------------- POLYGON((236057.59057465 900908.759918696,236028.301252769 900838.049240578,235 957.59057465 900808.759918696,235886.879896532 900838.049240578,235857.59057465 900908.759918696,235886.879896532 900979.470596815,235957.59057465 901008.759918 696,236028.301252769 900979.470596815,236057.59057465 900908.759918696))
de: -- Ein gepufferter Punkt nähert sich einem Kreis an (sh. Abbildung) -- Ein gepufferter Punkt der die Annäherung mit 2 Punkten pro Viertelkreis erzwingt -- ist ein Polygon mit 8 Seiten (sh. Abbildung) SELECT ST_NPoints(ST_Buffer(ST_GeomFromText('POINT(100 90)'), 50)) As promisingcircle_pcount, ST_NPoints(ST_Buffer(ST_GeomFromText('POINT(100 90)'), 50, 2)) As lamecircle_pcount; promisingcircle_pcount | lamecircle_pcount ------------------------+------------------- 33 | 9 -- Ein leichterer aber lahmer Kreis mit 2 Punkten pro Viertelkreis ist ein Achteck -- Unterhalb ein 100 Meter Achteck -- Die Koordinaten sind in NAD 83 Länge/Breite und werden nach -- Mass state plane Meter transformiert um Messungen in Meter zu bekommen -- und anschließend gepuffert SELECT ST_AsText(ST_Buffer( ST_Transform( ST_SetSRID(ST_MakePoint(-71.063526, 42.35785),4269), 26986) ,100,2)) As octagon; ---------------------- POLYGON((236057.59057465 900908.759918696,236028.301252769 900838.049240578,235 957.59057465 900808.759918696,235886.879896532 900838.049240578,235857.59057465 900908.759918696,235886.879896532 900979.470596815,235957.59057465 901008.759918 696,236028.301252769 900979.470596815,236057.59057465 900908.759918696))
ja: -- ポイントに対する近似円バッファ -- 4分の1円を2点で近似するようポイントに施したバッファは8辺のポリゴンです。 -- (ダイアグラム参照) SELECT ST_NPoints(ST_Buffer(ST_GeomFromText('POINT(100 90)'), 50)) As promisingcircle_pcount, ST_NPoints(ST_Buffer(ST_GeomFromText('POINT(100 90)'), 50, 2)) As lamecircle_pcount; promisingcircle_pcount | lamecircle_pcount ------------------------+------------------- 33 | 9 --- 手軽だけれども不十分な円(4分の1円で2点だけの八角形) -- 次に示すのは100メートルの八角形です。 -- 座標系は、元はNAD 83経度緯度で、メートル単位マサチューセッツ州平面に変換してから、 -- メートルでバッファを取っています。 SELECT ST_AsText(ST_Buffer( ST_Transform( ST_SetSRID(ST_MakePoint(-71.063526, 42.35785),4269), 26986) ,100,2)) As octagon; ---------------------- POLYGON((236057.59057465 900908.759918696,236028.301252769 900838.049240578,235 957.59057465 900808.759918696,235886.879896532 900838.049240578,235857.59057465 900908.759918696,235886.879896532 900979.470596815,235957.59057465 901008.759918 696,236028.301252769 900979.470596815,236057.59057465 900908.759918696))

source: See Also
de: Siehe auch
ja: 関連情報
ko_kr: 참고
zh_hans: 相关信息

source: Creates an areal geometry formed by the constituent linework of given geometry
de: Erzeugt eine Flächengeometrie aus den einzelnen Linien einer gegebenen Geometrie
ja: 与えられたジオメトリの構成ラインから面ジオメトリを生成します。
ko_kr: 주어진 도형의 선분 구성 요소로 이루어진 면 도형을 생성합니다.

source: Creates an areal geometry formed by the constituent linework of given geometry. The return type can be a Polygon or MultiPolygon, depending on input. If the input lineworks do not form polygons NULL is returned. The inputs can be LINESTRINGS, MULTILINESTRINGS, POLYGONS, MULTIPOLYGONS, and GeometryCollections.
de: Erzeugt eine Flächengeometrie aus den einzelnen Linien einer gegebenen Geometrie. Der zurückgegebene Datentyp ist, abhängig von der Eingabe, ein Polygon oder ein MultiPolygon. Wenn das Eingabe-Liniennetz keine Polygone bildet, wird NULL zurückgegeben. Die Eingabe können LineStrings, MultiLinestrings, Polygons, MultiPolygons und GeometryCollections sein.
ja: 与えられたジオメトリの構成ラインから面ジオメトリを生成します。返り値はポリゴンまたはマルチポリゴンで、どちらになるかは入力に依存します。入力構成ラインがポリゴンを形成しない場合はNULLを返します。入力としてLINESTRING, MULTILINESTRING, POLYGON, MULTIPOLYGON, GEOMETRYCOLLECTIONを取ることができます。
ko_kr: 주어진 도형의 선분 구성 요소로 이루어진 면 도형을 생성합니다. 반환된 유형은 입력 도형에 따라 폴리곤 또는 멀티폴리곤이 될 수 있습니다. 입력 선분이 폴리곤을 형성시키지 못 할 경우 NULL을 반환합니다. 라인스트링, 멀티라인스트링, 폴리곤, 멀티폴리곤 그리고 도형 집합을 입력받을 수 있습니다.

source: This function will assume all inner geometries represent holes
de: Diese Funktion nimmt an, dass alle inneren Geometrien Lücken/Inseln darstellen.
ja: この関数は全ての内部ジオメトリが穴を表現すると仮定します。
ko_kr: 이 함수는 모든 내부(inner) 도형이 구멍을 나타낸다고 가정할 것입니다.

source: Input linework must be correctly noded for this function to work properly
de: Damit diese Funktion korrekt arbeitet, müssen die Knoten des eingegebenen Liniennetzes richtig angeordnet sein
ja: この関数が正しく動作するには、入力ラインに正しくノードが作成されている必要があります。
ko_kr: 입력 선분의 교점(node)이 정확히 구성돼야만 이 함수가 제대로 동작합니다.

source: Availability: 1.1.0 - requires GEOS &gt;= 2.1.0.
de: Verfügbarkeit: 1.1.0 - benötigt GEOS &gt;= 2.1.0.
ja: Availability: 1.1.0 - GEOS 2.1.0以上が必要です。
ko_kr: 1.1.0 버전부터 사용할 수 있습니다. GEOS 2.1.0 이상 버전이 필요합니다.

source: This will create a donut
de: Erzeugt einen Donut
ja: ドーナツを生成します。
ko_kr: 다음 쿼리는 도넛 모양을 생성할 겁니다.

source: This will create a gaping hole inside the circle with prongs sticking out
de: Dies erzeugt eine auseinanderklaffende Lücke innerhalb des Kreises mit herausstehenden Zacken
ja: 円内にとがったものの先で、裂け目を生成します。
ko_kr: 다음 쿼리는 삐죽 튀어나온 막대와 함께 원 안에 벌어진 구멍을 만들 겁니다.

source: SELECT ST_BuildArea(ST_Collect(line,circle)) FROM (SELECT ST_Buffer( ST_MakeLine(ST_MakePoint(10, 10),ST_MakePoint(190, 190)), 5) As line, ST_Buffer(ST_GeomFromText('POINT(100 90)'), 50) As circle) As foo; --this creates the same gaping hole --but using linestrings instead of polygons SELECT ST_BuildArea( ST_Collect(ST_ExteriorRing(line),ST_ExteriorRing(circle)) ) FROM (SELECT ST_Buffer( ST_MakeLine(ST_MakePoint(10, 10),ST_MakePoint(190, 190)) ,5) As line, ST_Buffer(ST_GeomFromText('POINT(100 90)'), 50) As circle) As foo;
de: SELECT ST_BuildArea(ST_Collect(line,circle)) FROM (SELECT ST_Buffer( ST_MakeLine(ST_MakePoint(10, 10),ST_MakePoint(190, 190)), 5) As line, ST_Buffer(ST_GeomFromText('POINT(100 90)'), 50) As circle) As foo; --dies erzeugt dieselbe auseinanderklaffende Lücke --allerdings aus Linienzügen anstelle von Polygonen SELECT ST_BuildArea( ST_Collect(ST_ExteriorRing(line),ST_ExteriorRing(circle)) ) FROM (SELECT ST_Buffer( ST_MakeLine(ST_MakePoint(10, 10),ST_MakePoint(190, 190)) ,5) As line, ST_Buffer(ST_GeomFromText('POINT(100 90)'), 50) As circle) As foo;
ja: SELECT ST_BuildArea(ST_Collect(line,circle)) FROM (SELECT ST_Buffer( ST_MakeLine(ST_MakePoint(10, 10),ST_MakePoint(190, 190)), 5) As line, ST_Buffer(ST_GeomFromText('POINT(100 90)'), 50) As circle) As foo; -- 同じ裂け目を生成します -- ただし、ポリゴンでなくラインストリングを使います SELECT ST_BuildArea( ST_Collect(ST_ExteriorRing(line),ST_ExteriorRing(circle)) ) FROM (SELECT ST_Buffer( ST_MakeLine(ST_MakePoint(10, 10),ST_MakePoint(190, 190)) ,5) As line, ST_Buffer(ST_GeomFromText('POINT(100 90)'), 50) As circle) As foo;
ko_kr: SELECT ST_BuildArea(ST_Collect(line,circle)) FROM (SELECT ST_Buffer( ST_MakeLine(ST_MakePoint(10, 10),ST_MakePoint(190, 190)), 5) As line, ST_Buffer(ST_GeomFromText('POINT(100 90)'), 50) As circle) As foo; -- 다음 쿼리는 동일한 구멍을 생성하지만 -- 폴리곤 대신 라인스트링을 이용합니다. SELECT ST_BuildArea( ST_Collect(ST_ExteriorRing(line),ST_ExteriorRing(circle)) ) FROM (SELECT ST_Buffer( ST_MakeLine(ST_MakePoint(10, 10),ST_MakePoint(190, 190)) ,5) As line, ST_Buffer(ST_GeomFromText('POINT(100 90)'), 50) As circle) As foo;

source: , <xref linkend="ST_MakePolygon"/>, <xref linkend="ST_BdPolyFromText"/>, <xref linkend="ST_BdMPolyFromText"/>wrappers to this function with standard OGC interface
de: , <xref linkend="ST_MakePolygon"/>, <xref linkend="ST_BdPolyFromText"/>, <xref linkend="ST_BdMPolyFromText"/> Adapter für diese Funktion mit der OGC-Standardschnittstelle
ja: , <xref linkend="ST_MakePolygon"/>, <xref linkend="ST_BdPolyFromText"/>, <xref linkend="ST_BdMPolyFromText"/> (この関数を標準OGCインタフェースにするためのラッパ)
ko_kr: , <xref linkend="ST_MakePolygon"/>, <xref linkend="ST_BdPolyFromText"/>, <xref linkend="ST_BdMPolyFromText"/> 이 함수에 대해 표준 OGC 인터페이스를 가진 래퍼(wrapper)들

source: Returns the portion of a geometry falling within a rectangle.
de: Gibt jenen Teil der Geometrie zurück, der innerhalb eines Rechteckes liegt.
ja: 長方形内に落ちるジオメトリの一部を返します。
ko_kr: 직사각형 안에 들어오는 도형의 부분을 반환합니다.

source: Clips a geometry by a 2D box in a fast but possibly dirty way. The output geometry is not guaranteed to be valid (self-intersections for a polygon may be introduced). Topologically invalid input geometries do not result in exceptions being thrown.
de: Schneidet eine Geometrie mittels einer 2D-Box aus; eine schnelle aber möglicherweise unsaubere Methode. Es ist nicht garantiert, dass die Ausgabegeometrie valide ist (bei Polygonen kann es zu Selbstüberschneidungen kommen). Topologisch invalide Eingabegeometrien führen zu keiner Fehlermeldung.
ja: 2次元ボックスでジオメトリを切り抜きます。高速ですが汚い方法かもしれません。出力ジオメトリの妥当性は保証されません (ポリゴンで自己インタセクションができるかも知れません)。トポロジ的に不正な入力ジオメトリでは例外が投げられ結果を返しません。
ko_kr: 빠르지만 지저분할 수도 있는 방법으로 2차원 상자가 도형을 잘라냅니다. 출력 도형이 유효하지 않을 수도 있습니다(폴리곤의 경우 스스로 교차할 수도 있습니다). 위상기하학적으로 유효하지 않은 도형을 입력해도 예외 상태에 빠지지는 않습니다.

source: Requires GEOS 3.5.0+
de: Benötigt GEOS 3.5.0+
ja: GEOS 3.5.0以上が必要です。
ko_kr: GEOS 3.5.0 이상 버전이 필요합니다.

source: Availability: 2.2.0 - requires GEOS &gt;= 3.5.0.
de: Verfügbarkeit: 2.2.0 - benötigt GEOS &gt;= 3.5.0.
ja: Availability: 2.2.0 - GEOS 3.5.0以上が必要です。
ko_kr: 2.2.0 버전부터 사용할 수 있습니다. GEOS 3.5.0 이상 버전이 필요합니다.

source: -- Rely on implicit cast from geometry to box2d for the second parameter SELECT ST_ClipByBox2D(the_geom, ST_MakeEnvelope(0,0,10,10)) FROM mytab;
de: -- Der zweite Eingabeparameter baut auf die implizite Typumwandlung von Geometrie nach Box2D auf SELECT ST_ClipByBox2D(the_geom, ST_MakeEnvelope(0,0,10,10)) FROM mytab;
ja: -- 第2引数はジオメトリからbox2dへの暗黙のキャストに依っています SELECT ST_ClipByBox2D(the_geom, ST_MakeEnvelope(0,0,10,10)) FROM mytab;
ko_kr: -- 두 번째 파라미터의 경우 도형을 무조건적으로 2차원 상자로 지정한다는 사실에 의존합니다. SELECT ST_ClipByBox2D(the_geom, ST_MakeEnvelope(0,0,10,10)) FROM mytab;

source: Return a specified ST_Geometry value from a collection of other geometries.
de: Gibt einen festgelegten ST_Geometry Wert aus einer Sammlung anderer Geometrien zurück.
ja: 他のジオメトリのコレクションから、指定したST_Geometry値を返します。
ko_kr: 다른 도형들의 집합으로부터 설정된 ST_Geometry 값을 반환합니다.

source: Output type can be a MULTI* or a GEOMETRYCOLLECTION. Comes in 2 variants. Variant 1 collects 2 geometries. Variant 2 is an aggregate function that takes a set of geometries and collects them into a single ST_Geometry.
de: Der Ausgabetyp kann eine MULTI* oder eine GEOMETRYCOLLECTION sein. Hat 2 Varianten. Variante 1 sammelt 2 Geometrien ein. Variante 2 ist eine Aggregatfunktion, die einen Satz an Geometrien entgegennimmt und diese in einer einzelnen ST_Geometry versammelt.
ja: 出力タイプはMULTI系またはGEOMETRYCOLLECTIONです。二つの形式があります。 一つ目は、二つのジオメトリをまとめるものです。二つ目は、ジオメトリの集合を取って単一のST_Geometryにまとめる集約関数です。
ko_kr: 멀티 도형 또는 도형 집합 유형을 출력할 수 있습니다. 두 가지 변종이 존재합니다. 변종 1은 도형 2개를 수집합니다. 변종 2는 도형들의 집합을 입력받아 단일 ST_Geometry로 수집하는 종합 함수입니다.

source: Aggregate version: This function returns a GEOMETRYCOLLECTION or a MULTI object from a set of geometries. The ST_Collect() function is an "aggregate" function in the terminology of PostgreSQL. That means that it operates on rows of data, in the same way the SUM() and AVG() functions do. For example, "SELECT ST_Collect(GEOM) FROM GEOMTABLE GROUP BY ATTRCOLUMN" will return a separate GEOMETRYCOLLECTION for each distinct value of ATTRCOLUMN.
de: Aggregat Version:: Diese Funktion gibt eine GEOMETRYCOLLECTION oder ein MULTI Objekt aus einem Satz an Geometrien. Die Funktion ST_Collect() ist in der Terminologie von PostgreSQL eine Aggregatfunktion. Dies bedeutet, dass sie so wie die SUM() und AVG() Funktionen mit Datenzeilen arbeitet. Zum Beispiel, "SELECT ST_Collect(GEOM) FROM GEOMTABLE GROUP BY ATTRCOLUMN" gibt eine einzelne GEOMETRYCOLLECTION für jeden eindeutigen Wert von ATTRCOLUMN zurück.
ja: 集約関数版: この関数は、ジオメトリの集合からGEOMETRYCOLLECTIONまたはMULTI系を返します。ST_Collect()関数はPostgreSQL用語で言うところの「集約関数」です。SUM()やMEAN()と同じ方法でデータ行での操作を行うことを意味します。たとえば、"SELECT ST_Collect(GEOM) FROM GEOMTABLE GROUP BY ATTRCOLUMN"はATTRCOLUMNの異なった値ごとに、別々のGEOMETRYCOLLECTIONを返します。
ko_kr: 종합 버전: 이 함수는 도형들의 집합으로부터 도형 집합 또는 멀티 유형의 객체를 반환합니다. ST_Collect() 함수는 PostgreSQL 전문 용어로 "종합(aggregate)" 함수입니다. 즉 SUM() 및 AVG() 함수와 마찬가지로 데이터 행들을 대상으로 연산한다는 뜻입니다. 예를 들어, "SELECT ST_Collect(GEOM) FROM GEOMTABLE GROUP BY ATTRCOLUMN" 쿼리는 ATTRCOLUMN의 각 개별적인 값에 대해 별개의 도형 집합을 반환할 것입니다.
