Repository: postgis/postgis
Catalog: doc/po/*/reference_processing.xml.po
Languages: de, ja, ko_kr, zh_hans

source: Returns a collection containing paths shared by the two input geometries. Those going in the same direction are in the first element of the collection, those going in the opposite direction are in the second element. The paths themselves are given in the direction of the first geometry.
de: Gibt eine Sammelgeometrie zurück, die die gemeinsamen Pfade zweier Eingabegeometrie enthält. Jene, die in derselben Richtung orientiert sind, werden im ersten Element der Sammelgeometrie, jene die in die entgegengesetzte Richtung orientiert sind, werden im zweiten Element gespeichert. Die Pfade selbst befinden sich in der ersten Geometrie.
ja: 二つの入力ジオメトリが共有するパスのコレクションを返します。順方向に行くものはコレクションの一つ目の要素にあり、逆方向は二つ目の要素にあります。これらのパス自体は一つ目のジオメトリの方向をもとにします。
ko_kr: 두 입력 도형이 공유하는 경로를 담고 있는 집합을 반환합니다. 동일한 방향을 향하는 경로가 이 집합의 첫 번째 요소이며, 반대 방향을 향하는 경로가 두 번째 요소입니다. 경로 그 자체는 첫 번째 도형의 방향을 따릅니다.
zh_hans: 返回一个集合，其中包含两个输入几何图形共享的路径。 那些朝相同方向去的在集合的第一个元素中，那些朝相反方向去的在第二个元素中。 路径本身是在第一个几何体的方向上给出的。

source: Availability: 2.0.0 requires GEOS &gt;= 3.3.0.
de: Verfügbarkeit: 2.0.0 benötigt GEOS &gt;= 3.3.0.
ja: Availability: 2.0.0 GEOS 3.3.0以降が必要です。
ko_kr: 2.0.0 버전부터 사용할 수 있습니다. GEOS 3.3.0 이상 버전이 필요합니다.

source: Examples: Finding shared paths
de: Beispiele: Gemeinsame Strecken finden
ja: 例: 共有パスの探索
ko_kr: 예시: 공유된 경로 찾기
zh_hans: 示例：查找共享路径

source: A multilinestring and a linestring
de: Ein MultiLinestring und ein LineString
ja: マルチラインストリングとラインストリング
ko_kr: 멀티라인스트링과 라인스트링
zh_hans: multilinestring和linestring

source: The shared path of multilinestring and linestring overlaid with original geometries.
de: Die gemeinsame Strecke eines MultiLinestring und Linestring mit überlagerter Ursprungsgeometrie.
ja: マルチラインストリングとラインストリングとの共有パスと元のジオメトリ。
ko_kr: 멀티라인스트링과 라인스트링이 공유하는 경로와 원본 도형들을 중첩
zh_hans: multilinestring和 linestring与原始几何图形重叠的共享路径。

source: -- same example but linestring orientation flipped SELECT ST_AsText( ST_SharedPaths( ST_GeomFromText('LINESTRING(76 175,90 161,126 125,126 156.25,151 100)'), ST_GeomFromText('MULTILINESTRING((26 125,26 200,126 200,126 125,26 125), (51 150,101 150,76 175,51 150))') ) ) As wkt wkt ------------------------------------------------------------- GEOMETRYCOLLECTION(MULTILINESTRING EMPTY, MULTILINESTRING((76 175,90 161),(90 161,101 150),(126 125,126 156.25)))
de: -- Das selbe Beispiel, aber die Richtung des Linienzuges ist umgedreht/flipped SELECT ST_AsText( ST_SharedPaths( ST_GeomFromText('LINESTRING(76 175,90 161,126 125,126 156.25,151 100)'), ST_GeomFromText('MULTILINESTRING((26 125,26 200,126 200,126 125,26 125), (51 150,101 150,76 175,51 150))') ) ) As wkt wkt ------------------------------------------------------------- GEOMETRYCOLLECTION(MULTILINESTRING EMPTY, MULTILINESTRING((76 175,90 161),(90 161,101 150),(126 125,126 156.25)))
ja: -- 同じ例ですがラインストリングの引数の順序を入れ替えています SELECT ST_AsText( ST_SharedPaths( ST_GeomFromText('LINESTRING(76 175,90 161,126 125,126 156.25,151 100)'), ST_GeomFromText('MULTILINESTRING((26 125,26 200,126 200,126 125,26 125), (51 150,101 150,76 175,51 150))') ) ) As wkt wkt ------------------------------------------------------------- GEOMETRYCOLLECTION(MULTILINESTRING EMPTY, MULTILINESTRING((76 175,90 161),(90 161,101 150),(126 125,126 156.25)))
ko_kr: -- 동일한 예시에서 라인스트링의 방향만 역전 SELECT ST_AsText( ST_SharedPaths( ST_GeomFromText('LINESTRING(76 175,90 161,126 125,126 156.25,151 100)'), ST_GeomFromText('MULTILINESTRING((26 125,26 200,126 200,126 125,26 125), (51 150,101 150,76 175,51 150))') ) ) As wkt wkt ------------------------------------------------------------- GEOMETRYCOLLECTION(MULTILINESTRING EMPTY, MULTILINESTRING((76 175,90 161),(90 161,101 150),(126 125,126 156.25)))

source: Toggle geometry coordinates between -180..180 and 0..360 ranges.
de: Schaltet geometrische Koordinaten zwischen den Bereichen -180..180 und 0..360 um.
ja: ジオメトリの座標値を-180度から180度の範囲と0度から360度の範囲に揃えます。
ko_kr: 도형의 좌표를 -180 ~ 180 범위와 0 ~ 360 범위 간에 전환합니다.

source: Reads every point/vertex in every component of every feature in a geometry, and if the longitude coordinate is &lt;0, adds 360 to it. The result would be a 0-360 version of the data to be plotted in a 180 centric map
de: Liest jeden Punkt/Knoten jeder Featurekomponente einer Geometrie, und wenn die Längenkoordinate &lt;0 ist wird 360 hinzugezählt. Das Ergebnis ist eine 0-360 Grad Version der Daten, die auf einer bei 180 Grad zentrierten Karte dargestellt werden kann.
ja: ジオメトリの全ての地物の全てのポイント/頂点を読み、経度値が0より小さい場合には360を足します。結果は、180度を中心にした地図に描画される、経度が0-360の区間にあるデータです。
ko_kr: 도형 안에 있는 모든 피처의 모든 구성 요소 안의 모든 포인트/꼭짓점을 읽어 들여, 경도 좌표가 0 미만일 경우 360을 더합니다. 그 결과 0에서 360 사이의 값을 가지는 데이터를 180을 중심으로 하는 맵에 그리게 됩니다.

source: This is only useful for data in long lat e.g. 4326 (WGS 84 long lat)
de: Dies ist nur sinnvoll bei Längen- und Breitenangabe, z.B.: 4326 (WGS 84 long lat)
ja: これは4326 (WGS84経度緯度)のような経度緯度でのみ使えます。
ko_kr: 이 함수는 SRID:4326(WGS84 경위도) 같은 경위도 데이터에 대해서만 쓸모가 있습니다.

source: Pre-1.3.4 bug prevented this from working for MULTIPOINT. 1.3.4+ works with MULTIPOINT as well.
de: Pre-1.3.4 Aufgrund eines Bugs funktionierte dies für MULTIPOINT nicht. Mit 1.3.4+ funktioniert es auch mit MULTIPOINT.
ja: 1.3.4より前ではMULTIPOINTでは動作しないバグがありました。1.3.4以上ではMULTIPOINTでも動作します。
ko_kr: 1.3.4 미만 버전에서는 버그 때문에 멀티포인트를 입력받지 못 했습니다. 1.3.4 버전부터 멀티포인트도 입력할 수 있습니다.

source: Enhanced: 2.0.0 support for Polyhedral surfaces and TIN was introduced.
de: Erweiterung: Mit 2.0.0 wurde die Unterstützung für polyedrische Oberflächen und TIN eingeführt.
ja: Enhanced: 2.0.0 多面体サーフェス対応とTIN対応が導入されました。
ko_kr: 개선 사항: 2.0.0 버전부터 다면체 표면(polyhedral surface) 및 TIN을 지원합니다.

source: NOTE: this function was renamed from "ST_Shift_Longitude" in 2.2.0
de: Anmerkung: Vor 2.2.0 hieß diese Funktion "ST_Shift_Longitude"
ja: ご注意: この関数は2.0.0で"ST_Shift_Longitude"から名称変更しました。
ko_kr: 주의: 2.2.0 미만 버전에서, 이 함수의 명칭은 "ST_Shift_Longitude"였습니다.

source: --3d points SELECT ST_AsEWKT(ST_ShiftLongitude(ST_GeomFromEWKT('SRID=4326;POINT(-118.58 38.38 10)'))) As geomA, ST_AsEWKT(ST_ShiftLongitude(ST_GeomFromEWKT('SRID=4326;POINT(241.42 38.38 10)'))) As geomb geomA geomB ---------- ----------- SRID=4326;POINT(241.42 38.38 10) SRID=4326;POINT(-118.58 38.38 10) --regular line string SELECT ST_AsText(ST_ShiftLongitude(ST_GeomFromText('LINESTRING(-118.58 38.38, -118.20 38.45)'))) st_astext ---------- LINESTRING(241.42 38.38,241.8 38.45)
de: --3D Punkte SELECT ST_AsEWKT(ST_ShiftLongitude(ST_GeomFromEWKT('SRID=4326;POINT(-118.58 38.38 10)'))) As geomA, ST_AsEWKT(ST_ShiftLongitude(ST_GeomFromEWKT('SRID=4326;POINT(241.42 38.38 10)'))) As geomb geomA geomB ---------- ----------- SRID=4326;POINT(241.42 38.38 10) SRID=4326;POINT(-118.58 38.38 10) --normaler Linienzug SELECT ST_AsText(ST_ShiftLongitude(ST_GeomFromText('LINESTRING(-118.58 38.38, -118.20 38.45)'))) st_astext ---------- LINESTRING(241.42 38.38,241.8 38.45)
ja: -- 3次元ポイント SELECT ST_AsEWKT(ST_ShiftLongitude(ST_GeomFromEWKT('SRID=4326;POINT(-118.58 38.38 10)'))) As geomA, ST_AsEWKT(ST_ShiftLongitude(ST_GeomFromEWKT('SRID=4326;POINT(241.42 38.38 10)'))) As geomb geomA geomB ---------- ----------- SRID=4326;POINT(241.42 38.38 10) SRID=4326;POINT(-118.58 38.38 10) -- 普通のラインストリング SELECT ST_AsText(ST_ShiftLongitude(ST_GeomFromText('LINESTRING(-118.58 38.38, -118.20 38.45)'))) st_astext ---------- LINESTRING(241.42 38.38,241.8 38.45)
ko_kr: -- 3D 포인트 SELECT ST_AsEWKT(ST_ShiftLongitude(ST_GeomFromEWKT('SRID=4326;POINT(-118.58 38.38 10)'))) As geomA, ST_AsEWKT(ST_ShiftLongitude(ST_GeomFromEWKT('SRID=4326;POINT(241.42 38.38 10)'))) As geomb geomA geomB ---------- ----------- SRID=4326;POINT(241.42 38.38 10) SRID=4326;POINT(-118.58 38.38 10) -- 정규 라인스트링 SELECT ST_AsText(ST_ShiftLongitude(ST_GeomFromText('LINESTRING(-118.58 38.38, -118.20 38.45)'))) st_astext ---------- LINESTRING(241.42 38.38,241.8 38.45)

source: Wrap a geometry around an X value.
de: Versammelt eine Geometrie um einen X-Wert
ja: ジオメトリをX値で回り込ませます。
ko_kr: X값 근처에서 도형을 래핑합니다.

source: This function splits the input geometries and then moves every resulting component falling on the right (for negative 'move') or on the left (for positive 'move') of given 'wrap' line in the direction specified by the 'move' parameter, finally re-unioning the pieces togheter.
de: Diese Funktion trennt die Ausgangsgeometrie auf und verschiebt jeden resultierenden Bestandteil der auf die rechte (bei negativem 'move') oder auf die linke Seite (bei positivem 'move) der gegebenen 'wrap'-Linie fällt in die Richtung die durch den 'move' Parameter angegeben ist. Schließlich werden die Teile wieder vereinigt.
ja: 入力ジオメトリを分割して、全ての結果要素が「回り込み ('wrap')」線から’move'パラメータで決められた方向、すなわち、右側 ('move'が負数)または左側 ('move'が正数)に全ての要素が落ちるように移動させ、最後に再結合します。
ko_kr: 이 함수는 입력 도형을 쪼갠 다음 주어진 '래핑(wrap)' 라인을 기준으로 (move가 음일 경우) 오른쪽 또는 (move가 양일 경우) 왼쪽에 떨어지는 모든 산출 구성 요소를 'move' 파라미터가 지정하는 방향으로 이동시키고, 마지막으로 조각들을 다시 통합시킵니다.

source: This is useful to "recenter" long-lat input to have features of interest not spawned from one side to the other.
de: Nützlich, um eine Eingabe in Länge und Breite neu zu zentrieren, damit die wesentlichen Geoobjekte nicht von einer Seite bis zur anderen abgebildet werden.
ja: 経度緯度入力を「再センタリング」して、対象地物が一方からもう一方に飛ばないようにするのに使えます。
ko_kr: 이 함수는 경위도 입력물이 한 편에서 다른 편으로 걸쳐 있지 않은 관심 피처를 갖도록 하는 데 유용합니다.

source: -- Move all components of the given geometries whose bounding box -- falls completely on the left of x=0 to +360 select ST_WrapX(the_geom, 0, 360); -- Move all components of the given geometries whose bounding box -- falls completely on the left of x=-30 to +360 select ST_WrapX(the_geom, -30, 360);
de: -- Verschiebt alle Komponenten einer gegebenen Geometrie, deren Umgebungsrechteck -- zur Gänze links von x=0 liegen um +360 select ST_WrapX(the_geom, 0, 360); -- Verschiebt alle Komponenten einer gegebenen Geometrie, deren Umgebungsrechteck -- zur Gänze links von x=30 liegen um +360 select ST_WrapX(the_geom, -30, 360);
ja: -- 与えられたジオメトリのうち、 -- バウンディングボックスが完全にx=0の左側にあるもののについて -- X値に360を足して移動させます。 select ST_WrapX(the_geom, 0, 360); -- 与えられたジオメトリのうち、 -- バウンディングボックスが完全にx=-30の左側にあるもののについて -- X値に360を足して移動させます。 select ST_WrapX(the_geom, -30, 360);
ko_kr: -- x=0~360 범위의 왼쪽에 경계 상자가 완전히 떨어지는 -- 입력 도형의 모든 구성 요소를 이동시킵니다. select ST_WrapX(the_geom, 0, 360); -- x=-30~360 범위의 왼쪽에 경계 상자가 완전히 떨어지는 -- 입력 도형의 모든 구성 요소를 이동시킵니다. select ST_WrapX(the_geom, -30, 360);

source: Returns a "simplified" version of the given geometry using the Douglas-Peucker algorithm.
de: Gibt eine vereinfachte Version der Ausgangsgeometrie zurück. Verwendet den Douglas-Peucker Algorithmus.
ja: 与えられたジオメトリを「簡略化」したものを返します。Douglas-Peukerアルゴリズムを使用します。
ko_kr: 더글러스-패커(Douglas-Peucker) 알고리즘을 이용해서 입력 도형의 "단순화"된 버전을 반환합니다.

source: Returns a "simplified" version of the given geometry using the Douglas-Peucker algorithm. Will actually do something only with (multi)lines and (multi)polygons but you can safely call it with any kind of geometry. Since simplification occurs on a object-by-object basis you can also feed a GeometryCollection to this function.
de: Gibt eine "vereinfachte" Version der gegebenen Geometrie zurück. Verwendet den Douglas-Peucker Algorithmus. Tut zurzeit nur mit (Multi)Lines und (Multi)Polygons etwas, kann aber gefahrlos mit jedem geometrischen Datentyp verwendet werden. Da die Vereinfachung auf einer Objekt zu Objekt Basis passiert, können Sie diese Funktion auch mit einer Sammelgeometrie speisen.
ja: 与えられたジオメトリを「簡略化」したものを返します。Douglas-Peukerアルゴリズムを使用します。(MULTI)LINEと(MULTI)POLYGONとで実際に動作をしますが、どのような種類のジオメトリでも安全に呼ぶことができます。簡略化はオブジェクトごとに行われるので、ジオメトリコレクションでこの関数を呼ぶことができます。
ko_kr: 더글러스-패커(Douglas-Peucker) 알고리즘을 이용해서 입력 도형의 "단순화"된 버전을 반환합니다. 실제로는 [멀티]라인, [멀티]폴리곤과만 작동하지만, 어떤 종류의 도형도 입력할 수 있다고 해도 과언은 아닙니다. 객체별 기반으로 단순화 작업을 하기 때문에 이 함수에 도형 집합도 입력할 수 있습니다.
zh_hans: 使用 Douglas-Peucker 算法返回给定几何图形的“简化”版本。 实际上只会对（多）线和（多）多边形执行某些操作，但您可以使用任何类型的几何体安全地调用它。 由于简化是在逐个对象的基础上进行的，因此您还可以将 GeometryCollection 提供给此函数。

source: The "preserve collapsed" flag will retain objects that would otherwise be too small given the tolerance. For example, a 1m long line simplified with a 10m tolerance. If the preserve flag is given, the line will not disappear. This flag is useful for rendering engines, to avoid having large numbers of very small objects disappear from a map leaving surprising gaps.
de: Der Flag "preservve collapsed" erhält Geoobjekte, die andernfalls zu klein für die gegebene Toleranz wären. Zum Beispiel eine 1m lange Linie die mit 10m Toleranz vereinfacht wurde. Wenn die Flag "preserve collapsed" angegeben ist, wird die Linie erhalten. Dieser Flag ist nützlich für Rendering-Engines, um in Kartendarstellungen das Verlorengehen einer großen Anzahl von kleinen Objekten und die dadurch entstehende Lücken zu vermeiden.
ja: "preserve collapsed"フラグによって、許容範囲より非常に小さいオブジェクトが保持されます。例えば、1メートル長のラインを10メートルの許容範囲で簡略化する場合です。"preserve"フラグを与えると、ラインは消去されません。このフラグは、多数の非常に小さいオブジェクトを持っていて、これらが想定外の隙間を残して地図から消えることを避けるのに使えます。
ko_kr: "preserve collapsed" 플래그를 설정하면 주어진 허용 오차에 비해 너무 작아 제거될 객체를 유지할 것입니다. 예를 들어, 10미터 허용 오차를 가지고 1미터 길이의 라인을 단순화하는 경우 말입니다. "preserve collapsed" 플래그를 설정할 경우, 이 라인이 사라지지 않을 겁니다. 이 플래그는 렌더링 엔진에 유용합니다. 수많은 작은 객체들이 맵에서 한꺼번에 사라져 놀랄 만한 자국들이 생기는 일을 막을 수 있으니까요.

source: Note that returned geometry might lose its simplicity (see <xref linkend="ST_IsSimple"/>)
de: Bemerke, dass die zurückgegebene Geometrie ihre Simplizität verlieren kann (siehe <xref linkend="ST_IsSimple"/>).
ja: 返されるジオメトリは単純性 (<xref linkend="ST_IsSimple"/>参照)を失うことがあります。
ko_kr: 반환되는 도형이 단순성을 잃을 수도 있다는 점에 주의하십시오(<xref linkend="ST_IsSimple"/> 참조).
zh_hans: 请注意，返回的几何图形可能会失去其简单性（请参阅<xref linkend="ST_IsSimple"/>）

source: Note topology may not be preserved and may result in invalid geometries. Use (see <xref linkend="ST_SimplifyPreserveTopology"/>) to preserve topology.
de: Beachten Sie bitte, das die Topologie möglicherweise nicht erhalten bleibt und ungültige Geometrien entstehen können. Benutzen Sie bitte (see <xref linkend="ST_SimplifyPreserveTopology"/>) um die Topologie zu erhalten.
ja: トポロジは保存されているとは限らず、不正なジオメトリを返すことがあります。トポロジを保存するには<xref linkend="ST_SimplifyPreserveTopology"/>を使います。
ko_kr: 위상(topology)이 보전되지 않아 유효하지 않은 도형이 반환될 수도 있습니다. 위상을 유지하려면 <xref linkend="ST_SimplifyPreserveTopology"/> 함수를 이용하십시오.
zh_hans: 请注意，拓扑可能不会保留，并可能导致无效的几何图形。 使用（请参阅<xref linkend="ST_SimplifyPreserveTopology"/>）保留拓扑。

source: A circle simplified too much becomes a triangle, medium an octagon,
de: Ein zu stark vereinfachter Kreis wird zu einem Dreieck, mittelmäßig vereinfacht zum Achteck:
ja: 簡略化をやりすぎて三角形になった円、八角形になった円です。
ko_kr: 원을 너무 단순화시키면 팔각형을 거쳐 삼각형이 되고 맙니다.
zh_hans: 它是一个经过简化后变成三角形或八角形的圆，

source: SELECT ST_Npoints(the_geom) As np_before, ST_NPoints(ST_Simplify(the_geom,0.1)) As np01_notbadcircle, ST_NPoints(ST_Simplify(the_geom,0.5)) As np05_notquitecircle, ST_NPoints(ST_Simplify(the_geom,1)) As np1_octagon, ST_NPoints(ST_Simplify(the_geom,10)) As np10_triangle, (ST_Simplify(the_geom,100) is null) As np100_geometrygoesaway FROM (SELECT ST_Buffer('POINT(1 3)', 10,12) As the_geom) As foo; -result np_before | np01_notbadcircle | np05_notquitecircle | np1_octagon | np10_triangle | np100_geometrygoesaway -----------+-------------------+---------------------+-------------+---------------+------------------------ 49 | 33 | 17 | 9 | 4 | t
ja: SELECT ST_Npoints(the_geom) As np_before, ST_NPoints(ST_Simplify(the_geom,0.1)) As np01_notbadcircle, ST_NPoints(ST_Simplify(the_geom,0.5)) As np05_notquitecircle, ST_NPoints(ST_Simplify(the_geom,1)) As np1_octagon, ST_NPoints(ST_Simplify(the_geom,10)) As np10_triangle, (ST_Simplify(the_geom,100) is null) As np100_geometrygoesaway FROM (SELECT ST_Buffer('POINT(1 3)', 10,12) As the_geom) As foo; -- 結果 -- np_before | np01_notbadcircle | np05_notquitecircle | np1_octagon | np10_triangle | np100_geometrygoesaway -----------+-------------------+---------------------+-------------+---------------+------------------------ 49 | 33 | 17 | 9 | 4 | t
ko_kr: SELECT ST_Npoints(the_geom) As np_before, ST_NPoints(ST_Simplify(the_geom,0.1)) As np01_notbadcircle, ST_NPoints(ST_Simplify(the_geom,0.5)) As np05_notquitecircle, ST_NPoints(ST_Simplify(the_geom,1)) As np1_octagon, ST_NPoints(ST_Simplify(the_geom,10)) As np10_triangle, (ST_Simplify(the_geom,100) is null) As np100_geometrygoesaway FROM (SELECT ST_Buffer('POINT(1 3)', 10,12) As the_geom) As foo; -- 결과 -- np_before | np01_notbadcircle | np05_notquitecircle | np1_octagon | np10_triangle | np100_geometrygoesaway -----------+-------------------+---------------------+-------------+---------------+------------------------ 49 | 33 | 17 | 9 | 4 | t

source: Returns a "simplified" version of the given geometry using the Douglas-Peucker algorithm. Will avoid creating derived geometries (polygons in particular) that are invalid.
de: Gibt eine vereinfachte Version der Ausgangsgeometrie zurück. Verwendet den Douglas-Peucker Algorithmus. Vermeidet es abgeleitete Geometrien zu erzeugen (insbesondere Polygone), die invalide sind.
ja: 与えられたジオメトリを「簡略化」したものを返します。Douglas-Peukerアルゴリズムを使用します。不正な派生ジオメトリ (特にポリゴン)の生成を回避します。
ko_kr: 더글러스-패커(Douglas-Peucker) 알고리즘을 이용해서 입력 도형의 "단순화"된 버전을 반환합니다. 유효하지 않은 파생 도형(특히 폴리곤)을 생성하지 않을 것입니다.

source: Returns a "simplified" version of the given geometry using the Douglas-Peucker algorithm. Will avoid creating derived geometries (polygons in particular) that are invalid. Will actually do something only with (multi)lines and (multi)polygons but you can safely call it with any kind of geometry. Since simplification occurs on a object-by-object basis you can also feed a GeometryCollection to this function.
de: Gibt eine "vereinfachte" Version der gegebenen Geometrie zurück. Verwendet den Douglas-Peucker Algorithmus. Vermeidet es, eine invalide Geometrie (insbesondere Polygone) zu erzeugen. Tut zurzeit nur mit (Multi)Lines und (Multi)Polygons etwas, kann aber gefahrlos mit jedem geometrischen Datentyp verwendet werden. Da die Vereinfachung auf einer Objekt zu Objekt Basis passiert, können Sie diese Funktion auch mit einer Sammelgeometrie speisen.
ja: 与えられたジオメトリを「簡略化」したものを返します。Douglas-Peukerアルゴリズムを使用します。不正な派生ジオメトリ (特にポリゴン)の生成を回避します。(MULTI)LINEと(MULTI)POLYGONとで実際に動作をしますが、どのような種類のジオメトリでも安全に呼ぶことができます。簡略化はオブジェクトごとに行われるので、ジオメトリコレクションでこの関数を呼ぶことができます。
ko_kr: 더글러스-패커(Douglas-Peucker) 알고리즘을 이용해서 입력 도형의 "단순화"된 버전을 반환합니다. 유효하지 않은 파생 도형(특히 폴리곤)을 생성하지 않을 것입니다. 실제로는 [멀티]라인, [멀티]폴리곤과만 작동하지만, 어떤 종류의 도형도 입력할 수 있다고 해도 과언은 아닙니다. 객체별 기반으로 단순화 작업을 하기 때문에 이 함수에 도형 집합도 입력할 수 있습니다.
zh_hans: 使用 Douglas-Peucker 算法返回给定几何图形的“简化”版本。 将避免创建无效的派生几何图形（特别是多边形）。 实际上只会对（多）线和（多）多边形执行某些操作，但您可以使用任何类型的几何体安全地调用它。 由于简化是在逐个对象的基础上进行的，因此您还可以将 GeometryCollection 提供给此函数。

source: Requires GEOS 3.0.0+
de: Benötigt GEOS 3.0.0+
ja: GEOS 3.0.0以上が必要です。
ko_kr: GEOS 3.0.0 이상 버전이 필요합니다.

source: Same example as Simplify, but we see Preserve Topology prevents oversimplification. The circle can at most become a square.
de: Das gleiche Beispiel wie mit ST_Simplify, aber wir sehen, dass ST_SimplifyPreserveTopology übermäßige Vereinfachung verhindert. Der Kreis kann maximal ein Quadrat werden.
ja: Simplyfyと同じ例ですが、トポロジ保存で簡略化の行きすぎを阻止します。円は最低でも四角形になります。
ko_kr: ST_Simplify 함수와 동일하지만, ST_SimplifyPreserveTopology는 과단순화(oversimplification)를 막아준다는 사실을 알 수 있습니다. 원을 단순화해도 기껏해야 사각형에서 끝납니다.
zh_hans: 与简化相同的示例，但我们看到保留拓扑可以防止过度简化。 圆最多可以变成正方形。

source: SELECT ST_Npoints(the_geom) As np_before, ST_NPoints(ST_SimplifyPreserveTopology(the_geom,0.1)) As np01_notbadcircle, ST_NPoints(ST_SimplifyPreserveTopology(the_geom,0.5)) As np05_notquitecircle, ST_NPoints(ST_SimplifyPreserveTopology(the_geom,1)) As np1_octagon, ST_NPoints(ST_SimplifyPreserveTopology(the_geom,10)) As np10_square, ST_NPoints(ST_SimplifyPreserveTopology(the_geom,100)) As np100_stillsquare FROM (SELECT ST_Buffer('POINT(1 3)', 10,12) As the_geom) As foo; --result-- np_before | np01_notbadcircle | np05_notquitecircle | np1_octagon | np10_square | np100_stillsquare -----------+-------------------+---------------------+-------------+---------------+------------------- 49 | 33 | 17 | 9 | 5 | 5
ja: SELECT ST_Npoints(the_geom) As np_before, ST_NPoints(ST_SimplifyPreserveTopology(the_geom,0.1)) As np01_notbadcircle, ST_NPoints(ST_SimplifyPreserveTopology(the_geom,0.5)) As np05_notquitecircle, ST_NPoints(ST_SimplifyPreserveTopology(the_geom,1)) As np1_octagon, ST_NPoints(ST_SimplifyPreserveTopology(the_geom,10)) As np10_square, ST_NPoints(ST_SimplifyPreserveTopology(the_geom,100)) As np100_stillsquare FROM (SELECT ST_Buffer('POINT(1 3)', 10,12) As the_geom) As foo; -- 結果 -- np_before | np01_notbadcircle | np05_notquitecircle | np1_octagon | np10_square | np100_stillsquare -----------+-------------------+---------------------+-------------+---------------+------------------- 49 | 33 | 17 | 9 | 5 | 5
ko_kr: SELECT ST_Npoints(the_geom) As np_before, ST_NPoints(ST_SimplifyPreserveTopology(the_geom,0.1)) As np01_notbadcircle, ST_NPoints(ST_SimplifyPreserveTopology(the_geom,0.5)) As np05_notquitecircle, ST_NPoints(ST_SimplifyPreserveTopology(the_geom,1)) As np1_octagon, ST_NPoints(ST_SimplifyPreserveTopology(the_geom,10)) As np10_square, ST_NPoints(ST_SimplifyPreserveTopology(the_geom,100)) As np100_stillsquare FROM (SELECT ST_Buffer('POINT(1 3)', 10,12) As the_geom) As foo; -- 결과 -- np_before | np01_notbadcircle | np05_notquitecircle | np1_octagon | np10_square | np100_stillsquare -----------+-------------------+---------------------+-------------+---------------+------------------- 49 | 33 | 17 | 9 | 5 | 5

source: Returns a "simplified" version of the given geometry using the Visvalingam-Whyatt algorithm
de: Gibt eine vereinfachte Version der Ausgangsgeometrie zurück. Verwendet den Visvalingam-Whyatt Algorithmus.
ja: Visvalingam-Whyattアルゴリズムを用いて、入力ジオメトリを「簡略化」したジオメトリを返します。
ko_kr: 비스베일링검-와이어트(Visvalingam-Whyatt) 알고리즘을 이용해서 입력 도형의 "단순화"된 버전을 반환합니다.

source: Returns a "simplified" version of the given geometry using the Visvalingam-Whyatt algorithm. Will actually do something only with (multi)lines and (multi)polygons but you can safely call it with any kind of geometry. Since simplification occurs on a object-by-object basis you can also feed a GeometryCollection to this function.
de: Gibt eine "vereinfachte" Version der gegebenen Geometrie zurück. Verwendet den Visvalingam-Whyatt Algorithmus. Tut zurzeit nur mit (Multi)Lines und (Multi)Polygons etwas, kann aber gefahrlos mit jedem geometrischen Datentyp verwendet werden. Da die Vereinfachung auf einer Objekt zu Objekt Basis passiert, können Sie diese Funktion auch mit einer Sammelgeometrie speisen.
ja: Visvalingam-Whyattアルゴリズムを用いて、入力ジオメトリを「簡略化」したジオメトリを返します。(マルチ)ラインと(マルチ)ポリゴンでのみ動作しますが、どの種類のジオメトリでも安全に呼ぶことができます。(MULTI)LINEと(MULTI)POLYGONとで実際に動作をしますが、どのような種類のジオメトリでも安全に呼ぶことができます。簡略化はオブジェクトごとに行われるので、ジオメトリコレクションでこの関数を呼ぶことができます。
ko_kr: 비스베일링검-와이어트(Visvalingam-Whyatt) 알고리즘을 이용해서 입력 도형의 "단순화"된 버전을 반환합니다. 실제로는 [멀티]라인, [멀티]폴리곤과만 작동하지만, 어떤 종류의 도형도 입력할 수 있다고 해도 과언은 아닙니다. 객체별 기반으로 단순화 작업을 하기 때문에 이 함수에 도형 집합도 입력할 수 있습니다.
zh_hans: 使用 Visvalingam-Whyatt 算法返回给定几何图形的“简化”版本。 实际上只会对（多）线和（多）多边形执行某些操作，但您可以使用任何类型的几何体安全地调用它。 由于简化是在逐个对象的基础上进行的，因此您还可以将 GeometryCollection 提供给此函数。

source: This function handles 3D and the third dimension will affect the result.
de: Diese Funktion kann mit 3D umgehen und die dritte Dimension beeinflusst auch das Ergebnis.
ja: この関数は3次元を扱います。第3次元は結果に影響を与えます。
ko_kr: 이 함수는 3차원을 처리하며, 세 번째 차원이 결과에 영향을 미칠 것입니다.
zh_hans: 该函数处理 3D，第三维将影响结果。

source: A LineString is simplified with a minimum area threshold of 30.
de: Ein Linienzug vereinfacht mit einem Schwellenwert von 30 für die minimale Fläche.
ja: ラインストリングを最小範囲のしきい値を30で簡略化しています。
ko_kr: 라인스트링을 최소 임계 면적(minimum area threshold) 30으로 단순화합니다.
zh_hans: LineString 通过最小面积阈值 30 进行简化。
