Repository: postgis/postgis
Catalog: doc/po/*/reference_processing.xml.po
Languages: de, ja, ko_kr, zh_hans

source: SELECT ST_AsText(ST_Intersection('POINT(0 0)'::geometry, 'LINESTRING ( 2 0, 0 2 )'::geometry)); st_astext --------------- GEOMETRYCOLLECTION EMPTY (1 row) SELECT ST_AsText(ST_Intersection('POINT(0 0)'::geometry, 'LINESTRING ( 0 0, 0 2 )'::geometry)); st_astext --------------- POINT(0 0) (1 row) ---Clip all lines (trails) by country (here we assume country geom are POLYGON or MULTIPOLYGONS) -- NOTE: we are only keeping intersections that result in a LINESTRING or MULTILINESTRING because we don't -- care about trails that just share a point -- the dump is needed to expand a geometry collection into individual single MULT* parts -- the below is fairly generic and will work for polys, etc. by just changing the where clause SELECT clipped.gid, clipped.f_name, clipped_geom FROM (SELECT trails.gid, trails.f_name, (ST_Dump(ST_Intersection(country.the_geom, trails.the_geom))).geom As clipped_geom FROM country INNER JOIN trails ON ST_Intersects(country.the_geom, trails.the_geom)) As clipped WHERE ST_Dimension(clipped.clipped_geom) = 1 ; --For polys e.g. polygon landmarks, you can also use the sometimes faster hack that buffering anything by 0.0 -- except a polygon results in an empty geometry collection --(so a geometry collection containing polys, lines and points) -- buffered by 0.0 would only leave the polygons and dissolve the collection shell SELECT poly.gid, ST_Multi(ST_Buffer( ST_Intersection(country.the_geom, poly.the_geom), 0.0) ) As clipped_geom FROM country INNER JOIN poly ON ST_Intersects(country.the_geom, poly.the_geom) WHERE Not ST_IsEmpty(ST_Buffer(ST_Intersection(country.the_geom, poly.the_geom),0.0));
de: SELECT ST_AsText(ST_Intersection('POINT(0 0)'::geometry, 'LINESTRING ( 2 0, 0 2 )'::geometry)); st_astext --------------- GEOMETRYCOLLECTION EMPTY (1 row) SELECT ST_AsText(ST_Intersection('POINT(0 0)'::geometry, 'LINESTRING ( 0 0, 0 2 )'::geometry)); st_astext --------------- POINT(0 0) (1 row) ---Schneidet alle Linien (Wege) nach dem Staat aus (wir nehmen an, dass es sich bei der Geometrie um Polygone oder MultiPolygone handelt) -- Anmerkung: wir behalten nur jene Verschneidungen, die zu einem LineString oder MultiLinestring führen, da wir uns nicht -- um jene Wege kümmern, die nur einen Punkt teilen -- ST_Dump wird benötigt um eine Sammelgeometrie/GeometryCollection in individuelle einzelne MULTI* Teile zu zerlegen -- der untere Code ist sehr generisch und funktioniert auch mit Polygonen etc. indem man die Where-Klausel ändert SELECT clipped.gid, clipped.f_name, clipped_geom FROM (SELECT trails.gid, trails.f_name, (ST_Dump(ST_Intersection(country.the_geom, trails.the_geom))).geom As clipped_geom FROM country INNER JOIN trails ON ST_Intersects(country.the_geom, trails.the_geom)) As clipped WHERE ST_Dimension(clipped.clipped_geom) = 1 ; --Bei Polygonen, z.B. polygonale Landgrenzen, können Sie auch den manchmal schnelleren Hack verwenden, indem Sie alles mit 0.0 puffern -- außer ein Polygon führt zu einer leeren Sammelgeometrie/GeometryCollection --(wie bei einer Sammelgeometrie, die Polygone, Linien und Punkte enthält) -- mit 0.0 gepuffert hinterlässt nur die Polygone und löst die Hülle der Sammelgeometrie auf SELECT poly.gid, ST_Multi(ST_Buffer( ST_Intersection(country.the_geom, poly.the_geom), 0.0) ) As clipped_geom FROM country INNER JOIN poly ON ST_Intersects(country.the_geom, poly.the_geom) WHERE Not ST_IsEmpty(ST_Buffer(ST_Intersection(country.the_geom, poly.the_geom),0.0));
ja: SELECT ST_AsText(ST_Intersection('POINT(0 0)'::geometry, 'LINESTRING ( 2 0, 0 2 )'::geometry)); st_astext --------------- GEOMETRYCOLLECTION EMPTY (1 row) SELECT ST_AsText(ST_Intersection('POINT(0 0)'::geometry, 'LINESTRING ( 0 0, 0 2 )'::geometry)); st_astext --------------- POINT(0 0) (1 row) -- trailsテーブルの線を全てをcountryテーブル -- (POLYGONかMULTIPOLYGONであるとします)で切り抜きます -- ご注意: trailsが点を共有することに注意を払っていないため -- LINESTRINGかMULTILINESTRINGとなるインタセクションのみを -- 抜き出すようにしています -- ダンプはコレクションから個々のMULTI系ポリゴンに展開するために必要です -- 下に示したのは、かなり一般的なもので、WHERE節を変更するだけで -- ポリゴンや他でも動作します。 SELECT clipped.gid, clipped.f_name, clipped_geom FROM (SELECT trails.gid, trails.f_name, (ST_Dump(ST_Intersection(country.the_geom, trails.the_geom))).geom As clipped_geom FROM country INNER JOIN trails ON ST_Intersects(country.the_geom, trails.the_geom)) As clipped WHERE ST_Dimension(clipped.clipped_geom) = 1 ; -- ランドマーク等のポリゴンに対しては、 -- 0.0を指定したバッファを使う、高速にする技を使うことができます -- ただし、ポリゴンが空のジオメトリコレクションの結果になる時を除きます -- (ジオメトリコレクションはポリゴン、ライン、ポイントを含みます) -- 0.0でバッファを施すと、ポリゴンはそのままで、コレクションの殻は分解されます。 SELECT poly.gid, ST_Multi(ST_Buffer( ST_Intersection(country.the_geom, poly.the_geom), 0.0) ) As clipped_geom FROM country INNER JOIN poly ON ST_Intersects(country.the_geom, poly.the_geom) WHERE Not ST_IsEmpty(ST_Buffer(ST_Intersection(country.the_geom, poly.the_geom),0.0));
ko_kr: SELECT ST_AsText(ST_Intersection('POINT(0 0)'::geometry, 'LINESTRING ( 2 0, 0 2 )'::geometry)); st_astext --------------- GEOMETRYCOLLECTION EMPTY (1 row) SELECT ST_AsText(ST_Intersection('POINT(0 0)'::geometry, 'LINESTRING ( 0 0, 0 2 )'::geometry)); st_astext --------------- POINT(0 0) (1 row) -- 지자체 경계선으로 모든 라인(길)을 잘라냅니다(이때 지자체 도형이 폴리곤 또는 멀티폴리곤이라고 가정합니다). -- 주의: 라인스트링 또는 멀티라인스트링으로 출력되는 교차점만 유지합니다. -- 포인트만을 공유하는 길에는 관심이 없기 때문입니다. -- 도형 집합을 개별 멀티 도형 부분들로 확장하기 위해 덤프를 받아야 합니다. -- 다음은 꽤 일반적인 쿼리로 WHERE 절을 변경하는 것만으로 여러 유형들을 작업할 수 있습니다. SELECT clipped.gid, clipped.f_name, clipped_geom FROM (SELECT trails.gid, trails.f_name, (ST_Dump(ST_Intersection(country.the_geom, trails.the_geom))).geom As clipped_geom FROM country INNER JOIN trails ON ST_Intersects(country.the_geom, trails.the_geom)) As clipped WHERE ST_Dimension(clipped.clipped_geom) = 1 ; -- 폴리곤 랜드마크 같은 폴리곤의 경우, 텅 빈 도형 집합으로 출력되는 폴리곤을 제외한 (즉 폴리곤, 라인 및 포인트를 담고 있는 도형 집합의) 모든 것에 버퍼를 0.0으로 적용하는 더 빠른 꼼수를 쓸 수도 있습니다. -- 버퍼를 0.0으로 적용하면 집합 구조를 없애고 폴리곤만 남기게 됩니다. SELECT poly.gid, ST_Multi(ST_Buffer( ST_Intersection(country.the_geom, poly.the_geom), 0.0) ) As clipped_geom FROM country INNER JOIN poly ON ST_Intersects(country.the_geom, poly.the_geom) WHERE Not ST_IsEmpty(ST_Buffer(ST_Intersection(country.the_geom, poly.the_geom),0.0));

source: Examples: 2.5Dish
de: Beispiele: 2.5D-isch
ja: 例: 2.5次元的なもの
ko_kr: 예시: 대략 2.5차원

source: Geos is the default backend if not set. Note this is not a true intersection, compare to the same example using <xref linkend="ST_3DIntersection"/>.
de: GEOS ist standardmäßig das Back-end, falls nicht anders gesetzt. Beachten Sie bitte, das dies keine richtige Verschneidung ist. Vergleiche das gleiche Beispiel mit <xref linkend="ST_3DIntersection"/>.
ja: GEOSが、バックエンド指定がない場合のデフォルトです。<xref linkend="ST_3DIntersection"/>を使った同じ例と比較します。
ko_kr: 따로 설정하지 않았다면 GEOS가 기본 백엔드입니다. 이 함수는 진정한 교차가 아니라는 점에 주의하십시오. <xref linkend="ST_3DIntersection"/> 함수로 동일한 예시를 실행해서 비교해보십시오.

source: If your PostGIS is compiled with sfcgal support, have option of using sfcgal, but note if basically cases down both geometries to 2D before doing intersection and returns the ST_Force2D equivalent result which is a 2D geometry
de: Wenn PostGIS mit SFCGAL Unterstützung kompiliert wurde, haben Sie die Möglichkeit sfcgal zu verwenden. Beachten Sie aber bitte, dass hierbei beide Geometrien grundsätzlich auf 2D reduziert werden, bevor die Verschneidung ausgeführt wird und das ein Ergebnis äquivalent zu ST_Force2D zurückggegeben wird, welches eine 2D-Geometrie ist.
ja: PostGISをSFCGAL対応でコンパイルしている場合には、SFCGAL使用の選択肢があります。ただし、基本的にインタセクション実行前にジオメトリを2次元に落とし、ST_Force2Dと等価な2次元ジオメトリを返します。
ko_kr: SFCGAL 지원과 함께 사용자 PostGIS를 컴파일한 경우, SFCGAL을 사용하도록 선택할 수 있습니다. 그러나 기본적으로, 교차 작업을 하기 전에 도형을 2차원으로 변환하거나, ST_Force2D와 동등한, 2차원 도형인 결과를 반환하거나 하는 두 가지 경우로 압축됩니다.

source: Converts a LINESTRING/POLYGON to a CIRCULARSTRING, CURVEPOLYGON
de: Wandelt einen LINESTRING/POLYGON in einen CIRCULARSTRING, CURVEPOLYGON um
ja: LINESTRING/POLYGONをCIRCULARSTRINGかCURVEPOLYGONに変換します。
ko_kr: 라인스트링/폴리곤을 원호 스트링/만곡 폴리곤으로 변환합니다.

source: Converts plain LINESTRING/POLYGON to CIRCULAR STRINGs and Curved Polygons. Note much fewer points are needed to describe the curved equivalent.
de: Wandelt einen einfachen LineString/Polygon in Kreisbögen/CIRCULARSTRINGs und Kurvenpolygone um. Beachten Sie, dass wesentlich weniger Punkte zur Beschreibung des Kurvenäquivalents benötigt werden.
ja: LINESTRING/POLYGONをCIRCULARSTRINGと曲線ポリゴンに変換します。等価の曲線を記述するのに必要なポイントが少なくなります。

source: If the input LINESTRING/POLYGON is not curved enough to clearly represent a curve, the function will return the same input geometry.
de: Wenn der gegebene LINESTRING/POLYGON nicht genug gekrümmt ist um eine deutliche Kurve zu repräsentieren, wird die Geometrie von der Funktion unverändert zurückgegeben.
ja: 入力ラインストリング/ポリゴンが、曲線をはっきりと表現するのには不十分な場合には、関数は入力ジオメトリと同じものを返します。

source: -- 2D Example SELECT ST_AsText(ST_LineToCurve(foo.the_geom)) As curvedastext,ST_AsText(foo.the_geom) As non_curvedastext FROM (SELECT ST_Buffer('POINT(1 3)'::geometry, 3) As the_geom) As foo; curvedatext non_curvedastext --------------------------------------------------------------------|----------------------------------------------------------------- CURVEPOLYGON(CIRCULARSTRING(4 3,3.12132034355964 0.878679656440359, | POLYGON((4 3,3.94235584120969 2.41472903395162,3.77163859753386 1.85194970290473, 1 0,-1.12132034355965 5.12132034355963,4 3)) | 3.49440883690764 1.33328930094119,3.12132034355964 0.878679656440359, | 2.66671069905881 0.505591163092366,2.14805029709527 0.228361402466141, | 1.58527096604839 0.0576441587903094,1 0, | 0.414729033951621 0.0576441587903077,-0.148050297095264 0.228361402466137, | -0.666710699058802 0.505591163092361,-1.12132034355964 0.878679656440353, | -1.49440883690763 1.33328930094119,-1.77163859753386 1.85194970290472 | --ETC-- ,3.94235584120969 3.58527096604839,4 3)) --3D example SELECT ST_AsText(ST_LineToCurve(geom)) As curved, ST_AsText(geom) AS not_curved FROM (SELECT ST_Translate(ST_Force3D(ST_Boundary(ST_Buffer(ST_Point(1,3), 2,2))),0,0,3) AS geom) AS foo; curved | not_curved ------------------------------------------------------+--------------------------------------------------------------------- CIRCULARSTRING Z (3 3 3,-1 2.99999999999999 3,3 3 3) | LINESTRING Z (3 3 3,2.4142135623731 1.58578643762691 3,1 1 3, | -0.414213562373092 1.5857864376269 3,-1 2.99999999999999 3, | -0.414213562373101 4.41421356237309 3, | 0.999999999999991 5 3,2.41421356237309 4.4142135623731 3,3 3 3) (1 row)
de: -- 2D-Beispiel SELECT ST_AsText(ST_LineToCurve(foo.the_geom)) As curvedastext,ST_AsText(foo.the_geom) As non_curvedastext FROM (SELECT ST_Buffer('POINT(1 3)'::geometry, 3) As the_geom) As foo; curvedatext non_curvedastext --------------------------------------------------------------------|----------------------------------------------------------------- CURVEPOLYGON(CIRCULARSTRING(4 3,3.12132034355964 0.878679656440359, | POLYGON((4 3,3.94235584120969 2.41472903395162,3.77163859753386 1.85194970290473, 1 0,-1.12132034355965 5.12132034355963,4 3)) | 3.49440883690764 1.33328930094119,3.12132034355964 0.878679656440359, | 2.66671069905881 0.505591163092366,2.14805029709527 0.228361402466141, | 1.58527096604839 0.0576441587903094,1 0, | 0.414729033951621 0.0576441587903077,-0.148050297095264 0.228361402466137, | -0.666710699058802 0.505591163092361,-1.12132034355964 0.878679656440353, | -1.49440883690763 1.33328930094119,-1.77163859753386 1.85194970290472 | --ETC-- ,3.94235584120969 3.58527096604839,4 3)) --3D-Beispiel SELECT ST_AsText(ST_LineToCurve(geom)) As curved, ST_AsText(geom) AS not_curved FROM (SELECT ST_Translate(ST_Force3D(ST_Boundary(ST_Buffer(ST_Point(1,3), 2,2))),0,0,3) AS geom) AS foo; curved | not_curved ------------------------------------------------------+--------------------------------------------------------------------- CIRCULARSTRING Z (3 3 3,-1 2.99999999999999 3,3 3 3) | LINESTRING Z (3 3 3,2.4142135623731 1.58578643762691 3,1 1 3, | -0.414213562373092 1.5857864376269 3,-1 2.99999999999999 3, | -0.414213562373101 4.41421356237309 3, | 0.999999999999991 5 3,2.41421356237309 4.4142135623731 3,3 3 3) (1 row)
ja: -- 2次元の例 SELECT ST_AsText(ST_LineToCurve(foo.the_geom)) As curvedastext,ST_AsText(foo.the_geom) As non_curvedastext FROM (SELECT ST_Buffer('POINT(1 3)'::geometry, 3) As the_geom) As foo; curvedatext non_curvedastext --------------------------------------------------------------------|----------------------------------------------------------------- CURVEPOLYGON(CIRCULARSTRING(4 3,3.12132034355964 0.878679656440359, | POLYGON((4 3,3.94235584120969 2.41472903395162,3.77163859753386 1.85194970290473, 1 0,-1.12132034355965 5.12132034355963,4 3)) | 3.49440883690764 1.33328930094119,3.12132034355964 0.878679656440359, | 2.66671069905881 0.505591163092366,2.14805029709527 0.228361402466141, | 1.58527096604839 0.0576441587903094,1 0, | 0.414729033951621 0.0576441587903077,-0.148050297095264 0.228361402466137, | -0.666710699058802 0.505591163092361,-1.12132034355964 0.878679656440353, | -1.49440883690763 1.33328930094119,-1.77163859753386 1.85194970290472 | --ETC-- ,3.94235584120969 3.58527096604839,4 3)) -- 3次元の例 SELECT ST_AsText(ST_LineToCurve(geom)) As curved, ST_AsText(geom) AS not_curved FROM (SELECT ST_Translate(ST_Force3D(ST_Boundary(ST_Buffer(ST_Point(1,3), 2,2))),0,0,3) AS geom) AS foo; curved | not_curved ------------------------------------------------------+--------------------------------------------------------------------- CIRCULARSTRING Z (3 3 3,-1 2.99999999999999 3,3 3 3) | LINESTRING Z (3 3 3,2.4142135623731 1.58578643762691 3,1 1 3, | -0.414213562373092 1.5857864376269 3,-1 2.99999999999999 3, | -0.414213562373101 4.41421356237309 3, | 0.999999999999991 5 3,2.41421356237309 4.4142135623731 3,3 3 3) (1 row)

source: Attempts to make an invalid geometry valid without losing vertices.
de: Versucht eine ungültige Geometrie, ohne den Verlust an Knoten zu bereinigen.
ja: 頂点を失うことなしに不正なジオメトリを妥当なジオメトリにしようと試みます。
ko_kr: 유효하지 않은 도형을 꼭짓점을 버리지 않고 유효한 도형으로 바꾸려고 시도합니다.

source: The function attempts to create a valid representation of a given invalid geometry without losing any of the input vertices. Already-valid geometries are returned without further intervention.
de: Diese Funktion versucht aus einer invaliden Geometrie eine valide Darstellung zu erzeugen, ohne irgendeinen gegebenen Knoten zu verlieren. Geometrien, die bereits valide sind, werden ohne weiteren Eingriff zurückgegeben.
ja: 入力頂点を失うことなしに、与えられた不正なジオメトリの妥当な表現を生成しようと試みます。既に妥当であるジオメトリは、さらなる操作を行わずに返ります。
ko_kr: 이 함수는 주어진 유효하지 않은 도형을 입력 꼭짓점 하나도 버리지 않은 채 유효한 표현식으로 생성하려 시도합니다. 이미 유효한 도형을 입력하면 아무 것도 바꾸지 않은 채 반환합니다.

source: Supported inputs are: POINTS, MULTIPOINTS, LINESTRINGS, MULTILINESTRINGS, POLYGONS, MULTIPOLYGONS and GEOMETRYCOLLECTIONS containing any mix of them.
de: Unterstützte Eingaben sind: POINTS, MULTIPOINTS, LINESTRINGS, MULTILINESTRINGS, POLYGONS, MULTIPOLYGONS und GEOMETRYCOLLECTIONS aus einer Mischung der Vorigen.
ja: 対応する入力はPOINTS, MULTIPOINTS, LINESTRING, MULTILINESTRING, POLYGON, MULTIPOLYGON, GEOMETRYCOLLECTIONおよびそれらの混交したものです。
ko_kr: 포인트, 멀티포인트, 라인스트링, 멀티라인스트링, 폴리곤, 멀티폴리곤 및 이들의 어떤 조합이건 담고 있는 도형 집합을 입력받을 수 있습니다.

source: In case of full or partial dimensional collapses, the output geometry may be a collection of lower-to-equal dimension geometries or a geometry of lower dimension.
de: Im Falle eines völligen oder teilweisen dimensionalen Kollapses kann die Ausgabegeometrie eine Sammelgeometrie von niedriger oder gleicher geometrischer Dimension oder eine Geometrie mit niedrigerer geometrischer Dimension sein.
ja: 全部また部分的に次元減少が発生した場合には、出力ジオメトリが低い次元のジオメトリまたは元の次元以下の次元のコレクションになります。
ko_kr: 전체 또는 일부 차원이 붕괴한 경우, 낮거나 동등한 차원을 가진 도형들의 집합 또는 낮은 차원의 도형을 출력할 수도 있습니다.

source: Single polygons may become multi-geometries in case of self-intersections.
de: Im Fall von Selbstüberschneidungen können Polygone zu Mehrfachgeometrien werden.
ja: 単一ポリゴンは、自己インタセクトがある場合には、マルチポリゴンになります。
ko_kr: 스스로 교차하는 경우 단일 폴리곤이 멀티 도형이 될 수도 있습니다.

source: Availability: 2.0.0, requires GEOS-3.3.0
de: Verfügbarkeit: 2.0.0 benötigt GEOS-3.3.0
ja: Availability: 2.0.0, GEOS 3.3.0以上が必要です。
ko_kr: 2.0.0 버전부터 사용할 수 있습니다. GEOS 3.3.0 버전이 필요합니다.

source: Enhanced: 2.0.1, speed improvements requires GEOS-3.3.4
de: Erweiterung: 2.0.1, Geschwindigkeitsverbesserungen, benötigt GEOS-3.3.4
ja: Enhanced: 2.0.1 速度向上しました。GEOS 3.3.4が必要です。
ko_kr: 개선 사항: 2.1.0 버전에서 속도가 향상됐습니다. GEOS 3.3.4 버전이 필요합니다.

source: Enhanced: 2.1.0 added support for GEOMETRYCOLLECTION and MULTIPOINT.
de: Erweiterung: 2.1.0 die Unterstützung von GeometryCollection und MultiPoint hinzugefügt.
ja: Enhanced: 2.1.0 GEOMETRYCOLLECTIONとMULTIPOINTに対応するようになりました。
ko_kr: 개선 사항: 2.1.0 버전부터 도형 집합 및 멀티포인트를 지원하기 시작했습니다.

source: Same as ST_Union, only memory-friendly (uses less memory and more processor time).
de: Das gleiche wie ST_Union, nur freundlicher zum Arbeitsspeicher (verwendet weniger Arbeitsspeicher und mehr Rechnerzeit).
ja: ST_Unionと同じですが、メモリフレンドリ (少ないメモリ使用、多いCPU時間)です。
ko_kr: 메모리 친화적이라는 점만 제외하면 ST_Union 함수와 동일합니다(메모리를 덜 사용하고 CPU 시간을 더 사용합니다).

source: Some useful description here.
de: Hier fehlt eine brauchbare Beschreibung.
ja: (説明を記載)
ko_kr: 쓸 만한 설명을 추가바랍니다.

source: Same as ST_Union, only memory-friendly (uses less memory and more processor time). This aggregate function works by unioning the geometries one at a time to previous result as opposed to ST_Union aggregate which first creates an array and then unions
de: Das gleiche wie ST_Union, nur freundlicher zum Arbeitsspeicher (verwendet weniger Arbeitsspeicher und mehr Rechnerzeit). Diese Aggregatfunktion vereingt eine Geometrie nach der anderen zu dem vorhergegangenen Ergebnis, während die Aggregatfunktion ST_Union zuerst ein Feld erzeugt und anschließend vereinigt
ja: ST_Unionと同じですが、メモリフレンドリ (少ないメモリ使用、多いCPU時間)です。この集約関数は、最初に配列を作って結合していくST_Union集約関数と対象的に、一つずつ前の結果にジオメトリを結合させることによって動作します。
ko_kr: 메모리 친화적이라는 점만 제외하면 ST_Union 함수와 동일합니다(메모리를 덜 사용하고 CPU 시간을 더 사용합니다). 먼저 배열을 생성한 다음 통합하는 ST_Union 종합 함수와는 달리, 이 종합 합수는 이전 단계의 결과물에 도형을 하나씩 통합하는 식으로 동작합니다.

source: See ST_Union
de: Siehe ST_Union
ja: ST_Unionを参照して下さい。
ko_kr: ST_Union 참고

source: Returns the smallest circle polygon that can fully contain a geometry. Default uses 48 segments per quarter circle.
de: Gibt das kleinstmögliche Kreispolygon zurück, welches eine Geometrie zur Gänze beinhaltet. Standardmäßig werden 48 Segmente pro Viertelkreiss verwendet.
ja: ジオメトリを完全に含む最小の円ポリゴンを返します。デフォルトでは、4分の1円に対して48区分を使用します。
ko_kr: 도형 전체를 담을 수 있는 가장 작은 원형 폴리곤을 반환합니다. 기본값은 사분원 당 구간 48개를 사용하는 것입니다.

source: Returns the smallest circle polygon that can fully contain a geometry.
de: Gibt das kleinstmögliche Kreispolygon zurück, welches eine Geometrie zur Gänze beinhaltet.
ja: ジオメトリを完全に含む最小の円ポリゴンを返します。
ko_kr: 도형 전체를 담을 수 있는 가장 작은 원형 폴리곤을 반환합니다.

source: The circle is approximated by a polygon with a default of 48 segments per quarter circle. Because the polygon is an approximation of the minimum bounding circle, some points in the input geometry may not be contained within the polygon. The approximation can be improved by increasing the number of segments, with little performance penalty. For applications where a polygonal approximation is not suitable, ST_MinimumBoundingRadius may be used.
de: Der Kreis wird standardmäßig durch ein Polygon mit 48 Segmenten pro Viertelkreis angenähert. Da das Polygon eine Annäherung an den minimalen Umgebungskreis ist, können einige Punkte der Eingabegeometrie nicht in dem Polygon enthalten sein. Die Annäherung kann durch Erhöhung der Anzahl der Segmente mit geringen Einbußen bei der Rechenleistung verbessert werden. Bei Anwendungen wo eine polygonale Annäherung nicht ausreicht, kann ST_MinimumBoundingRadius verwendet werden.
ja: 円はポリゴンで近似されます。デフォルトでは、4分の1円で48辺です。このポリゴンは円の最小バウンディングボックスの近似であるので、入力ジオメトリのいくつかの点はポリゴンに入らない可能性があります。この近似は辺の数を増やすことによって改善され、辺の数を増やすことで得られる不利益は小さいです。ポリゴン近似が適切でない場合のアプリケーションにおいては、ST_MinimumBoundingRadiusを使います。
ko_kr: 사분원 당 구간 48개라는 기본값으로 원에 가까운 폴리곤을 생성합니다. 이 폴리곤이 최소 경계 원(minimum bounding circle)의 근사치이기 때문에, 입력 도형 안에 있는 포인트 몇 개는 폴리곤 내부에 담기지 않을 수도 있습니다. 구간의 개수를 늘리면 성능을 거의 저하시키지 않고도 근사치를 향상시킬 수 있습니다. 폴리곤 근사치가 적당하지 않은 경우, ST_MinimumBoundingRadius 함수를 사용할 수도 있습니다.

source: It is often used with MULTI and Geometry Collections. Although it is not an aggregate - you can use it in conjunction with ST_Collect to get the minimum bounding circle of a set of geometries. ST_MinimumBoundingCircle(ST_Collect(somepointfield)).
de: Wird üblicherweise auf Mehrfach/MULTI- und Sammelgeometrien/GeometryCollections angewandt. Obwohl es sich nicht um eine Aggregatfunktion handelt, können Sie es in Verbindung mit ST_Collect verwenden um den kleinstmöglichen Umgebungskreis eines Satzes an Geometrien zu erhalten. ST_MinimumBoundingCircle(ST_Collect(somepointfield)).
ja: しばしば、MULTI系とジオメトリコレクションで使用します。しかし、集約関数ではありません。ST_Collectと併用して、ジオメトリの集合の最小包含円を得ます。ST_MinimumBoundingCircle(ST_Collect(somepointfield))とします。
ko_kr: 이 함수는 주로 멀티 도형 및 도형 집합을 입력받습니다. 비록 종합 함수는 아니지만, ST_Collect과 결합해서 도형들의 집합의 최소 경계 원을 얻을 수 있습니다. 예: ST_MinimumBoundingCircle(ST_Collect(somepointfield))

source: The ratio of the area of a polygon divided by the area of its Minimum Bounding Circle is often referred to as the Roeck test.
de: Das Verhältnis zwischen der Fläche des Polygons und der Fläche ihres kleinstmöglichen Umgebungskreises wird öfter als Roeck Test bezeichnet.
ja: ポリゴンの面積を最小包含円の面積で割った割合は、しばしばRoeckテストとして参照されます。
ko_kr: 폴리곤의 면적을 최소 경계 원의 면적으로 나눈 비율을 종종 루크(Roeck) 테스트라고 부릅니다.

source: Availability: 1.4.0 - requires GEOS
de: Verfügbarkeit: 1.4.0 - benötigt GEOS
ja: Availability: 1.4.0 - GEOSが必要です。
ko_kr: 1.4.0 버전부터 사용할 수 있습니다. GEOS가 필요합니다.

source: Minimum bounding circle of a point and linestring. Using 8 segs to approximate a quarter circle
de: Minimaler Umgebungskreis eines Punktes und eines Linienzuges. Verwendet 8 Segmente um einen Viertelkreis anzunähern.
ja: ポイントとラインストリングの最小包含円です。4分の1円の近似に8区分使用しています。
ko_kr: 포인트 및 라인스트링의 최소 경계 원. 사분원의 근사치를 구하는 데 구간 8개를 이용합니다.
zh_hans: 点和线串的最小外接圆。 用8段近似四分之一圆

source: Returns the center point and radius of the smallest circle that can fully contain a geometry.
de: Gibt den Mittelpunkt und den Radius des kleinstmöglichen Kreises zurück, der die gesamte Geometrie beinhaltet.
ja: ジオメトリを完全に包含する最小円の中心ポイントと半径を返します。
ko_kr: 도형 전체를 담을 수 있는 가장 작은 원의 중심 포인트 및 반지름을 반환합니다.

source: Returns a record containing the center point and radius of the smallest circle that can fully contain a geometry.
de: Gibt einen Datensatz zurück, der aus dem Mittelpunkt und dem Radius des kleinstmöglichen Kreises, der die gesamte Geometrie beinhaltet, besteht.
ja: ジオメトリを完全に包含する最小円の中心ポイントと半径を返します。
ko_kr: 도형 전체를 담을 수 있는 가장 작은 원의 중심 포인트 및 반지름을 담고 있는 레코드를 반환합니다.

source: Can be used in conjunction with <xref linkend="ST_Collect"/> to get the minimum bounding circle of a set of geometries.
de: Kann in Verbindung mit <xref linkend="ST_Collect"/> verwendet werden, um den minimalen Umgebungskreis einer Menge von Geometrien zu erhalten.
ja: ジオメトリの集合の最小包含円を得るには<xref linkend="ST_Collect"/>と併用します。
ko_kr: 도형들의 집합의 최소 경계 원을 얻기 위해 이 함수와 <xref linkend="ST_Collect"/> 함수를 결합해서 이용할 수 있습니다.

source: Aggregate. Creates a GeometryCollection containing possible polygons formed from the constituent linework of a set of geometries.
de: Aggregatfunktion. Erzeugt eine Sammelgeometrie/GeometryCollection, welche Polygone enthält, die aus den einzelnen Linien einer Menge von Geometrien gebildet werden können.
ja: 集約関数。ジオメトリの集合のラインから形成されうるポリゴンを含むジオメトリコレクションを生成します。
ko_kr: 종합 함수입니다. 도형들의 집합의 선분 구성 요소로부터 형성될 수 있는 폴리곤들을 담고 있는 도형 집합을 생성합니다.

source: Creates a GeometryCollection containing possible polygons formed from the constituent linework of a set of geometries.
de: Erzeugt eine Sammelgeometrie/GeometryCollection, welche Polygone enthält, die aus den einzelnen Linien einer Menge von Geometrien gebildet werden können.
ja: ジオメトリの集合のラインから形成された可能なポリゴンを含むジオメトリコレクションを生成します。
ko_kr: 도형들의 집합의 선분 구성 요소로부터 형성될 수 있는 폴리곤들을 담고 있는 도형 집합을 생성합니다.
