Repository: postgis/postgis
Catalog: doc/po/*/reference_misc.xml.po
Languages: de

source: Miscellaneous Functions
de: Sonstige Funktionen

source: <refpurpose>Aggregate. Constructs an array of geometries.</refpurpose>
de: <refpurpose>Aggregatfunktion. Erzeugt ein Geometriefeld.</refpurpose>

source: Description
de: Beschreibung

source: <para>Aggregate. Constructs an array of geometries.</para>
de: <para>Aggregatfunktion. Erzeugt ein Geometriefeld.</para>

source: Enhanced: 2.0.0 support for Polyhedral surfaces, Triangles and TIN was introduced.
de: Erweiterung: 2.0.0 Unterstützung für polyedrische Oberflächen, Dreiecke und TIN wurde eingeführt.

source: Examples
de: Beispiele

source: See Also
de: Siehe auch

source: <refpurpose>Returns a BOX2D representing the maximum extents of the geometry.</refpurpose>
de: <refpurpose>Gibt eine BOX2D zurück, welche die maximale Ausdehnung der Geometrie abbildet.</refpurpose>

source: <para>Returns a BOX2D representing the maximum extents of the geometry.</para>
de: <para>Gibt eine BOX2D zurück, welche die maximale Ausdehnung der Geometrie abbildet.</para>

source: <refpurpose>Returns a BOX3D representing the maximum extents of the geometry.</refpurpose>
de: <refpurpose>Gibt eine BOX3D zurück, welche die maximale Ausdehnung der Geometrie abbildet.</refpurpose>

source: <para>Returns a BOX3D representing the maximum extents of the geometry.</para>
de: <para>Gibt eine BOX3D zurück, welche die maximale Ausdehnung der Geometrie abbildet.</para>

source: Return the 'estimated' extent of the given spatial table. The estimated is taken from the geometry column's statistics. The current schema will be used if not specified.
de: Gibt die "geschätzte" Ausdehnung der räumlichen Tabelle zurück. Die Schätzung beruht auf der Statistik über die Geometriespalten. Wenn kein Schema angegeben ist, wird das aktuelle Schema benutzt.

source: Return the 'estimated' extent of the given spatial table. The estimated is taken from the geometry column's statistics. The current schema will be used if not specified. The default behavior is to also use statistics collected from children tables (tables with INHERITS) if available. If 'parent_ony' is set to TRUE, only statistics for the given table are used and children tables are ignored.
de: Gibt die "geschätzte" Ausdehnung der räumlichen Tabelle zurück. Die Schätzung beruht auf der Statistik über die Geometriespalten. Wenn kein Schema angegeben ist, wird das aktuelle Schema benutzt. Standardmäßig wird auch die über die Kindtabellen (Tabellen mit INHERITS) gesammelte Statistik verwendet, wenn sie verfügbar ist. Wenn "parent_ony" auf TRUE gesetzt ist, dann wird nur die Statistik der gegebenen Tabelle verwendet und die Kindtabellen werden ignoriert.

source: For PostgreSQL&gt;=8.0.0 statistics are gathered by VACUUM ANALYZE and resulting extent will be about 95% of the real one.
de: Bei PostgreSQL&gt;=8.0.0 wird die Statistik über VACUUM ANALYZE gesammelt und die resultierende räumliche Erstreckung liegt bei ungefähr 95% der tatsächlichen.

source: In absence of statistics (empty table or no ANALYZE called) this function returns NULL. Prior to version 1.5.4 an exception was thrown instead.
de: Weenn keine Statistik vorhanden ist (leere Tabelle oder kein ANALYZE aufgerufen), dann gibt diese Funktion NULL zurück. Vor Version 1.5.4 wurde stattdessen eine Fehlermeldung ausgegeben.

source: For PostgreSQL&lt;8.0.0 statistics are gathered by update_geometry_stats() and resulting extent will be exact.
de: Bei PostgreSQL&lt;=8.0.0 wird die Statistik mit "update_geometry_stats()" gesammelt und die resultierende räumliche Erstreckung ist präzise.

source: Availability: 1.0.0
de: Verfügbarkeit: 1.0.0

source: Changed: 2.1.0. Up to 2.0.x this was called ST_Estimated_Extent.
de: Änderung: 2.1.0. Bis zu 2.0.x wurde diese Funktion mit ST_Estimated_Extent bezeichnet.

source: Returns bounding box expanded in all directions from the bounding box of the input geometry. Uses double-precision
de: Gibt ein nach allen Seiten erweitertes umschreibendes Rechteck von dem umschreibenden Rechteck der Ausgangsgeometrie zurück. Verwendet Doppelte Genauigkeit.

source: This function returns a bounding box expanded from the bounding box of the input, either by specifying a single distance with which the box should be expanded in all directions, or by specifying an expansion distance for each direction. Uses double-precision. Can be very useful for distance queries, or to add a bounding box filter to a query to take advantage of a spatial index.
de: Diese Funktion gibt ein umschreibendes Rechteck zurück, das durch eine Vergrößerung des umschreibenden Rechtecks der Eingabe erzeugt wird. Entweder wird eine einzelnen Entfernung angegeben, um die das Rechteck in alle Richtungen erweitert werden soll, oder es wird für jede Richtung eine eigene Entfernung angegeben. Verwendet Doppelte Genauigkeit. Kann bei Distanzabfragen sehr nützlich sein, oder um das umschreibende Rechteck bei einer Abfrage als Filter zu nutzen und so Vorteile aus dem räumlichen Index zu ziehen.

source: In addition to the geometry version of ST_Expand, which is the most commonly used, variants are provided that accept and produce internal BOX2D and BOX3D data types.
de: Zusätzlich zur geometrischen Version von ST_Expand die am häufigsten verwendet wird, gibt es auch Varianten die die internen Datentypen BOX2D und BOX3D annehmen oder erstellen.

source: ST_Expand is similar in concept to ST_Buffer, except while buffer expands the geometry in all directions, ST_Expand expands the bounding box an x,y,z unit amount.
de: ST_Expand ist ähnlich konzipiert wie ST_Buffer, außer dass ST_Buffer die Geometrie in alle Richtungen erweitert, während ST_Expand das umschreibende Rechteck um einen Einheitsbetrag in X,Y,Z erweitert.

source: Units are in the units of the spatial reference system in use denoted by the SRID.
de: Die Einheiten entsprechen den Einheiten des im Ensatz befindlichen Koordinatenreferenzsystems, welches durch die SRID angegeben wird.

source: Pre 1.3, ST_Expand was used in conjunction with distance to do indexable queries. Something of the form <code>the_geom &amp;&amp; ST_Expand('POINT(10 20)', 10) AND ST_Distance(the_geom, 'POINT(10 20)') &lt; 10</code> Post 1.2, this was replaced with the easier ST_DWithin construct.
de: Vor 1.3, wurde ST_Expand in Verbindung mit ST_Distance verwendet um indizierbare Abfragen auszuführen. Etwas wie <code>the_geom &amp;&amp; ST_Expand('POINT(10 20)', 10) AND ST_Distance(the_geom, 'POINT(10 20)') &lt; 10</code> Nach 1.2 wurde dies durch das leichter nutzbare ST_DWithin Konstrukt ersetzt.

source: Availability: 1.5.0 behavior changed to output double precision instead of float4 coordinates.
de: Verfügbarkeit: 1.5.0 die Ausgabe der Koordinaten wurde vom Datentyp "Float4" auf "Double Precision" geändert.

source: Enhanced: 2.3.0 support was added to expand a box by different amounts in different dimensions.
de: Erweiterung: 2.3.0 ein Rechteck kann jetzt in den verschiedenen Dimensionen unterschiedlich erweitert werden.

source: Examples below use US National Atlas Equal Area (SRID=2163) which is a meter projection
de: Die unteren Beispiele verwenden die metrische Projektion " US National Atlas Equal Area" (SRID=2163)

source: <!-- TODO: fix results of documentation to reflect new behavior --> --10 meter expanded box around bbox of a linestring SELECT CAST(ST_Expand(ST_GeomFromText('LINESTRING(2312980 110676,2312923 110701,2312892 110714)', 2163),10) As box2d); st_expand ------------------------------------ BOX(2312882 110666,2312990 110724) --10 meter expanded 3d box of a 3d box SELECT ST_Expand(CAST('BOX3D(778783 2951741 1,794875 2970042.61545891 10)' As box3d),10) st_expand ----------------------------------------------------- BOX3D(778773 2951731 -9,794885 2970052.61545891 20) --10 meter geometry astext rep of a expand box around a point geometry SELECT ST_AsEWKT(ST_Expand(ST_GeomFromEWKT('SRID=2163;POINT(2312980 110676)'),10)); st_asewkt ------------------------------------------------------------------------------------------------- SRID=2163;POLYGON((2312970 110666,2312970 110686,2312990 110686,2312990 110666,2312970 110666))
de: <!-- TODO: fix results of documentation to reflect new behavior --> -- ein um 10 Meter erweitertes Rechteck um die BBox eines Linienzugs SELECT CAST(ST_Expand(ST_GeomFromText('LINESTRING(2312980 110676,2312923 110701,2312892 110714)', 2163),10) As box2d); st_expand ------------------------------------ BOX(2312882 110666,2312990 110724) --10 meter expanded 3d box of a 3d box SELECT ST_Expand(CAST('BOX3D(778783 2951741 1,794875 2970042.61545891 10)' As box3d),10) st_expand ----------------------------------------------------- BOX3D(778773 2951731 -9,794885 2970052.61545891 20) -- die Textdarstellung eines um 10 Meter erweiterten Rechtecks von einer Punktgeometrie SELECT ST_AsEWKT(ST_Expand(ST_GeomFromEWKT('SRID=2163;POINT(2312980 110676)'),10)); st_asewkt ------------------------------------------------------------------------------------------------- SRID=2163;POLYGON((2312970 110666,2312970 110686,2312990 110686,2312990 110666,2312970 110666))

source: an aggregate function that returns the bounding box that bounds rows of geometries.
de: Eine Aggregatfunktion, welche das umschreibende Rechteck von Geometriezeilen zurückgibt.

source: ST_Extent returns a bounding box that encloses a set of geometries. The ST_Extent function is an "aggregate" function in the terminology of SQL. That means that it operates on lists of data, in the same way the SUM() and AVG() functions do.
de: ST_Extent gibt das umschreibende Rechteck einer Geometrie zurück. In der Terminologie von SQL ist die Funktion "ST_Extent" eine Aggregatfunktion. Dies bedeutet, dass sie so wie die Funktionen SUM() und AVG() mit Datenzeilen arbeitet.

source: Since it returns a bounding box, the spatial Units are in the units of the spatial reference system in use denoted by the SRID
de: Da ein umschreibendes Rechteck zurückgeben wird, entsprechen die Einheiten dem über SRID angegebenen Koordinatenreferenzsystem.

source: ST_Extent is similar in concept to Oracle Spatial/Locator's SDO_AGGR_MBR
de: ST_Extent ist ähnlich konzipiert wie SDO_AGGR_MBR von Oracle Spatial/Locator

source: Since ST_Extent returns a bounding box, the SRID meta-data is lost. Use ST_SetSRID to force it back into a geometry with SRID meta data. The coordinates are in the units of the spatial ref of the orginal geometries.
de: Da ST_Extent ein umschreibendes Rechteck zurückgibt, gehen die Metadaten für SRID verloren. Verwenden Sie bitte ST_SetSRID um für die Geometrie wieder Metadaten für SRID zu erzwingen. Die Koordinaten sind in den Einheiten des Koordinatenreferenzsystems der ursprünglichen Geometrie.

source: ST_Extent will return boxes with only an x and y component even with (x,y,z) coordinate geometries. To maintain x,y,z use ST_3DExtent instead.
de: ST_Extent gibt Rechtecke zurück, die nur eine X- und Y-Komponente haben, auch dann wenn die zugrundeliegende Geometrie in (X,Y,Z)-Koordinaten vorliegt. Um X,Y,Z zu bewahren, verwenden Sie bitte ST_3DExtent.

source: Availability: 1.4.0
de: Verfügbarkeit: 1.4.0

source: Examples below use Massachusetts State Plane ft (SRID=2249)
de: Untere Beispiele nutzen Massachusetts State Plane ft (SRID=2249)

source: SELECT ST_Extent(the_geom) as bextent FROM sometable; st_bextent ------------------------------------ BOX(739651.875 2908247.25,794875.8125 2970042.75) --Return extent of each category of geometries SELECT ST_Extent(the_geom) as bextent FROM sometable GROUP BY category ORDER BY category; bextent | name ----------------------------------------------------+---------------- BOX(778783.5625 2951741.25,794875.8125 2970042.75) | A BOX(751315.8125 2919164.75,765202.6875 2935417.25) | B BOX(739651.875 2917394.75,756688.375 2935866) | C --Force back into a geometry -- and render the extended text representation of that geometry SELECT ST_SetSRID(ST_Extent(the_geom),2249) as bextent FROM sometable; bextent -------------------------------------------------------------------------------- SRID=2249;POLYGON((739651.875 2908247.25,739651.875 2970042.75,794875.8125 2970042.75, 794875.8125 2908247.25,739651.875 2908247.25))
de: SELECT ST_Extent(the_geom) as bextent FROM sometable; st_bextent ------------------------------------ BOX(739651.875 2908247.25,794875.8125 2970042.75) --Gibt die Ausdehnung der Geometrie pro Kategorie zurück SELECT ST_Extent(the_geom) as bextent FROM sometable GROUP BY category ORDER BY category; bextent | name ----------------------------------------------------+---------------- BOX(778783.5625 2951741.25,794875.8125 2970042.75) | A BOX(751315.8125 2919164.75,765202.6875 2935417.25) | B BOX(739651.875 2917394.75,756688.375 2935866) | C -- In eine Geometrie zurückverwandeln -- und die erweiterte Textdarstellung der Geometrie ausgeben SELECT ST_SetSRID(ST_Extent(the_geom),2249) as bextent FROM sometable; bextent -------------------------------------------------------------------------------- SRID=2249;POLYGON((739651.875 2908247.25,739651.875 2970042.75,794875.8125 2970042.75, 794875.8125 2908247.25,739651.875 2908247.25))

source: an aggregate function that returns the box3D bounding box that bounds rows of geometries.
de: Eine Aggregatfunktion, welche das umschreibende Rechteck einer Geometrie als Box3D zurückgibt.

source: ST_3DExtent returns a box3d (includes Z coordinate) bounding box that encloses a set of geometries. The ST_3DExtent function is an "aggregate" function in the terminology of SQL. That means that it operates on lists of data, in the same way the SUM() and AVG() functions do.
de: ST_3DExtent gibt eine Box3D (bezieht Z Koordinate ein) zurück, die dem umschreibenden Rechteck einer Geometrie entspricht. In der Terminologie von SQL ist die Funktion "ST_3DExtent" eine Aggregatfunktion. Dies bedeutet, dass sie so wie die Funktionen SUM() und AVG() mit Datenzeilen arbeitet.

source: Since ST_3DExtent returns a bounding box, the SRID meta-data is lost. Use ST_SetSRID to force it back into a geometry with SRID meta data. The coordinates are in the units of the spatial ref of the orginal geometries.
de: Da ST_3DExtent ein umschreibendes Rechteck zurückgibt, gehen die Metadaten für SRID verloren. Verwenden Sie bitte ST_SetSRID um für die Geometrie wieder Metadaten für SRID zu erzwingen. Die Koordinaten sind in den Einheiten des Koordinatenreferenzsystems der ursprünglichen Geometrie.

source: Changed: 2.0.0 In prior versions this used to be called ST_Extent3D
de: Änderung: 2.0.0 In Vorgängerversionen als ST_Extent3D bezeichet.

source: SELECT ST_3DExtent(foo.the_geom) As b3extent FROM (SELECT ST_MakePoint(x,y,z) As the_geom FROM generate_series(1,3) As x CROSS JOIN generate_series(1,2) As y CROSS JOIN generate_series(0,2) As Z) As foo; b3extent -------------------- BOX3D(1 1 0,3 2 2) --Get the extent of various elevated circular strings SELECT ST_3DExtent(foo.the_geom) As b3extent FROM (SELECT ST_Translate(ST_Force_3DZ(ST_LineToCurve(ST_Buffer(ST_MakePoint(x,y),1))),0,0,z) As the_geom FROM generate_series(1,3) As x CROSS JOIN generate_series(1,2) As y CROSS JOIN generate_series(0,2) As Z) As foo; b3extent -------------------- BOX3D(1 0 0,4 2 2)
de: SELECT ST_3DExtent(foo.the_geom) As b3extent FROM (SELECT ST_MakePoint(x,y,z) As the_geom FROM generate_series(1,3) As x CROSS JOIN generate_series(1,2) As y CROSS JOIN generate_series(0,2) As Z) As foo; b3extent -------------------- BOX3D(1 1 0,3 2 2) --Gibt die Ausdehnung mehrerer erhöhter Kreisbögen aus SELECT ST_3DExtent(foo.the_geom) As b3extent FROM (SELECT ST_Translate(ST_Force_3DZ(ST_LineToCurve(ST_Buffer(ST_MakePoint(x,y),1))),0,0,z) As the_geom FROM generate_series(1,3) As x CROSS JOIN generate_series(1,2) As y CROSS JOIN generate_series(0,2) As Z) As foo; b3extent -------------------- BOX3D(1 0 0,4 2 2)

source: The syntax is find_srid(a_db_schema, a_table, a_column) and the function returns the integer SRID of the specified column by searching through the GEOMETRY_COLUMNS table.
de: Der Syntax lautet "find_srid(a_db_schema, a_table, a_column)". Die Funktion durchsucht die Tabelle GEOMETRY_COLUMNS und gibt die SRID der ausgewiesenen Spalte zurück.

source: The syntax is find_srid(&lt;db/schema&gt;, &lt;table&gt;, &lt;column&gt;) and the function returns the integer SRID of the specified column by searching through the GEOMETRY_COLUMNS table. If the geometry column has not been properly added with the AddGeometryColumns() function, this function will not work either.
de: Der Syntax lautet "find_srid(&lt;db/schema&gt;, &lt;table&gt;, &lt;column&gt;)". Die Funktion durchsucht die Tabelle GEOMETRY_COLUMNS und gibt die SRID der ausgewiesenen Spalte zurück. Wenn die Geometriespalte mit der Funktion "AddGeometryColumns()" nicht richtig hinzugefügt wurde, dann funktioniert diese Funktion auch nicht.

source: <refpurpose>Returns the amount of space (in bytes) the geometry takes.</refpurpose>
de: <refpurpose>Gibt den Speicherplatzbedarf (in Byte) der Geometrie aus.</refpurpose>

source: <para>Returns the amount of space (in bytes) the geometry takes.</para>
de: <para>Gibt den Speicherplatzbedarf (in Byte) der Geometrie aus.</para>

source: This is a nice compliment to PostgreSQL built in functions pg_column_size, pg_size_pretty, pg_relation_size, pg_total_relation_size.
de: Dies Funktion ist eine schöne Ergänzung zu den in PostgreSQL eingebauten Funktionen pg_column_size, pg_size_pretty, pg_relation_size und pg_total_relation_size.

source: pg_relation_size which gives the byte size of a table may return byte size lower than ST_MemSize. This is because pg_relation_size does not add toasted table contribution and large geometries are stored in TOAST tables.
de: pg_relation_size, das die Größe einer Tabelle in Byte angibt kann niedrigere Werte liefern als ST_MemSize. Dies kann vorkommen, da pg_relation_size den TOAST-Speicher der Tabellen nicht mitrechnet und eine große Geometrie in TOAST-Tabellen gespeichert wird.

source: pg_total_relation_size - includes, the table, the toasted tables, and the indexes.
de: pg_total_relation_size - umfasst die Tabelle, die TOAST-Tabellen und die Indizes.

source: pg_column_size returns how much space a geometry would take in a column considering compression, so may be lower than ST_MemSize
de: pg_column_size gibt den Speicherplatzbedarf an, den eine komprimierte Geometrie benötigen würde und kann daher niedriger sein als "ST_MemSize"

source: Changed: 2.2.0 name changed to ST_MemSize to follow naming convention. In prior versions this function was called ST_Mem_Size, old name deprecated though still available.
de: Änderung: 2.2.0 Bezeichnung auf ST_MemSize geändert um der Namenskonvention zu entsprechen. In Vorgängerversionen als "ST_Mem_Size" bezeichet, ist ihre alte Bezeichnung zwar überholt kann aber noch genutzt werden.

source: --Return how much byte space Boston takes up in our Mass data set SELECT pg_size_pretty(SUM(ST_MemSize(the_geom))) as totgeomsum, pg_size_pretty(SUM(CASE WHEN town = 'BOSTON' THEN ST_MemSize(the_geom) ELSE 0 END)) As bossum, CAST(SUM(CASE WHEN town = 'BOSTON' THEN ST_MemSize(the_geom) ELSE 0 END)*1.00 / SUM(ST_MemSize(the_geom))*100 As numeric(10,2)) As perbos FROM towns; totgeomsum bossum perbos ---------- ------ ------ 1522 kB 30 kB 1.99 SELECT ST_MemSize(ST_GeomFromText('CIRCULARSTRING(220268 150415,220227 150505,220227 150406)')); --- 73 --What percentage of our table is taken up by just the geometry SELECT pg_total_relation_size('public.neighborhoods') As fulltable_size, sum(ST_MemSize(the_geom)) As geomsize, sum(ST_MemSize(the_geom))*1.00/pg_total_relation_size('public.neighborhoods')*100 As pergeom FROM neighborhoods; fulltable_size geomsize pergeom ------------------------------------------------ 262144 96238 36.71188354492187500000
de: -- den Speicherplatzbedarf des Datenbestandes von Boston in Byte SELECT pg_size_pretty(SUM(ST_MemSize(the_geom))) as totgeomsum, pg_size_pretty(SUM(CASE WHEN town = 'BOSTON' THEN ST_MemSize(the_geom) ELSE 0 END)) As bossum, CAST(SUM(CASE WHEN town = 'BOSTON' THEN ST_MemSize(the_geom) ELSE 0 END)*1.00 / SUM(ST_MemSize(the_geom))*100 As numeric(10,2)) As perbos FROM towns; totgeomsum bossum perbos ---------- ------ ------ 1522 kB 30 kB 1.99 SELECT ST_MemSize(ST_GeomFromText('CIRCULARSTRING(220268 150415,220227 150505,220227 150406)')); --- 73 -- Welchen prozentualen Anteil an der Tabelle hat die Geometrie alleine SELECT pg_total_relation_size('public.neighborhoods') As fulltable_size, sum(ST_MemSize(the_geom)) As geomsize, sum(ST_MemSize(the_geom))*1.00/pg_total_relation_size('public.neighborhoods')*100 As pergeom FROM neighborhoods; fulltable_size geomsize pergeom ------------------------------------------------ 262144 96238 36.71188354492187500000

source: Is the point geometry inside the circle defined by center_x, center_y, radius
de: Liegt die Punktgeometrie im Inneren des Kreises, der durch "center_x", "center_y" und "radius" bestimmt wird.

source: The syntax for this functions is ST_PointInsideCircle(&lt;geometry&gt;,&lt;circle_center_x&gt;,&lt;circle_center_y&gt;,&lt;radius&gt;). Returns the true if the geometry is a point and is inside the circle. Returns false otherwise.
de: Der Syntax dieser Funktion ist ST_PointInsideCircle(&lt;geometry&gt;,&lt;circle_center_x&gt;,&lt;circle_center_y&gt;,&lt;radius&gt;). Gibt TRUE zurück, wenn die Geometrie ein Punkt ist und im Inneren des Kreises liegt. Andernfalls wird FALSE ausgegeben.

source: This only works for points as the name suggests
de: Dies funktioniert nur für Punkte, wie die Bezeichnung verrät

source: Availability: 1.2
de: Verfügbarkeit: 1.2

source: Changed: 2.2.0 In prior versions this used to be called ST_Point_Inside_Circle
de: Änderung: 2.0.0 In Vorgängerversionen als ST_Point_Inside_Circle bezeichet.
