Repository: postgis/postgis
Catalog: doc/po/*/reference_processing.xml.po
Languages: de, ja, ko_kr, zh_hans

source: -- Concave Hull L shape points -- at target 80% of convexhull SELECT ST_ConcaveHull(ST_Collect(geom), 0.80) FROM l_shape;
de: -- Konkave Hülle derals L angeordneten Punkte -- mit einem Zielwert von 80% der konvexen Hülle SELECT ST_ConcaveHull(ST_Collect(geom), 0.80) FROM l_shape;
ja: -- 凸包に対する縮小目標割合を80%としたL字型のポイント群の凹包 SELECT ST_ConcaveHull(ST_Collect(geom), 0.80) FROM l_shape;
ko_kr: -- 볼록 껍질의 목표 80%에서 L 형상 포인트들의 오목 껍질 SELECT ST_ConcaveHull(ST_Collect(geom), 0.80) FROM l_shape;

source: multilinestring overlaid with Convex hull
de: MultiLinestring überlagert mit konvexer Hülle
ja: 凸包に覆われたマルチラインストリング
ko_kr: 볼록 껍질과 중첩한 멀티라인스트링

source: multilinestring with overlaid with Concave hull of linestrings at 99% target -- first hop
de: MultiLineString überlagert mit der konkaven Hülle der LineStrings mit einem Zielwert von 99% - erster Versuch
ja: 凸包に対する縮小目標割合を99% (第1段階)とした凹包に覆われたマルチラインストリング
ko_kr: 목표 99% 라인스트링의 오목 껍질과 중첩한 멀티라인스트링 - 첫 번째 단계

source: <refpurpose>The convex hull of a geometry represents the minimum convex geometry that encloses all geometries within the set.</refpurpose>
ja: <refpurpose>凸包は与えられた集合の全てのジオメトリを含む最小の閉じた凸ジオメトリです。</refpurpose>
ko_kr: <refpurpose>도형의 볼록 껍질(convex hull)은 집합 내부의 모든 도형들을 둘러싸는 최소 볼록 도형을 의미합니다.</refpurpose>

source: <para>The convex hull of a geometry represents the minimum convex geometry that encloses all geometries within the set.</para>
de: <para>Die konvexe Hülle einer Geometrie stell die kleinste konvexe Geometrie dar, welche den Satz von Geometrien umschließt.</para>
ja: <para>凸包は与えられた集合の全てのジオメトリを含む最小の閉じた凸ジオメトリです。</para>
ko_kr: <para>도형의 볼록 껍질(convex hull)은 집합 내부의 모든 도형들을 둘러싸는 최소 볼록 도형을 의미합니다.</para>

source: One can think of the convex hull as the geometry you get by wrapping an elastic band around a set of geometries. This is different from a concave hull which is analogous to shrink-wrapping your geometries.
de: Man kann sich die konvexe Hülle als eine Geometrie vorstellen, die man erhält wenn man ein elastisches Band um einen Satz von Geometrien wickelt. Dies unterscheidet sich von der konkaven Hülle, die analog dem Vakuumverpacken von Geometrien ist.
ja: 凸包は、ジオメトリの集合に輪ゴムをかけて得られるジオメトリと見ることができます。これは縮小包装に似ている凹包と異なります。
ko_kr: 볼록 껍질을 도형들의 집합 주위로 고무줄을 둘러서 얻게 되는 도형이라고 생각할 수 있습니다. 사용자 도형들을 진공 수축 포장하는 것에 가까운 오목 껍질과는 다릅니다.

source: It is usually used with MULTI and Geometry Collections. Although it is not an aggregate - you can use it in conjunction with ST_Collect to get the convex hull of a set of points. ST_ConvexHull(ST_Collect(somepointfield)).
de: Wird üblicherweise auf Mehrfach/MULTI- und Sammelgeometrien/GeometryCollections angewandt. Obwohl es sich nicht um eine Aggregatfunktion handelt, können Sie es in Verbindung mit ST_Collect verwenden um die konvexe Hülle einer Punktmenge zu erhalten. ST_ConvexHull(ST_Collect(somepointfield)).
ja: 通常はMULTI系まはたジオメトリカラムを使いますが、集約関数ではありません - ST_Collectと併用してST_ConvexHull(ST_Collect(somepointfield))とすると、ポイントの集合の凸包を得ることができます。
ko_kr: 이 함수는 주로 멀티 도형 및 도형 집합을 입력받습니다. 비록 종합 함수는 아니지만, ST_Collect과 결합해서 포인트 집합의 볼록 껍질을 얻을 수 있습니다. 예: ST_ConvexHull(ST_Collect(somepointfield))

source: It is often used to determine an affected area based on a set of point observations.
de: Wird oft zur Bestimmung einer beeinträchtigten Fläche aus einem Satz von Beobachtungspunkten verwendet.
ja: ポイント観察の集合を基にして、影響を受ける範囲を決定するのに使用します。
ko_kr: 이 함수는 포인트 집합 관찰에 기반한 영향 면적을 추산하는 데 자주 쓰입니다.

source: --Get estimate of infected area based on point observations SELECT d.disease_type, ST_ConvexHull(ST_Collect(d.the_geom)) As the_geom FROM disease_obs As d GROUP BY d.disease_type;
de: -- Abschätzung des infizierten Gebietes aus Punktbeobachtungen SELECT d.disease_type, ST_ConvexHull(ST_Collect(d.the_geom)) As the_geom FROM disease_obs As d GROUP BY d.disease_type;
ja: -- ポイント観察に基づいて、感染域の推定を得る SELECT d.disease_type, ST_ConvexHull(ST_Collect(d.the_geom)) As the_geom FROM disease_obs As d GROUP BY d.disease_type;
ko_kr: -- 포인트 관찰에 기반한 영향 면적 추산하기 SELECT d.disease_type, ST_ConvexHull(ST_Collect(d.the_geom)) As the_geom FROM disease_obs As d GROUP BY d.disease_type;

source: Convex Hull of a MultiLinestring and a MultiPoint seen together with the MultiLinestring and MultiPoint
de: Konvexe Hülle eines MultiLineString und eines MultiPoint gemeinsam mit dem MultiLineString und dem MultiPoint
ja: マルチラインストリングとマルチポイントの凸包
ko_kr: 멀티라인스트링과 멀티포인트와 함께 표출된 멀티라인스트링 및 멀티포인트의 볼록 껍질

source: Converts a CIRCULARSTRING/CURVEPOLYGON to a LINESTRING/POLYGON
de: Wandelt einen CIRCULARSTRING/CURVEPOLYGON in ein LINESTRING/POLYGON um
ja: CIRCULARSTRING/CURVEPOLYGONをLINESTRING/POLYGONに変換します。
ko_kr: 원호 스트링(CIRCULARSTRING)/만곡 폴리곤(CURVEPOLYGON)을 라인스트링/폴리곤으로 변환합니다.

source: Converts a CIRCULAR STRING to regular LINESTRING or CURVEPOLYGON to POLYGON. Useful for outputting to devices that can't support CIRCULARSTRING geometry types
de: Konvertiert einen Kreisbogen/CircularString in einen normalen LineString oder ein CurvePolygon in ein Polygon. Nützlich zur Ausgabe an Geräten, die Kreisbögen nicht unterstützen.
ja: CIRCULARSTRINGを規則的なLINESTRINGに、または、CURVEPOLYGONをPOLYGONに変換します。CIRCULARSTRING型に対応していないデバイスへの出力に使います。

source: Converts a given geometry to a linear geometry. Each curved geometry or segment is converted into a linear approximation using the given `tolerance` and options (32 segments per quadrant and no options by default).
de: Wandelt eine gegebene Geometrie in eine lineare Geometrie um. Jede Kurvengeometrie und jedes Kurvensegment wird in linearer Näherung mit der gegebenen Toleranz und Optionen konvertiert ( Standardmäßig 32 Segmenten pro Viertelkreis und keine Optionen).
ja: 与えられたジオメトリを線型ジオメトリに変換します。それぞれの曲線ジオメトリまたは辺は、`tolerance` とオプションを使用して線形近似に変換します (デフォルトでは4分の1円ごとに32辺でオプションなしです)。

source: The 'tolerance_type' argument determines interpretation of the `tolerance` argument. It can take the following values:
de: Der Übergabewert 'tolerance_type' gibt den Toleranztyp an. Er kann die folgenden Werte annehmen:
ja: 'tolerance_type'引数によって`tolerance`引数の解釈が決定されます。

source: 0 (default): Tolerance is max segments per quadrant.
de: 0 (default): die Toleranz wird über die maximale Anzahl der Segmente pro Viertelkreis angegeben.
ja: 0 (デフォルト): toleranceは4分の1円の最大辺数です。

source: 1: Tolerance is max-deviation of line from curve, in source units.
de: 1: Die Toleranz wird als maximale Abweichung der Linie von der Kurve in der Einheit der Herkunftsdaten angegeben.
ja: 1: toleranceは曲線からラインまでの最大差です。単位は入力ジオメトリの単位です。

source: 2: Tolerance is max-angle, in radians, between generating radii.
de: 2: Die Toleranz entspricht dem maximalen Winkel zwischen zwei erzeugten Radien.
ja: 2: toleranceは生成される半径がなす角度のラジアン単位の最大値です。

source: The 'flags' argument is a bitfield. 0 by default. Supported bits are:
de: Der Parameter 'flags' ist ein Bitfeld mit dem Standardwert 0. Es werden folgende Bits unterstützt:
ja: 'flags'引数はビットフィールドです。デフォルトでは0です。次のビットに対応します。

source: 1: Symmetric (orientation idependent) output.
de: 1: Symmetrische (orientierungsunabhängige) Ausgabe.
ja: 1: 対称となる (方向独立)出力。

source: 2: Retain angle, avoids reducing angles (segment lengths) when producing symmetric output. Has no effect when Symmetric flag is off.
de: 2: Erhält den Winkel, vermeidet die Winkel (Segmentlängen) bei der symmetrischen Ausgabe zu reduzieren. Hat keine Auswirkung, wenn die Symmetrie-Flag nicht aktiviert ist.
ja: 2: 角度維持。対称出力を生成する時に角度 (辺長)減少を避けます。対称フラグがOFFの時は何の効果もありません。

source: Enhanced: 2.4.0 added support for max-deviation and max-angle tolerance, and for symmetric output.
de: Erweiterung: ab 2.4.0 kann die Toleranz über die 'maximale Abweichung' und den 'maximalen Winkel' angegeben werden. Die symmetrische Ausgabe wurde hinzugefügt.
ja: Enhanced: 2.4.0 最大距離差による許容範囲と最大角度による許容範囲に対応し、対称出力に対応しました。

source: SELECT ST_AsText(ST_CurveToLine(ST_GeomFromText('CIRCULARSTRING(220268 150415,220227 150505,220227 150406)'))); --Result -- LINESTRING(220268 150415,220269.95064912 150416.539364228,220271.823415575 150418.17258804,220273.613787707 150419.895736857, 220275.317452352 150421.704659462,220276.930305234 150423.594998003,220278.448460847 150425.562198489, 220279.868261823 150427.60152176,220281.186287736 150429.708054909,220282.399363347 150431.876723113, 220283.50456625 150434.10230186,220284.499233914 150436.379429536,220285.380970099 150438.702620341,220286.147650624 150441.066277505, 220286.797428488 150443.464706771,220287.328738321 150445.892130112,220287.740300149 150448.342699654, 220288.031122486 150450.810511759,220288.200504713 150453.289621251,220288.248038775 150455.77405574, 220288.173610157 150458.257830005,220287.977398166 150460.734960415,220287.659875492 150463.199479347, 220287.221807076 150465.64544956,220286.664248262 150468.066978495,220285.988542259 150470.458232479,220285.196316903 150472.81345077, 220284.289480732 150475.126959442,220283.270218395 150477.39318505,220282.140985384 150479.606668057, 220280.90450212 150481.762075989,220279.5637474 150483.85421628,220278.12195122 150485.87804878, 220276.582586992 150487.828697901,220274.949363179 150489.701464356,220273.226214362 150491.491836488, 220271.417291757 150493.195501133,220269.526953216 150494.808354014,220267.559752731 150496.326509628, 220265.520429459 150497.746310603,220263.41389631 150499.064336517,220261.245228106 150500.277412127, 220259.019649359 150501.38261503,220256.742521683 150502.377282695,220254.419330878 150503.259018879, 220252.055673714 150504.025699404,220249.657244448 150504.675477269,220247.229821107 150505.206787101, 220244.779251566 150505.61834893,220242.311439461 150505.909171266,220239.832329968 150506.078553494, 220237.347895479 150506.126087555,220234.864121215 150506.051658938,220232.386990804 150505.855446946, 220229.922471872 150505.537924272,220227.47650166 150505.099855856,220225.054972724 150504.542297043, 220222.663718741 150503.86659104,220220.308500449 150503.074365683, 220217.994991777 150502.167529512,220215.72876617 150501.148267175, 220213.515283163 150500.019034164,220211.35987523 150498.7825509, 220209.267734939 150497.441796181,220207.243902439 150496, 220205.293253319 150494.460635772,220203.420486864 150492.82741196,220201.630114732 150491.104263143, 220199.926450087 150489.295340538,220198.313597205 150487.405001997,220196.795441592 150485.437801511, 220195.375640616 150483.39847824,220194.057614703 150481.291945091,220192.844539092 150479.123276887,220191.739336189 150476.89769814, 220190.744668525 150474.620570464,220189.86293234 150472.297379659,220189.096251815 150469.933722495, 220188.446473951 150467.535293229,220187.915164118 150465.107869888,220187.50360229 150462.657300346, 220187.212779953 150460.189488241,220187.043397726 150457.710378749,220186.995863664 150455.22594426, 220187.070292282 150452.742169995,220187.266504273 150450.265039585,220187.584026947 150447.800520653, 220188.022095363 150445.35455044,220188.579654177 150442.933021505,220189.25536018 150440.541767521, 220190.047585536 150438.18654923,220190.954421707 150435.873040558,220191.973684044 150433.60681495, 220193.102917055 150431.393331943,220194.339400319 150429.237924011,220195.680155039 150427.14578372,220197.12195122 150425.12195122, 220198.661315447 150423.171302099,220200.29453926 150421.298535644,220202.017688077 150419.508163512,220203.826610682 150417.804498867, 220205.716949223 150416.191645986,220207.684149708 150414.673490372,220209.72347298 150413.253689397,220211.830006129 150411.935663483, 220213.998674333 150410.722587873,220216.22425308 150409.61738497,220218.501380756 150408.622717305,220220.824571561 150407.740981121, 220223.188228725 150406.974300596,220225.586657991 150406.324522731,220227 150406) --3d example SELECT ST_AsEWKT(ST_CurveToLine(ST_GeomFromEWKT('CIRCULARSTRING(220268 150415 1,220227 150505 2,220227 150406 3)'))); Output ------ LINESTRING(220268 150415 1,220269.95064912 150416.539364228 1.0181172856673, 220271.823415575 150418.17258804 1.03623457133459,220273.613787707 150419.895736857 1.05435185700189,....AD INFINITUM .... 220225.586657991 150406.324522731 1.32611114201132,220227 150406 3) --use only 2 segments to approximate quarter circle SELECT ST_AsText(ST_CurveToLine(ST_GeomFromText('CIRCULARSTRING(220268 150415,220227 150505,220227 150406)'),2)); st_astext ------------------------------ LINESTRING(220268 150415,220287.740300149 150448.342699654,220278.12195122 150485.87804878, 220244.779251566 150505.61834893,220207.243902439 150496,220187.50360229 150462.657300346, 220197.12195122 150425.12195122,220227 150406) -- Ensure approximated line is no further than 20 units away from -- original curve, and make the result direction-neutral SELECT ST_AsText(ST_CurveToLine( 'CIRCULARSTRING(0 0,100 -100,200 0)'::geometry, 20, -- Tolerance 1, -- Above is max distance between curve and line 1 -- Symmetric flag )); st_astext ------------------------------------------------------------------------------------------- LINESTRING(0 0,50 -86.6025403784438,150 -86.6025403784439,200 -1.1331077795296e-13,200 0)
de: SELECT ST_AsText(ST_CurveToLine(ST_GeomFromText('CIRCULARSTRING(220268 150415,220227 150505,220227 150406)'))); --Result -- LINESTRING(220268 150415,220269.95064912 150416.539364228,220271.823415575 150418.17258804,220273.613787707 150419.895736857, 220275.317452352 150421.704659462,220276.930305234 150423.594998003,220278.448460847 150425.562198489, 220279.868261823 150427.60152176,220281.186287736 150429.708054909,220282.399363347 150431.876723113, 220283.50456625 150434.10230186,220284.499233914 150436.379429536,220285.380970099 150438.702620341,220286.147650624 150441.066277505, 220286.797428488 150443.464706771,220287.328738321 150445.892130112,220287.740300149 150448.342699654, 220288.031122486 150450.810511759,220288.200504713 150453.289621251,220288.248038775 150455.77405574, 220288.173610157 150458.257830005,220287.977398166 150460.734960415,220287.659875492 150463.199479347, 220287.221807076 150465.64544956,220286.664248262 150468.066978495,220285.988542259 150470.458232479,220285.196316903 150472.81345077, 220284.289480732 150475.126959442,220283.270218395 150477.39318505,220282.140985384 150479.606668057, 220280.90450212 150481.762075989,220279.5637474 150483.85421628,220278.12195122 150485.87804878, 220276.582586992 150487.828697901,220274.949363179 150489.701464356,220273.226214362 150491.491836488, 220271.417291757 150493.195501133,220269.526953216 150494.808354014,220267.559752731 150496.326509628, 220265.520429459 150497.746310603,220263.41389631 150499.064336517,220261.245228106 150500.277412127, 220259.019649359 150501.38261503,220256.742521683 150502.377282695,220254.419330878 150503.259018879, 220252.055673714 150504.025699404,220249.657244448 150504.675477269,220247.229821107 150505.206787101, 220244.779251566 150505.61834893,220242.311439461 150505.909171266,220239.832329968 150506.078553494, 220237.347895479 150506.126087555,220234.864121215 150506.051658938,220232.386990804 150505.855446946, 220229.922471872 150505.537924272,220227.47650166 150505.099855856,220225.054972724 150504.542297043, 220222.663718741 150503.86659104,220220.308500449 150503.074365683, 220217.994991777 150502.167529512,220215.72876617 150501.148267175, 220213.515283163 150500.019034164,220211.35987523 150498.7825509, 220209.267734939 150497.441796181,220207.243902439 150496, 220205.293253319 150494.460635772,220203.420486864 150492.82741196,220201.630114732 150491.104263143, 220199.926450087 150489.295340538,220198.313597205 150487.405001997,220196.795441592 150485.437801511, 220195.375640616 150483.39847824,220194.057614703 150481.291945091,220192.844539092 150479.123276887,220191.739336189 150476.89769814, 220190.744668525 150474.620570464,220189.86293234 150472.297379659,220189.096251815 150469.933722495, 220188.446473951 150467.535293229,220187.915164118 150465.107869888,220187.50360229 150462.657300346, 220187.212779953 150460.189488241,220187.043397726 150457.710378749,220186.995863664 150455.22594426, 220187.070292282 150452.742169995,220187.266504273 150450.265039585,220187.584026947 150447.800520653, 220188.022095363 150445.35455044,220188.579654177 150442.933021505,220189.25536018 150440.541767521, 220190.047585536 150438.18654923,220190.954421707 150435.873040558,220191.973684044 150433.60681495, 220193.102917055 150431.393331943,220194.339400319 150429.237924011,220195.680155039 150427.14578372,220197.12195122 150425.12195122, 220198.661315447 150423.171302099,220200.29453926 150421.298535644,220202.017688077 150419.508163512,220203.826610682 150417.804498867, 220205.716949223 150416.191645986,220207.684149708 150414.673490372,220209.72347298 150413.253689397,220211.830006129 150411.935663483, 220213.998674333 150410.722587873,220216.22425308 150409.61738497,220218.501380756 150408.622717305,220220.824571561 150407.740981121, 220223.188228725 150406.974300596,220225.586657991 150406.324522731,220227 150406) --3D Beispiel SELECT ST_AsEWKT(ST_CurveToLine(ST_GeomFromEWKT('CIRCULARSTRING(220268 150415 1,220227 150505 2,220227 150406 3)'))); Output ------ LINESTRING(220268 150415 1,220269.95064912 150416.539364228 1.0181172856673, 220271.823415575 150418.17258804 1.03623457133459,220273.613787707 150419.895736857 1.05435185700189,....AD INFINITUM .... 220225.586657991 150406.324522731 1.32611114201132,220227 150406 3) --nur 2 Segmente zur Annäherung des Viertelkreises SELECT ST_AsText(ST_CurveToLine(ST_GeomFromText('CIRCULARSTRING(220268 150415,220227 150505,220227 150406)'),2)); st_astext ------------------------------ LINESTRING(220268 150415,220287.740300149 150448.342699654,220278.12195122 150485.87804878, 220244.779251566 150505.61834893,220207.243902439 150496,220187.50360229 150462.657300346, 220197.12195122 150425.12195122,220227 150406) -- Sicherstellen, dass die angenäherte Linie nicht weiter als 20 Einheiten -- von der ursprünglichen Kurve entfernt liegt, und das Ergebnis richtungsunabhängig machen SELECT ST_AsText(ST_CurveToLine( 'CIRCULARSTRING(0 0,100 -100,200 0)'::geometry, 20, -- Tolerance 1, -- oberhalb die maximale Entfernung zwischen Kurve und Linie 1 -- Symmetrie Flag )); st_astext ------------------------------------------------------------------------------------------- LINESTRING(0 0,50 -86.6025403784438,150 -86.6025403784439,200 -1.1331077795296e-13,200 0)
ja: SELECT ST_AsText(ST_CurveToLine(ST_GeomFromText('CIRCULARSTRING(220268 150415,220227 150505,220227 150406)'))); -- 結果 -- LINESTRING(220268 150415,220269.95064912 150416.539364228,220271.823415575 150418.17258804,220273.613787707 150419.895736857, 220275.317452352 150421.704659462,220276.930305234 150423.594998003,220278.448460847 150425.562198489, 220279.868261823 150427.60152176,220281.186287736 150429.708054909,220282.399363347 150431.876723113, 220283.50456625 150434.10230186,220284.499233914 150436.379429536,220285.380970099 150438.702620341,220286.147650624 150441.066277505, 220286.797428488 150443.464706771,220287.328738321 150445.892130112,220287.740300149 150448.342699654, 220288.031122486 150450.810511759,220288.200504713 150453.289621251,220288.248038775 150455.77405574, 220288.173610157 150458.257830005,220287.977398166 150460.734960415,220287.659875492 150463.199479347, 220287.221807076 150465.64544956,220286.664248262 150468.066978495,220285.988542259 150470.458232479,220285.196316903 150472.81345077, 220284.289480732 150475.126959442,220283.270218395 150477.39318505,220282.140985384 150479.606668057, 220280.90450212 150481.762075989,220279.5637474 150483.85421628,220278.12195122 150485.87804878, 220276.582586992 150487.828697901,220274.949363179 150489.701464356,220273.226214362 150491.491836488, 220271.417291757 150493.195501133,220269.526953216 150494.808354014,220267.559752731 150496.326509628, 220265.520429459 150497.746310603,220263.41389631 150499.064336517,220261.245228106 150500.277412127, 220259.019649359 150501.38261503,220256.742521683 150502.377282695,220254.419330878 150503.259018879, 220252.055673714 150504.025699404,220249.657244448 150504.675477269,220247.229821107 150505.206787101, 220244.779251566 150505.61834893,220242.311439461 150505.909171266,220239.832329968 150506.078553494, 220237.347895479 150506.126087555,220234.864121215 150506.051658938,220232.386990804 150505.855446946, 220229.922471872 150505.537924272,220227.47650166 150505.099855856,220225.054972724 150504.542297043, 220222.663718741 150503.86659104,220220.308500449 150503.074365683, 220217.994991777 150502.167529512,220215.72876617 150501.148267175, 220213.515283163 150500.019034164,220211.35987523 150498.7825509, 220209.267734939 150497.441796181,220207.243902439 150496, 220205.293253319 150494.460635772,220203.420486864 150492.82741196,220201.630114732 150491.104263143, 220199.926450087 150489.295340538,220198.313597205 150487.405001997,220196.795441592 150485.437801511, 220195.375640616 150483.39847824,220194.057614703 150481.291945091,220192.844539092 150479.123276887,220191.739336189 150476.89769814, 220190.744668525 150474.620570464,220189.86293234 150472.297379659,220189.096251815 150469.933722495, 220188.446473951 150467.535293229,220187.915164118 150465.107869888,220187.50360229 150462.657300346, 220187.212779953 150460.189488241,220187.043397726 150457.710378749,220186.995863664 150455.22594426, 220187.070292282 150452.742169995,220187.266504273 150450.265039585,220187.584026947 150447.800520653, 220188.022095363 150445.35455044,220188.579654177 150442.933021505,220189.25536018 150440.541767521, 220190.047585536 150438.18654923,220190.954421707 150435.873040558,220191.973684044 150433.60681495, 220193.102917055 150431.393331943,220194.339400319 150429.237924011,220195.680155039 150427.14578372,220197.12195122 150425.12195122, 220198.661315447 150423.171302099,220200.29453926 150421.298535644,220202.017688077 150419.508163512,220203.826610682 150417.804498867, 220205.716949223 150416.191645986,220207.684149708 150414.673490372,220209.72347298 150413.253689397,220211.830006129 150411.935663483, 220213.998674333 150410.722587873,220216.22425308 150409.61738497,220218.501380756 150408.622717305,220220.824571561 150407.740981121, 220223.188228725 150406.974300596,220225.586657991 150406.324522731,220227 150406) -- 3次元の例 SELECT ST_AsEWKT(ST_CurveToLine(ST_GeomFromEWKT('CIRCULARSTRING(220268 150415 1,220227 150505 2,220227 150406 3)'))); Output ------ LINESTRING(220268 150415 1,220269.95064912 150416.539364228 1.0181172856673, 220271.823415575 150418.17258804 1.03623457133459,220273.613787707 150419.895736857 1.05435185700189,....AD INFINITUM .... 220225.586657991 150406.324522731 1.32611114201132,220227 150406 3) -- 近似4分の1円を2辺だけとする例 SELECT ST_AsText(ST_CurveToLine(ST_GeomFromText('CIRCULARSTRING(220268 150415,220227 150505,220227 150406)'),2)); st_astext ------------------------------ LINESTRING(220268 150415,220287.740300149 150448.342699654,220278.12195122 150485.87804878, 220244.779251566 150505.61834893,220207.243902439 150496,220187.50360229 150462.657300346, 220197.12195122 150425.12195122,220227 150406) -- 近似線が入力曲線から20単位以上離れることがないようにし、 -- 方向中立にします SELECT ST_AsText(ST_CurveToLine( 'CIRCULARSTRING(0 0,100 -100,200 0)'::geometry, 20, -- 許容範囲値 1, -- 上の値は曲線と線分との最大距離 1 -- 対称性フラグ )); st_astext ------------------------------------------------------------------------------------------- LINESTRING(0 0,50 -86.6025403784438,150 -86.6025403784439,200 -1.1331077795296e-13,200 0)

source: Return a Delaunay triangulation around the given input points.
de: Gibt die Delaunay-Triangulierung für gegebene Punkte zurück.
ja: 与えられたポイントの周りのドロネー三角形を返します。
ko_kr: 주어진 입력 포인트들을 둘러싼 들로네 삼각망(Delaunay triangulation)을 반환합니다.
