Repository: postgis/postgis
Catalog: doc/po/*/reference_processing.xml.po
Languages: de, ja, ko_kr, zh_hans

source: Voronoi with tolerance of 30 units as MultiLineString
de: Voronoi als MultiLinestring mit einer Toleranz von 30 Einheiten
ja: 許容範囲を30単位とした、マルチラインストリングのボロノイ図

source: Availability: 2.0.0
de: Verfügbarkeit: 2.0.0
ko_kr: 2.0.0 버전부터 사용할 수 있습니다.
zh_hans: 可用性: 2.0.0

source: Availability: 1.2.2?
de: Verfügbarkeit: 1.2.2?
ko_kr: 1.2.2 버전(?)부터 사용할 수 있습니다.

source: Availability: 1.5.0
de: Verfügbarkeit: 1.5.0
ko_kr: 1.5.0 버전부터 사용할 수 있습니다.

source: Availability: 2.3.0
de: Verfügbarkeit: 2.3.0
ko_kr: 2.3.0 버전부터 사용할 수 있습니다.
zh_hans: 可用性：2.3.0

source: Availability - 2.3.0
de: Verfügbarkeit: 2.3.0
ko_kr: 2.3.0 버전부터 사용할 수 있습니다.
zh_hans: 可用性-2.3.0

source: Availability: 2.2.0
de: Verfügbarkeit: 2.2.0
ko_kr: 2.2.0 버전부터 사용할 수 있습니다.
zh_hans: 可用性：2.2.0

source: Availability: 1.2.2
de: Verfügbarkeit: 1.2.2
ko_kr: 1.2.2 버전부터 사용할 수 있습니다.
zh_hans: 可用性：1.2.2

source: , <xref linkend="ST_SimplifyPreserveTopology"/>, Topology <xref linkend="TP_ST_Simplify"/>
de: , <xref linkend="ST_SimplifyPreserveTopology"/>, Topologie <xref linkend="TP_ST_Simplify"/>
ko_kr: , <xref linkend="ST_SimplifyPreserveTopology"/>, 위상(topology) <xref linkend="TP_ST_Simplify"/>

source: Availability: 1.3.3
de: Verfügbarkeit: 1.3.3
ko_kr: 1.3.3 버전부터 사용할 수 있습니다.
zh_hans: 可用性：1.3.3

source: Points overlaid on top of Voronoi diagram
de: Punkte über dem Voronoi Diagramm
zh_hans: 覆盖在 Voronoi 图顶部的点

source: --A buffered point approximates a circle -- A buffered point forcing approximation of (see diagram) -- 2 points per circle is poly with 8 sides (see diagram) SELECT ST_NPoints(ST_Buffer(ST_GeomFromText('POINT(100 90)'), 50)) As promisingcircle_pcount, ST_NPoints(ST_Buffer(ST_GeomFromText('POINT(100 90)'), 50, 2)) As lamecircle_pcount; promisingcircle_pcount | lamecircle_pcount ------------------------+------------------- 33 | 9 --A lighter but lamer circle -- only 2 points per quarter circle is an octagon --Below is a 100 meter octagon -- Note coordinates are in NAD 83 long lat which we transform to Mass state plane meter and then buffer to get measurements in meters; SELECT ST_AsText(ST_Buffer( ST_Transform( ST_SetSRID(ST_MakePoint(-71.063526, 42.35785),4269), 26986) ,100,2)) As octagon; ---------------------- POLYGON((236057.59057465 900908.759918696,236028.301252769 900838.049240578,235 957.59057465 900808.759918696,235886.879896532 900838.049240578,235857.59057465 900908.759918696,235886.879896532 900979.470596815,235957.59057465 901008.759918 696,236028.301252769 900979.470596815,236057.59057465 900908.759918696))
ko_kr: -- 포인트에 버퍼를 적용해서 원에 가깝게 만듭니다. -- 원마다 포인트 2개를 강제해서 버퍼를 적용하면 -- 변 8개를 가진 폴리곤이 됩니다(다이어그램 참조) SELECT ST_NPoints(ST_Buffer(ST_GeomFromText('POINT(100 90)'), 50)) As promisingcircle_pcount, ST_NPoints(ST_Buffer(ST_GeomFromText('POINT(100 90)'), 50, 2)) As lamecircle_pcount; promisingcircle_pcount | lamecircle_pcount ------------------------+------------------- 33 | 9 -- 더 가볍지만 질이 낮은 원 -- 사분원마다 포인트 2개를 강제하면 팔각형이 됩니다. -- 아래는 100미터 팔각형입니다. -- NAD83 경위도 좌표를 매사추세츠 주 미터 단위 평면으로 변환한 다음 버퍼를 적용해서 미터 단위로 측정한다는 사실에 주의하십시오. SELECT ST_AsText(ST_Buffer( ST_Transform( ST_SetSRID(ST_MakePoint(-71.063526, 42.35785),4269), 26986) ,100,2)) As octagon; ---------------------- POLYGON((236057.59057465 900908.759918696,236028.301252769 900838.049240578,235 957.59057465 900808.759918696,235886.879896532 900838.049240578,235857.59057465 900908.759918696,235886.879896532 900979.470596815,235957.59057465 901008.759918 696,236028.301252769 900979.470596815,236057.59057465 900908.759918696))

source: Converst a CIRCULAR STRING to regular LINESTRING or CURVEPOLYGON to POLYGON. Useful for outputting to devices that can't support CIRCULARSTRING geometry types
ko_kr: 원호 스트링을 정규 라인스트링으로, 또는 만곡 폴리곤을 폴리곤으로 변환합니다. 원호 스트링 도형 유형을 지원하지 못 하는 장치로 출력하는 데 유용합니다.

source: Converts a given geometry to a linear geometry. Each curved geometry or segment is converted into a linear approximation using the default value of 32 segments per quarter circle
ko_kr: 주어진 도형을 선형(linear) 도형으로 변환합니다. 각 만곡 도형 또는 구간을 사분원(quarter circle) 당 32구간이라는 기본값을 통해 선형 근사치로 변환시킵니다.

source: SELECT ST_AsText(ST_CurveToLine(ST_GeomFromText('CIRCULARSTRING(220268 150415,220227 150505,220227 150406)'))); --Result -- LINESTRING(220268 150415,220269.95064912 150416.539364228,220271.823415575 150418.17258804,220273.613787707 150419.895736857, 220275.317452352 150421.704659462,220276.930305234 150423.594998003,220278.448460847 150425.562198489, 220279.868261823 150427.60152176,220281.186287736 150429.708054909,220282.399363347 150431.876723113, 220283.50456625 150434.10230186,220284.499233914 150436.379429536,220285.380970099 150438.702620341,220286.147650624 150441.066277505, 220286.797428488 150443.464706771,220287.328738321 150445.892130112,220287.740300149 150448.342699654, 220288.031122486 150450.810511759,220288.200504713 150453.289621251,220288.248038775 150455.77405574, 220288.173610157 150458.257830005,220287.977398166 150460.734960415,220287.659875492 150463.199479347, 220287.221807076 150465.64544956,220286.664248262 150468.066978495,220285.988542259 150470.458232479,220285.196316903 150472.81345077, 220284.289480732 150475.126959442,220283.270218395 150477.39318505,220282.140985384 150479.606668057, 220280.90450212 150481.762075989,220279.5637474 150483.85421628,220278.12195122 150485.87804878, 220276.582586992 150487.828697901,220274.949363179 150489.701464356,220273.226214362 150491.491836488, 220271.417291757 150493.195501133,220269.526953216 150494.808354014,220267.559752731 150496.326509628, 220265.520429459 150497.746310603,220263.41389631 150499.064336517,220261.245228106 150500.277412127, 220259.019649359 150501.38261503,220256.742521683 150502.377282695,220254.419330878 150503.259018879, 220252.055673714 150504.025699404,220249.657244448 150504.675477269,220247.229821107 150505.206787101, 220244.779251566 150505.61834893,220242.311439461 150505.909171266,220239.832329968 150506.078553494, 220237.347895479 150506.126087555,220234.864121215 150506.051658938,220232.386990804 150505.855446946, 220229.922471872 150505.537924272,220227.47650166 150505.099855856,220225.054972724 150504.542297043, 220222.663718741 150503.86659104,220220.308500449 150503.074365683, 220217.994991777 150502.167529512,220215.72876617 150501.148267175, 220213.515283163 150500.019034164,220211.35987523 150498.7825509, 220209.267734939 150497.441796181,220207.243902439 150496, 220205.293253319 150494.460635772,220203.420486864 150492.82741196,220201.630114732 150491.104263143, 220199.926450087 150489.295340538,220198.313597205 150487.405001997,220196.795441592 150485.437801511, 220195.375640616 150483.39847824,220194.057614703 150481.291945091,220192.844539092 150479.123276887,220191.739336189 150476.89769814, 220190.744668525 150474.620570464,220189.86293234 150472.297379659,220189.096251815 150469.933722495, 220188.446473951 150467.535293229,220187.915164118 150465.107869888,220187.50360229 150462.657300346, 220187.212779953 150460.189488241,220187.043397726 150457.710378749,220186.995863664 150455.22594426, 220187.070292282 150452.742169995,220187.266504273 150450.265039585,220187.584026947 150447.800520653, 220188.022095363 150445.35455044,220188.579654177 150442.933021505,220189.25536018 150440.541767521, 220190.047585536 150438.18654923,220190.954421707 150435.873040558,220191.973684044 150433.60681495, 220193.102917055 150431.393331943,220194.339400319 150429.237924011,220195.680155039 150427.14578372,220197.12195122 150425.12195122, 220198.661315447 150423.171302099,220200.29453926 150421.298535644,220202.017688077 150419.508163512,220203.826610682 150417.804498867, 220205.716949223 150416.191645986,220207.684149708 150414.673490372,220209.72347298 150413.253689397,220211.830006129 150411.935663483, 220213.998674333 150410.722587873,220216.22425308 150409.61738497,220218.501380756 150408.622717305,220220.824571561 150407.740981121, 220223.188228725 150406.974300596,220225.586657991 150406.324522731,220227 150406) --3d example SELECT ST_AsEWKT(ST_CurveToLine(ST_GeomFromEWKT('CIRCULARSTRING(220268 150415 1,220227 150505 2,220227 150406 3)'))); Output ------ LINESTRING(220268 150415 1,220269.95064912 150416.539364228 1.0181172856673, 220271.823415575 150418.17258804 1.03623457133459,220273.613787707 150419.895736857 1.05435185700189,....AD INFINITUM .... 220225.586657991 150406.324522731 1.32611114201132,220227 150406 3) --use only 2 segments to approximate quarter circle SELECT ST_AsText(ST_CurveToLine(ST_GeomFromText('CIRCULARSTRING(220268 150415,220227 150505,220227 150406)'),2)); st_astext ------------------------------ LINESTRING(220268 150415,220287.740300149 150448.342699654,220278.12195122 150485.87804878, 220244.779251566 150505.61834893,220207.243902439 150496,220187.50360229 150462.657300346, 220197.12195122 150425.12195122,220227 150406)
ko_kr: SELECT ST_AsText(ST_CurveToLine(ST_GeomFromText('CIRCULARSTRING(220268 150415,220227 150505,220227 150406)'))); -- 결과 -- LINESTRING(220268 150415,220269.95064912 150416.539364228,220271.823415575 150418.17258804,220273.613787707 150419.895736857, 220275.317452352 150421.704659462,220276.930305234 150423.594998003,220278.448460847 150425.562198489, 220279.868261823 150427.60152176,220281.186287736 150429.708054909,220282.399363347 150431.876723113, 220283.50456625 150434.10230186,220284.499233914 150436.379429536,220285.380970099 150438.702620341,220286.147650624 150441.066277505, 220286.797428488 150443.464706771,220287.328738321 150445.892130112,220287.740300149 150448.342699654, 220288.031122486 150450.810511759,220288.200504713 150453.289621251,220288.248038775 150455.77405574, 220288.173610157 150458.257830005,220287.977398166 150460.734960415,220287.659875492 150463.199479347, 220287.221807076 150465.64544956,220286.664248262 150468.066978495,220285.988542259 150470.458232479,220285.196316903 150472.81345077, 220284.289480732 150475.126959442,220283.270218395 150477.39318505,220282.140985384 150479.606668057, 220280.90450212 150481.762075989,220279.5637474 150483.85421628,220278.12195122 150485.87804878, 220276.582586992 150487.828697901,220274.949363179 150489.701464356,220273.226214362 150491.491836488, 220271.417291757 150493.195501133,220269.526953216 150494.808354014,220267.559752731 150496.326509628, 220265.520429459 150497.746310603,220263.41389631 150499.064336517,220261.245228106 150500.277412127, 220259.019649359 150501.38261503,220256.742521683 150502.377282695,220254.419330878 150503.259018879, 220252.055673714 150504.025699404,220249.657244448 150504.675477269,220247.229821107 150505.206787101, 220244.779251566 150505.61834893,220242.311439461 150505.909171266,220239.832329968 150506.078553494, 220237.347895479 150506.126087555,220234.864121215 150506.051658938,220232.386990804 150505.855446946, 220229.922471872 150505.537924272,220227.47650166 150505.099855856,220225.054972724 150504.542297043, 220222.663718741 150503.86659104,220220.308500449 150503.074365683, 220217.994991777 150502.167529512,220215.72876617 150501.148267175, 220213.515283163 150500.019034164,220211.35987523 150498.7825509, 220209.267734939 150497.441796181,220207.243902439 150496, 220205.293253319 150494.460635772,220203.420486864 150492.82741196,220201.630114732 150491.104263143, 220199.926450087 150489.295340538,220198.313597205 150487.405001997,220196.795441592 150485.437801511, 220195.375640616 150483.39847824,220194.057614703 150481.291945091,220192.844539092 150479.123276887,220191.739336189 150476.89769814, 220190.744668525 150474.620570464,220189.86293234 150472.297379659,220189.096251815 150469.933722495, 220188.446473951 150467.535293229,220187.915164118 150465.107869888,220187.50360229 150462.657300346, 220187.212779953 150460.189488241,220187.043397726 150457.710378749,220186.995863664 150455.22594426, 220187.070292282 150452.742169995,220187.266504273 150450.265039585,220187.584026947 150447.800520653, 220188.022095363 150445.35455044,220188.579654177 150442.933021505,220189.25536018 150440.541767521, 220190.047585536 150438.18654923,220190.954421707 150435.873040558,220191.973684044 150433.60681495, 220193.102917055 150431.393331943,220194.339400319 150429.237924011,220195.680155039 150427.14578372,220197.12195122 150425.12195122, 220198.661315447 150423.171302099,220200.29453926 150421.298535644,220202.017688077 150419.508163512,220203.826610682 150417.804498867, 220205.716949223 150416.191645986,220207.684149708 150414.673490372,220209.72347298 150413.253689397,220211.830006129 150411.935663483, 220213.998674333 150410.722587873,220216.22425308 150409.61738497,220218.501380756 150408.622717305,220220.824571561 150407.740981121, 220223.188228725 150406.974300596,220225.586657991 150406.324522731,220227 150406) -- 3차원 예시 SELECT ST_AsEWKT(ST_CurveToLine(ST_GeomFromEWKT('CIRCULARSTRING(220268 150415 1,220227 150505 2,220227 150406 3)'))); Output ------ LINESTRING(220268 150415 1,220269.95064912 150416.539364228 1.0181172856673, 220271.823415575 150418.17258804 1.03623457133459,220273.613787707 150419.895736857 1.05435185700189,....AD INFINITUM .... 220225.586657991 150406.324522731 1.32611114201132,220227 150406 3) -- 사분원의 근사치를 구하는 데 2구간만 사용 SELECT ST_AsText(ST_CurveToLine(ST_GeomFromText('CIRCULARSTRING(220268 150415,220227 150505,220227 150406)'),2)); st_astext ------------------------------ LINESTRING(220268 150415,220287.740300149 150448.342699654,220278.12195122 150485.87804878, 220244.779251566 150505.61834893,220207.243902439 150496,220187.50360229 150462.657300346, 220197.12195122 150425.12195122,220227 150406)

source: Converts plain LINESTRING/POLYGONS to CIRCULAR STRINGs and Curved Polygons. Note much fewer points are needed to describe the curved equivalent.
ko_kr: 평범한 라인스트링/폴리곤을 각각 원호 스트링/만곡 폴리곤으로 변환합니다. 상응하는 만곡 도형을 표현하는 데 필요한 포인트가 몇 개 안 된다는 점을 눈여겨 보십시오.

source: Examples: 2D
ko_kr: 예시: 2차원

source: SELECT ST_AsText(ST_LineToCurve(foo.the_geom)) As curvedastext,ST_AsText(foo.the_geom) As non_curvedastext FROM (SELECT ST_Buffer('POINT(1 3)'::geometry, 3) As the_geom) As foo; curvedatext non_curvedastext --------------------------------------------------------------------|----------------------------------------------------------------- CURVEPOLYGON(CIRCULARSTRING(4 3,3.12132034355964 0.878679656440359, | POLYGON((4 3,3.94235584120969 2.41472903395162,3.77163859753386 1.85194970290473, 1 0,-1.12132034355965 5.12132034355963,4 3)) | 3.49440883690764 1.33328930094119,3.12132034355964 0.878679656440359, | 2.66671069905881 0.505591163092366,2.14805029709527 0.228361402466141, | 1.58527096604839 0.0576441587903094,1 0, | 0.414729033951621 0.0576441587903077,-0.148050297095264 0.228361402466137, | -0.666710699058802 0.505591163092361,-1.12132034355964 0.878679656440353, | -1.49440883690763 1.33328930094119,-1.77163859753386 1.85194970290472 | --ETC-- ,3.94235584120969 3.58527096604839,4 3)) --3D example SELECT ST_AsEWKT(ST_LineToCurve(ST_GeomFromEWKT('LINESTRING(1 2 3, 3 4 8, 5 6 4, 7 8 4, 9 10 4)'))); st_asewkt ------------------------------------ CIRCULARSTRING(1 2 3,5 6 4,9 10 4)
ko_kr: SELECT ST_AsText(ST_LineToCurve(foo.the_geom)) As curvedastext,ST_AsText(foo.the_geom) As non_curvedastext FROM (SELECT ST_Buffer('POINT(1 3)'::geometry, 3) As the_geom) As foo; curvedatext non_curvedastext --------------------------------------------------------------------|----------------------------------------------------------------- CURVEPOLYGON(CIRCULARSTRING(4 3,3.12132034355964 0.878679656440359, | POLYGON((4 3,3.94235584120969 2.41472903395162,3.77163859753386 1.85194970290473, 1 0,-1.12132034355965 5.12132034355963,4 3)) | 3.49440883690764 1.33328930094119,3.12132034355964 0.878679656440359, | 2.66671069905881 0.505591163092366,2.14805029709527 0.228361402466141, | 1.58527096604839 0.0576441587903094,1 0, | 0.414729033951621 0.0576441587903077,-0.148050297095264 0.228361402466137, | -0.666710699058802 0.505591163092361,-1.12132034355964 0.878679656440353, | -1.49440883690763 1.33328930094119,-1.77163859753386 1.85194970290472 | --ETC-- ,3.94235584120969 3.58527096604839,4 3)) -- 3차원 예시 SELECT ST_AsEWKT(ST_LineToCurve(ST_GeomFromEWKT('LINESTRING(1 2 3, 3 4 8, 5 6 4, 7 8 4, 9 10 4)'))); st_asewkt ------------------------------------ CIRCULARSTRING(1 2 3,5 6 4,9 10 4)

source: , <xref linkend="ST_Simplify"/>, <xref linkend="ST_SimplifyPreserveTopology"/>, Topology <xref linkend="TP_ST_Simplify"/>
ko_kr: , <xref linkend="ST_Simplify"/>, <xref linkend="ST_SimplifyPreserveTopology"/>, 위상(topology) <xref linkend="TP_ST_Simplify"/>

source: These functions compute geometric constructions, or alter geometry size or shape.
zh_hans: 这些函数计算几何构造，或改变几何尺寸或形状。

source: Computes a geometry covering all points within a given distance from a geometry.
zh_hans: 计算覆盖距几何体给定距离内所有点的几何体。

source: Computes a POLYGON or MULTIPOLYGON that represents all points whose distance from a geometry/geography is less than or equal to a given distance. A negative distance shrinks the geometry rather than expanding it. A negative distance may shrink a polygon completely, in which case POLYGON EMPTY is returned. For points and lines negative distances always return empty results.
zh_hans: 计算表示与几何/地理距离小于或等于给定距离的所有点的 POLYGON 或 MULTIPOLYGON。 负距离会缩小几何图形而不是扩展它。 负距离可能会完全缩小多边形，在这种情况下返回 POLYGON EMPTY。 对于点和线，负距离始终返回空结果。

source: For geometry, the distance is specified in the units of the Spatial Reference System of the geometry. For geography, the distance is specified in meters.
zh_hans: 对于几何体，距离以几何体的空间参考系的单位指定。 对于地理，距离以米为单位指定。

source: The optional third parameter controls the buffer accuracy and style. The accuracy of circular arcs in the buffer is specified as the number of line segments used to approximate a quarter circle (default is 8). The buffer style can be specifed by providing a list of blank-separated key=value pairs as follows:
zh_hans: 可选的第三个参数控制缓冲区的精度和样式。 缓冲区中圆弧的精度指定为用于近似四分之一圆的线段数（默认值为 8）。 可以通过提供空白分隔的键=值对列表来指定缓冲区样式，如下所示：

source: 'quad_segs=#' : number of line segments used to approximate a quarter circle (default is 8).
zh_hans: 'quad_segs=#' ：用于近似四分之一圆的线段数（默认为 8）。

source: 'endcap=round|flat|square' : endcap style (defaults to "round"). 'butt' is accepted as a synonym for 'flat'.
zh_hans: 'endcap=round|flat|square' ：endcap 样式（默认为“round”）。 “butt”被认为是“flat”的同义词。

source: 'join=round|mitre|bevel' : join style (defaults to "round"). 'miter' is accepted as a synonym for 'mitre'.
zh_hans: 'join=round|mitre|bevel' ：连接样式（默认为“round”）。 “mitre”被认为是“mitre”的同义词。

source: 'mitre_limit=#.#' : mitre ratio limit (only affects mitered join style). 'miter_limit' is accepted as a synonym for 'mitre_limit'.
zh_hans: 'mitre_limit=#.#' ：斜接比率限制（仅影响斜接连接样式）。 “miter_limit”被接受为“mitre_limit”的同义词。

source: 'side=both|left|right' : 'left' or 'right' performs a single-sided buffer on the geometry, with the buffered side relative to the direction of the line. This is only applicable to LINESTRING geometry and does not affect POINT or POLYGON geometries. By default end caps are square.
zh_hans: 'side=both|left|right' ：'left' 或 'right' 在几何体上执行单边缓冲，缓冲边相对于线的方向。 这仅适用于 LINESTRING 几何图形，不影响 POINT 或 POLYGON 几何图形。 默认情况下，终止样式是方形的。

source: &geography_transform; It determines a planar spatial reference system that best fits the bounding box of the geography object (trying UTM, Lambert Azimuthal Equal Area (LAEA) North/South pole, and finally Mercator ). The buffer is computed in the planar space, and then transformed back to WGS84. This may not produce the desired behavior if the input object is much larger than a UTM zone or crosses the dateline
zh_hans: &geography_transform; 它确定最适合地理对象边界框的平面空间参考系统（尝试 UTM、兰伯特方位角等积 (LAEA) 北/南极，最后是墨卡托）。 缓冲区在平面空间中计算，然后转换回 WGS84。 如果输入对象远大于 UTM 区域或跨越日期变更线，这可能不会产生所需的行为

source: Buffer output is always a valid polygonal geometry. Buffer can handle invalid inputs, so buffering by distance 0 is sometimes used as a way of repairing invalid polygons. <xref linkend="ST_MakeValid"/> can also be used for this purpose.
zh_hans: 缓冲区输出始终是有效的多边形几何体。 缓冲区可以处理无效输入，因此距离 0 的缓冲有时被用作修复无效多边形的一种方法。 <xref linkend="ST_MakeValid"/>也可用于此目的。

source: Buffering is sometimes used to perform a within-distance search. For this use case it is more efficient to use <xref linkend="ST_DWithin"/>.
zh_hans: 缓冲有时用于执行近距离搜索。 对于此用例，使用<xref linkend="ST_DWithin"/>效率更高。

source: This function ignores the Z dimension. It always gives a 2D result even when used on a 3D geometry.
zh_hans: 此函数忽略 Z 维度。 即使在 3D 几何体上使用时，它也始终给出 2D 结果。

source: Enhanced: 2.5.0 - ST_Buffer geometry support was enhanced to allow for side buffering specification <code>side=both|left|right</code>.
zh_hans: 增强：2.5.0 - ST_Buffer的几何感知版本已得到增强，允许您指定要缓冲的一侧。<code>side=both|left|right</code>。

source: Availability: 1.5 - ST_Buffer was enhanced to support different endcaps and join types. These are useful for example to convert road linestrings into polygon roads with flat or square edges instead of rounded edges. Thin wrapper for geography was added.
zh_hans: 可用性：1.5 - ST_Buffer 已得到增强，以适应各种端接和接缝。 例如，您可能希望将道路线串转换为街道面，并希望将端点视为平面或正方形而不是圆。 添加了地理的薄包装器。

source: right-hand-winding, polygon boundary side=left
zh_hans: 顺时针方向，多边形边界向左

source: right-hand-winding, polygon boundary side=right
zh_hans: 顺时针方向，多边形边界向右

source: Creates a polygonal geometry formed by the linework of a geometry.
zh_hans: 创建由几何体的线条形成的多边形几何体。

source: Creates an areal geometry formed by the constituent linework of the input geometry. The input can be a LineString, MultiLineString, Polygon, MultiPolygon or a GeometryCollection. The result is a Polygon or MultiPolygon, depending on input. If the input linework does not form polygons, NULL is returned.
zh_hans: 创建由输入几何体的组成线条形成的面几何体。 输入可以是 LineString、MultiLineString、Polygon、MultiPolygon 或 GeometryCollection。 结果是多边形或多多边形，具体取决于输入。 如果输入线条未形成多边形，则返回 NULL。

source: Unlike <xref linkend="ST_MakePolygon"/>, this function accepts rings formed by multiple lines, and can form any number of polygons.
zh_hans: 与 <xref linkend="ST_MakePolygon"/> 不同，此函数接受由多条线形成的环，并且可以形成任意数量的多边形。

source: This function converts inner rings into holes. To turn inner rings into polygons as well, use <xref linkend="ST_Polygonize"/>.
zh_hans: 此功能将内环转换为孔。 要将内环也转换为多边形，请使用 <xref linkend="ST_Polygonize"/>。

source: Input linework must be correctly noded for this function to work properly. <xref linkend="ST_Node"/> can be used to node lines.
zh_hans: 输入线条必须正确，节点才能使此功能正常工作。<xref linkend="ST_Node"/>可用于节点线。

source: If the input linework crosses, this function will produce invalid polygons. <xref linkend="ST_MakeValid"/> can be used to ensure the output is valid.
zh_hans: 如果输入线条交叉，此函数将生成无效的多边形。<xref linkend="ST_MakeValid"/>可用于确保输出有效。

source: Availability: 1.1.0
zh_hans: 可用性：1.1.0

source: Input lines
zh_hans: 输入线

source: Area result
zh_hans: 生成的多边形

source: Create a donut from two circular polygons
zh_hans: 用两个圆形多边形创建一个环形

source: , <xref linkend="ST_MakePolygon"/>, <xref linkend="ST_MakeValid"/>, <xref linkend="ST_Node"/>, <xref linkend="ST_Polygonize"/>, <xref linkend="ST_BdPolyFromText"/>, <xref linkend="ST_BdMPolyFromText"/> (wrappers to this function with standard OGC interface)
zh_hans: , <xref linkend="ST_MakePolygon"/>, <xref linkend="ST_MakeValid"/>, <xref linkend="ST_Node"/>, <xref linkend="ST_Polygonize"/>, <xref linkend="ST_BdPolyFromText"/>, <xref linkend="ST_BdMPolyFromText"/> (使用标准 OGC 接口对该函数进行包装)

source: Returns the geometric center of a geometry.
zh_hans: 返回几何体的几何中心。
