Repository: postgis/postgis
Catalog: doc/po/*/reference_processing.xml.po
Languages: de, ja, ko_kr, zh_hans

source: Computes a point which is the geometric center of mass of a geometry. For [<varname>MULTI</varname>]<varname>POINT</varname>s, the centroid is the arithmetic mean of the input coordinates. For [<varname>MULTI</varname>]<varname>LINESTRING</varname>s, the centroid is computed using the weighted length of each line segment. For [<varname>MULTI</varname>]<varname>POLYGON</varname>s, the centroid is computed in terms of area. If an empty geometry is supplied, an empty <varname>GEOMETRYCOLLECTION</varname> is returned. If <varname>NULL</varname> is supplied, <varname>NULL</varname> is returned. If <varname>CIRCULARSTRING</varname> or <varname>COMPOUNDCURVE</varname> are supplied, they are converted to linestring with CurveToLine first, then same than for <varname>LINESTRING</varname>
zh_hans: 计算作为几何体的几何质心的点。 对于 [<varname>MULTI</varname>]<varname>POINT</varname>，质心是输入坐标的算术平均值。 对于 [<varname>MULTI</varname>]<varname>LINESTRING</varname>，质心是使用每条线段的加权长度计算的。 对于 [<varname>MULTI</varname>]<varname>POLYGON</varname>，质心是根据面积计算的。 如果提供了空几何图形，则返回空的<varname>GEOMETRYCOLLECTION</varname>。 如果提供 <varname>NULL</varname>，则返回 <varname>NULL</varname>。 如果提供了<varname>CIRCULARSTRING</varname>或<varname>COMPOUNDCURVE</varname>，它们首先使用CurveToLine转换为线串，然后与<varname>LINESTRING</varname>相同

source: For mixed-dimension input, the result is equal to the centroid of the component Geometries of highest dimension (since the lower-dimension geometries contribute zero "weight" to the centroid).
zh_hans: 对于混合维度输入，结果等于最高维度的组件几何图形的质心（因为较低维度的几何图形对质心的“权重”贡献为零）。

source: Note that for polygonal geometries the centroid does not necessarily lie in the interior of the polygon. For example, see the diagram below of the centroid of a C-shaped polygon. To construct a point guaranteed to lie in the interior of a polygon use <xref linkend="ST_PointOnSurface"/>.
zh_hans: 请注意，对于多边形几何形状，质心不一定位于多边形的内部。 例如，请参见下图 C 形多边形的质心。 要构造保证位于多边形内部的点，请使用 <xref linkend="ST_PointOnSurface"/>。

source: New in 2.3.0 : supports <varname>CIRCULARSTRING</varname> and <varname>COMPOUNDCURVE</varname> (using CurveToLine)
zh_hans: 2.3.0 中的新增功能：支持 <varname>CIRCULARSTRING</varname> 和 <varname>COMPOUNDCURVE</varname>（使用 CurveToLine）

source: Availability: 2.4.0 support for geography was introduced.
zh_hans: 可用性：2.4.0 引入了对地理的支持。

source: In the following illustrations the red dot is the centroid of the source geometry.
zh_hans: 在下图中，红点是源几何体的质心。

source: Centroid of a <varname>MULTIPOINT</varname>
zh_hans: <varname>MULTIPOINT</varname>的质心

source: Centroid of a <varname>LINESTRING</varname>
zh_hans: <varname>LINESTRING</varname>的质心

source: Centroid of a <varname>POLYGON</varname>
zh_hans: <varname>POLYGON</varname>的质心

source: Centroid of a <varname>GEOMETRYCOLLECTION</varname>
zh_hans: <varname>GEOMETRYCOLLECTION</varname>的质心

source: Returns a smoothed version of a geometry, using the Chaikin algorithm
zh_hans: 使用 Chaikin 算法返回几何图形的平滑版本

source: Smoothes a linear or polygonal geometry using <link xlink:href="http://www.idav.ucdavis.edu/education/CAGDNotes/Chaikins-Algorithm/Chaikins-Algorithm.html">Chaikin's algorithm</link>. The degree of smoothing is controlled by the <varname>nIterations</varname> parameter. On each iteration, each interior vertex is replaced by two vertices located at 1/4 of the length of the line segments before and after the vertex. A reasonable degree of smoothing is provided by 3 iterations; the maximum is limited to 5.
zh_hans: 使用 <link xlink:href="http://www.idav.ucdavis.edu/education/CAGDNotes/Chaikins-Algorithm/Chaikins-Algorithm.html">Chaikin 算法</link>平滑线性或多边形几何体。 平滑程度由<varname> nIterations </varname>参数控制。 在每次迭代中，每个内部顶点都被位于顶点前后线段长度 1/4 处的两个顶点替换。 3次迭代提供了合理的平滑度； 最大限制为 5。

source: If <varname>preserveEndPoints</varname> is true, the endpoints of Polygon rings are not smoothed. The endpoints of LineStrings are always preserved.
zh_hans: 如果<varname>preserveEndPoints</varname>为true，则多边形环的端点不会被平滑。 LineStrings 的端点始终被保留。

source: The number of vertices doubles with each iteration, so the result geometry may have many more points than the input. To reduce the number of points use a simplification function on the result (see <xref linkend="ST_Simplify"/>, <xref linkend="ST_SimplifyPreserveTopology"/> and <xref linkend="ST_SimplifyVW"/>).
zh_hans: 每次迭代顶点数量都会加倍，因此结果几何图形的点可能比输入多得多。 要减少点数，请对结果使用简化函数（请参阅 <xref linkend="ST_Simplify"/>、<xref linkend="ST_SimplifyPreserveTopology"/> 和 <xref linkend="ST_SimplifyVW"/>）。

source: The result has interpolated values for the Z and M dimenions when present.
zh_hans: 结果具有 Z 和 M 维度（如果存在）的插值。

source: Availability: 2.5.0
zh_hans: 可用性：2.5.0

source: Smoothing a triangle:
zh_hans: 平滑三角形：

source: Smoothing a Polygon using 1, 2 and 3 iterations:
zh_hans: 使用 1、2 和 3 次迭代平滑多边形：

source: Smoothing a LineString using 1, 2 and 3 iterations:
zh_hans: 使用 1、2 和 3 次迭代平滑 LineString：

source: Computes a possibly concave geometry that contains all input geometry vertices
zh_hans: 计算包含所有输入几何顶点的可能凹几何

source: A concave hull is a (usually) concave geometry which contains the input, and whose vertices are a subset of the input vertices. In the general case the concave hull is a Polygon. The concave hull of two or more collinear points is a two-point LineString. The concave hull of one or more identical points is a Point. The polygon will not contain holes unless the optional <varname>param_allow_holes</varname> argument is specified as true.
zh_hans: 凹壳是（通常）凹几何体，包含输入，其顶点是输入顶点的子集。 一般情况下，凹壳是多边形。 两个或多个共线点的凹包是两点线串。 一个或多个相同点的凹壳是一个点。 除非可选的<varname> param_allow_holes</varname> 参数指定为 true，否则多边形将不包含孔。

source: One can think of a concave hull as "shrink-wrapping" a set of points. This is different to the <link linkend="ST_ConvexHull">convex hull</link>, which is more like wrapping a rubber band around the points. A concave hull generally has a smaller area and represents a more natural boundary for the input points.
zh_hans: 凹壳可以被认为是“真空包装”的几何形状的集合。 它与<link linkend="ST_ConvexHull">凸壳</link>不同，凸壳类似于用橡皮筋将其封闭。 凹形的圆角通常面积较小，并且具有由输入点组成的自然边界。

source: The <varname>param_pctconvex</varname> controls the concaveness of the computed hull. A value of 1 produces the convex hull. Values between 1 and 0 produce hulls of increasing concaveness. A value of 0 produces a hull with maximum concaveness (but still a single polygon). Choosing a suitable value depends on the nature of the input data, but often values between 0.3 and 0.1 produce reasonable results.
zh_hans: <varname>param_pctconvex </varname>控制计算的外壳的凹度。 值为 1 会生成凸包。 1 到 0 之间的值会产生凹度逐渐增加的外壳。 值为 0 会产生具有最大凹度的外壳（但仍然是单个多边形）。 选择合适的值取决于输入数据的性质，但通常 0.3 到 0.1 之间的值会产生合理的结果。

source: Technically, the <varname>param_pctconvex</varname> determines a length as a fraction of the difference between the longest and shortest edges in the Delaunay Triangulation of the input points. Edges longer than this length are "eroded" from the triangulation. The triangles remaining form the concave hull.
zh_hans: 从技术上讲，<varname>param_pctconvex </varname>将长度确定为输入点的 Delaunay 三角剖分中最长边和最短边之间的差值的一部分。 长于该长度的边会被三角测量“侵蚀”。 剩下的三角形形成凹形外壳。

source: For point and linear inputs, the hull will enclose all the points of the inputs. For polygonal inputs, the hull will enclose all the points of the input <emphasis>and also</emphasis> all the areas covered by the input. If you want a point-wise hull of a polygonal input, convert it to points first using <xref linkend="ST_Points"/>.
zh_hans: 对于点和线性输入，外壳将包含输入的所有点。 对于多边形输入，外壳将包围输入的所有点<emphasis>以及</emphasis>输入覆盖的所有区域。 如果您想要多边形输入的逐点外壳，请首先使用<xref linkend="ST_Points"/>将其转换为点。

source: This is not an aggregate function. To compute the concave hull of a set of geometries use <xref linkend="ST_Collect"/> (e.g. <code>ST_ConcaveHull( ST_Collect( geom ), 0.80)</code>.
zh_hans: 这不是聚合函数。 要计算一组几何图形的凹壳，请使用 <xref linkend="ST_Collect"/>（例如 <code>ST_ConcaveHull( ST_Collect( geom ), 0.80）</code>。

source: Enhanced: 3.3.0, GEOS native implementation enabled for GEOS 3.11+
zh_hans: 增强：3.3.0，为 GEOS 3.11+ 启用 GEOS 本机实现

source: Concave Hull of a MultiPoint
zh_hans: 多点的凹壳

source: Concave Hull of a MultiPoint, allowing holes
zh_hans: 多点的凹面外壳，允许有孔

source: Comparing a concave hull of a Polygon to the concave hull of the constituent points. The hull respects the boundary of the polygon, whereas the points-based hull does not.
zh_hans: 将多边形的凹壳与组成点的凹壳进行比较。 外壳遵循多边形的边界，而基于点的外壳则不然。

source: Using with ST_Collect to compute the concave hull of a geometry set.
zh_hans: 与 ST_Collect 一起使用来计算几何图形集的凹壳。

source: Computes the convex hull of a geometry.
zh_hans: 计算几何体的凸包。

source: Computes the convex hull of a geometry. The convex hull is the smallest convex geometry that encloses all geometries in the input.
zh_hans: 计算几何图形的凸包。 凸包是包含所有输入几何的最小凸几何体。

source: One can think of the convex hull as the geometry obtained by wrapping an rubber band around a set of geometries. This is different from a <link linkend="ST_ConcaveHull">concave hull</link> which is analogous to "shrink-wrapping" the geometries. A convex hull is often used to determine an affected area based on a set of point observations.
zh_hans: 人们可以将凸包视为通过将橡皮筋缠绕在一组几何图形上而获得的几何图形。 这与<link linkend="ST_ConcaveHull">凹形外壳</link>不同，凹形外壳类似于“收缩包装”几何形状。 凸包通常用于根据一组点观测来确定受影响的区域。

source: In the general case the convex hull is a Polygon. The convex hull of two or more collinear points is a two-point LineString. The convex hull of one or more identical points is a Point.
zh_hans: 一般情况下，凸包是多边形。 两个或多个共线点的凸包是两点线串。 一个或多个相同点的凸包是一个点。

source: This is not an aggregate function. To compute the convex hull of a set of geometries, use <xref linkend="ST_Collect"/> to aggregate them into a geometry collection (e.g. <code>ST_ConvexHull(ST_Collect(geom))</code>.
zh_hans: 这不是聚合函数。 要计算一组几何图形的凸包，请使用<xref linkend="ST_Collect"/>将它们聚合到几何集合中（例如 <code>ST_ConvexHull(ST_Collect(geom))</code>。

source: Convex Hull of a MultiLinestring and a MultiPoint
zh_hans: 多线串和多点的凸包

source: Using with ST_Collect to compute the convex hulls of geometry sets.
zh_hans: 与 ST_Collect 一起使用来计算几何图形集的凸包。

source: Returns the Delaunay triangulation of the vertices of a geometry.
zh_hans: 返回几何体顶点的 Delaunay 三角剖分。

source: Computes the <link xlink:href="http://en.wikipedia.org/wiki/Delaunay_triangulation">Delaunay triangulation</link> of the vertices of the input geometry. The optional <varname>tolerance</varname> can be used to snap nearby input vertices together, which improves robustness in some situations. The result geometry is bounded by the convex hull of the input vertices. The result geometry representation is determined by the <varname>flags</varname> code:
zh_hans: 计算输入几何体顶点的 <link xlink:href="http://en.wikipedia.org/wiki/Delaunay_triangulation">Delaunay 三角剖分</link>。 可选的<varname>容差</varname>可用于将附近的输入顶点捕捉在一起，这在某些情况下提高了稳健性。 结果几何图形以输入顶点的凸包为边界。 结果几何表示由<varname>标志</varname>代码确定：

source: <code>0</code> - a GEOMETRYCOLLECTION of triangular POLYGONs (default)
zh_hans: <code>0</code> - 三角形 POLYGON 的 GEOMETRYCOLLECTION（默认）

source: <code>1</code> - a MULTILINESTRING of the edges of the triangulation
zh_hans: <code>1</code> - 三角测量边缘的多线

source: <code>2</code> - A TIN of the triangulation
zh_hans: <code>2</code> - 三角测量的 TIN

source: Availability: 2.1.0
zh_hans: 可用性：2.1.0

source: Example using vertices with Z values.
zh_hans: 使用具有 Z 值的顶点的示例。

source: Removes vertices based on their M value
zh_hans: 根据 M 值删除顶点

source: Filters out vertex points based on their M-value. Returns a geometry with only vertex points that have a M-value larger or equal to the min value and smaller or equal to the max value. If max-value argument is left out only min value is considered. If fourth argument is left out the m-value will not be in the resulting geometry. If resulting geometry have too few vertex points left for its geometry type an empty geometry will be returned. In a geometry collection geometries without enough points will just be left out silently.
zh_hans: 根据 M 值过滤掉顶点。 返回仅包含 M 值大于或等于最小值且小于或等于最大值的顶点的几何图形。 如果省略最大值参数，则仅考虑最小值。 如果省略第四个参数，则 m 值将不会出现在生成的几何图形中。 如果生成的几何图形为其几何类型留下的顶点太少，则将返回空几何图形。 在几何集合中，没有足够点的几何图形将被默默地排除。

source: This function is mainly intended to be used in conjunction with ST_SetEffectiveArea. ST_EffectiveArea sets the effective area of a vertex in its m-value. With ST_FilterByM it then is possible to get a simplified version of the geometry without any calculations, just by filtering
zh_hans: 该函数主要与 ST_SetEffectiveArea 结合使用。 ST_EffectiveArea 用其 m 值设置顶点的有效区域。 使用 ST_FilterByM，无需任何计算，只需过滤即可获得几何的简化版本

source: There is a difference in what ST_SimplifyVW returns when not enough points meet the criteria compared to ST_FilterByM. ST_SimplifyVW returns the geometry with enough points while ST_FilterByM returns an empty geometry
zh_hans: 与 ST_FilterByM 相比，当没有足够的点满足条件时，ST_SimplifyVW 返回的结果有所不同。 ST_SimplifyVW 返回具有足够点的几何图形，而 ST_FilterByM 返回空几何图形

source: Note that the returned geometry might be invalid
zh_hans: 请注意，返回的几何图形可能无效

source: This function returns all dimensions, including the Z and M values
zh_hans: 该函数返回所有维度，包括 Z 和 M 值

source: A linestring is filtered
zh_hans: 线串被过滤

source: Generates a multipoint of random points contained in a Polygon or MultiPolygon.
zh_hans: 生成一个包含在多边形（Polygon）或多重多边形（MultiPolygon）内的随机点的多点对象。

source: ST_GeneratePoints generates a multipoint consisting of a given number of pseudo-random points which lie within the input area. The optional <varname>seed</varname> is used to regenerate a deterministic sequence of points, and must be greater than zero.
zh_hans: ST_GeneratePoints 生成一个包含指定数量伪随机点的多点对象，这些点位于输入区域内。可选的 <varname>seed</varname> 用于重新生成一个确定性的点序列，必须大于零。

source: Enhanced: 3.0.0, added seed parameter
zh_hans: 增强：3.0.0，添加种子参数

source: Generated a multipoint consisting of 12 Points overlaid on top of original polygon using a random seed value 1996
zh_hans: 使用随机种子值 1996，在原始多边形上生成了一个包含 12 个点的多点对象

source: Given a table of polygons s, return 12 individual points per polygon. Results will be different each time you run.
zh_hans: 给定一个多边形表 s，返回每个多边形 12 个单独的点。每次运行结果都会不同。

source: Returns the geometric median of a MultiPoint.
zh_hans: 返回多点的几何中位数。

source: Computes the approximate geometric median of a MultiPoint geometry using the Weiszfeld algorithm. The geometric median is the point minimizing the sum of distances to the input points. It provides a centrality measure that is less sensitive to outlier points than the centroid (center of mass).
zh_hans: 使用 Weiszfeld 算法计算多点几何的近似几何中值。 几何中位数是最小化到输入点的距离总和的点。 它提供了一种中心性度量，与质心（质心）相比，它对异常点不太敏感。

source: The algorithm iterates until the distance change between successive iterations is less than the supplied <varname>tolerance</varname> parameter. If this condition has not been met after <varname>max_iterations</varname> iterations, the function produces an error and exits, unless <varname>fail_if_not_converged</varname> is set to <code>false</code> (the default).
zh_hans: 该算法进行迭代，直到连续迭代之间的距离变化小于提供的<varname>容差</varname>参数。 如果在<varname> max_iterations</varname> 次迭代后仍未满足此条件，则函数会产生错误并退出，除非<varname>fail_if_not_converged </varname>设置为<code> false</code>（默认值）。

source: If a <varname>tolerance</varname> argument is not provided, the tolerance value is calculated based on the extent of the input geometry.
zh_hans: 如果未提供<varname>容差</varname>参数，则根据输入几何图形的范围计算公差值。

source: If present, the input point M values are interpreted as their relative weights.
zh_hans: 如果存在，输入点 M 值将被解释为它们的相对权重。

source: Enhanced: 2.5.0 Added support for M as weight of points.
zh_hans: 增强：2.5.0 添加了对 M 作为点权重的支持。

source: Comparison of the geometric median (red) and centroid (turquoise) of a MultiPoint.
zh_hans: 多点的几何中值（红色）和质心（绿松石色）的比较。

source: Return the lines formed by sewing together a MultiLineString.
zh_hans: 返回通过将 MultiLineString 缝合在一起形成的线。

source: Returns a LineString or MultiLineString formed by joining together the line elements of a MultiLineString. Lines are joined at their endpoints at 2-way intersections. Lines are not joined across intersections of 3-way or greater degree.
zh_hans: 返回通过将 MultiLineString 的线元素连接在一起而形成的 LineString 或 MultiLineString。 线在 2 线交叉点处的端点处连接。 线不会在三向或更高阶次的交叉点上连接。

source: If <emphasis role="bold">directed</emphasis> is TRUE, then ST_LineMerge will not change point order within LineStrings, so lines with opposite directions will not be merged
zh_hans: 如果<emphasis role="bold">定向</emphasis>为 TRUE，则 ST_LineMerge 将不会更改 LineStrings 内的点顺序，因此方向相反的线不会被合并

source: Only use with MultiLineString/LineStrings. Other geometry types return an empty GeometryCollection
zh_hans: 仅与 MultiLineString/LineString 一起使用。 其他几何类型返回空的 GeometryCollection

source: Enhanced: 3.3.0 accept a directed parameter.
zh_hans: 增强：3.3.0 接受定向参数。

source: Requires GEOS &gt;= 3.11.0 to use the directed parameter.
zh_hans: 需要 GEOS &gt;= 3.11.0 才能使用定向参数。

source: This function strips the M dimension.
zh_hans: 此函数剥离 M 维度。

source: Merging lines with different orientation.
zh_hans: 合并不同方向的线。

source: Lines are not merged across intersections with degree &gt; 2.
zh_hans: 在交点的度数大于2时，线段不会合并。

source: If merging is not possible due to non-touching lines, the original MultiLineString is returned.
zh_hans: 如果由于不接触线而无法合并，则返回原始 MultiLineString。

source: Lines with opposite directions are not merged if directed = TRUE.
zh_hans: 如果directed = TRUE，则不合并具有相反方向的线。

source: Example showing Z-dimension handling.
zh_hans: 显示 处理Z 维度的示例。

source: Computes the largest circle contained within a geometry.
zh_hans: 计算几何体中包含的最大圆。

source: Finds the largest circle that is contained within a (multi)polygon, or which does not overlap any lines and points. Returns a record with fields:
zh_hans: 查找（多）多边形内包含的最大圆，或者不与任何线和点重叠的最大圆。 返回包含字段的记录：

source: <varname>center</varname> - center point of the circle
zh_hans: <varname>center</varname>-圆的中心点

source: <varname>nearest</varname> - a point on the geometry nearest to the center
zh_hans: <varname>nearest</varname>-几何上最接近中心的点

source: <varname>radius</varname> - radius of the circle
zh_hans: <varname>radius</varname>-圆的半径

source: For polygonal inputs, the circle is inscribed within the boundary rings, using the internal rings as boundaries. For linear and point inputs, the circle is inscribed within the convex hull of the input, using the input lines and points as further boundaries.
zh_hans: 对于多边形输入，圆内接于边界环内，使用内环作为边界。 对于线性和点输入，圆内切于输入的凸包内，使用输入线和点作为进一步的边界。

source: Availability: 3.1.0.
zh_hans: 可用性：3.1.0。

source: Requires GEOS &gt;= 3.9.0.
zh_hans: 需要GEOS &gt;= 3.9.0。

source: Maximum inscribed circle of a polygon. Center, nearest point, and radius are returned.
zh_hans: 多边形的最大内切圆。 返回中心、最近点和半径。

source: Maximum inscribed circle of a multi-linestring. Center, nearest point, and radius are returned.
zh_hans: 多线串的最大内切圆。 返回中心、最近点和半径。

source: Computes the largest circle not overlapping a geometry.
zh_hans: 计算不与几何图形重叠的最大圆。

source: Finds the largest circle which does not overlap a set of point and line obstacles. (Polygonal geometries may be included as obstacles, but only their boundary lines are used.) The center of the circle is constrained to lie inside a polygonal boundary, which by default is the convex hull of the input geometry. The circle center is the point in the interior of the boundary which has the farthest distance from the obstacles. The circle itself is provided by the center point and a nearest point lying on an obstacle detemining the circle radius.
zh_hans: 找到不与一组点和线障碍物重叠的最大圆。 （多边形几何图形可以作为障碍物包含在内，但仅使用它们的边界线。）圆的中心被限制位于多边形边界内，默认情况下，多边形边界是输入几何图形的凸包。 圆心是边界内部距离障碍物最远的点。 圆本身由中心点和位于确定圆半径的障碍物上的最近点提供。

source: The circle center is determined to a given accuracy specified by a distance tolerance, using an iterative algorithm. If the accuracy distance is not specified a reasonable default is used.
zh_hans: 使用迭代算法将圆心确定为由距离容差指定的给定精度。 如果未指定精度距离，则使用合理的默认值。

source: Returns a record with fields:
zh_hans: 返回包含字段的记录：

source: To find the largest empty circle in the interior of a polygon, see <xref linkend="ST_MaximumInscribedCircle"/>.
zh_hans: 要查找多边形内部最大的空圆，请参见<xref linkend="ST_MaximumInscribedCircle"/>。

source: Availability: 3.4.0.
zh_hans: 可用性：3.4.0。

source: Largest Empty Circle within a set of lines.
zh_hans: 一组线内最大的空圆。

source: Largest Empty Circle within a set of points, constrained to lie in a polygon. The constraint polygon boundary must be included as an obstacle, as well as specified as the constraint for the circle center.
zh_hans: 一组点内最大的空圆，约束位于多边形内。 约束多边形边界必须作为障碍物包含在内，并指定为圆心的约束。

source: <refpurpose>Returns the smallest circle polygon that contains a geometry.</refpurpose>
zh_hans: <refpurpose>返回包含几何图形的最小圆形多边形。</refpurpose>

source: <para>Returns the smallest circle polygon that contains a geometry.</para>
zh_hans: <para>返回包含几何图形的最小圆形多边形。</para>

source: The bounding circle is approximated by a polygon with a default of 48 segments per quarter circle. Because the polygon is an approximation of the minimum bounding circle, some points in the input geometry may not be contained within the polygon. The approximation can be improved by increasing the number of segments. For applications where an approximation is not suitable <xref linkend="ST_MinimumBoundingRadius"/> may be used.
zh_hans: 边界圆近似为多边形，默认情况下每四分之一圆有 48 个线段。 由于多边形是最小外接圆的近似值，因此输入几何中的某些点可能不包含在多边形内。 可以通过增加分段数量来改进近似值。 对于近似值不合适的应用，可以使用 <xref linkend="ST_MinimumBoundingRadius"/>。

source: Use with <xref linkend="ST_Collect"/> to get the minimum bounding circle of a set of geometries.
zh_hans: 与<xref linkend="ST_Collect"/> 一起使用以获得一组几何图形的最小边界圆。

source: To compute two points lying on the mimimum circle (the "maximum diameter") use <xref linkend="ST_LongestLine"/>.
zh_hans: 要计算位于最小圆（“最大直径”）上的两个点，请使用<xref linkend="ST_LongestLine"/>。

source: The ratio of the area of a polygon divided by the area of its Minimum Bounding Circle is referred to as the <emphasis>Reock compactness score</emphasis>.
zh_hans: 多边形的面积除以最小包含圆的面积之比称为<emphasis> REOCK 紧致度得分</emphasis>。

source: Availability: 1.4.0
zh_hans: 可用性：1.4.0

source: Returns the center point and radius of the smallest circle that contains a geometry.
zh_hans: 返回包含几何图形的最小圆的中心点和半径。

source: Computes the center point and radius of the smallest circle that contains a geometry. Returns a record with fields:
zh_hans: 计算包含几何图形的最小圆的中心点和半径。 返回包含字段的记录：

source: Returns a minimum-area rectangle containing a geometry.
zh_hans: 返回包含几何图形的最小面积矩形。

source: Returns the minimum-area rotated rectangle enclosing a geometry. Note that more than one such rectangle may exist. May return a Point or LineString in the case of degenerate inputs.
zh_hans: 返回包围几何体的最小面积旋转矩形。 请注意，可能存在多个这样的矩形。 在退化输入的情况下可能返回 Point 或 LineString。

source: Availability: 2.5.0.
zh_hans: 可用性：2.5.0。

source: Requires GEOS &gt;= 3.6.0.
zh_hans: 需要GEOS &gt;= 3.6.0。

source: Oriented envelope of a point and linestring.
zh_hans: 点和线串的最小外接矩形。

source: Returns an offset line at a given distance and side from an input line.
zh_hans: 返回距输入线给定距离和方向的偏移线。

source: Return an offset line at a given distance and side from an input line. All points of the returned geometries are not further than the given distance from the input geometry. Useful for computing parallel lines about a center line.
zh_hans: 返回距输入线给定距离和方向的偏移线。 返回几何图形的所有点与输入几何图形的距离不超过给定距离。 对于计算围绕中心线的平行线很有用。

source: For positive distance the offset is on the left side of the input line and retains the same direction. For a negative distance it is on the right side and in the opposite direction.
zh_hans: 对于正距离，偏移位于输入线的左侧并保持相同的方向。 对于负距离，它位于右侧且方向相反。

source: Note that output may be a MULTILINESTRING or EMPTY for some jigsaw-shaped input geometries.
zh_hans: 请注意，对于某些拼图形状的输入几何图形，输出可能是 MULTILINESTRING 或 EMPTY。

source: Availability: 2.0
zh_hans: 可用性：2.0

source: Enhanced: 2.5 - added support for GEOMETRYCOLLECTION and MULTILINESTRING
zh_hans: 增强：2.5 - 添加了对 GEOMETRYCOLLECTION 和 MULTILINESTRING 的支持

source: Computes a point guaranteed to lie in a polygon, or on a geometry.
zh_hans: 计算保证位于多边形或几何体上的点。
