Repository: postgis/postgis
Catalog: doc/po/*/reference_processing.xml.po
Languages: de, ja, ko_kr, zh_hans

source: Returns a <varname>POINT</varname> which is guaranteed to lie in the interior of a surface (POLYGON, MULTIPOLYGON, and CURVED POLYGON). In PostGIS this function also works on line and point geometries.
zh_hans: 返回保证位于曲面内部的<varname>点</varname>（POLYGON、MULTIPOLYGON 和 CURVED POLYGON）。 在 PostGIS 中，此函数也适用于线和点几何图形。

source: &sqlmm_compliant; SQL-MM 3: 8.1.5, 9.5.6. The specifications define ST_PointOnSurface for surface geometries only. PostGIS extends the function to support all common geometry types. Other databases (Oracle, DB2, ArcSDE) seem to support this function only for surfaces. SQL Server 2008 supports all common geometry types.
zh_hans: &sqlmm_compliant; SQL-MM 3：8.1.5、9.5.6。 该规范仅针对表面几何形状定义 ST_PointOnSurface。 PostGIS扩展了功能以支持所有常见的几何类型。 其他数据库（Oracle、DB2、ArcSDE）似乎仅支持曲面的此功能。 SQL Server 2008 支持所有常见的几何类型。

source: PointOnSurface of a <varname>MULTIPOINT</varname>
zh_hans: <varname>多点</varname>表面上的点

source: PointOnSurface of a <varname>LINESTRING</varname>
zh_hans: <varname>线串</varname>表面上的点

source: PointOnSurface of a <varname>POLYGON</varname>
zh_hans: <varname>面</varname>表面上的点

source: PointOnSurface of a <varname>GEOMETRYCOLLECTION</varname>
zh_hans: <varname>几何集合</varname>表面上的点

source: <emphasis role="bold">Example:</emphasis> The result of ST_PointOnSurface is guaranteed to lie within polygons, whereas the point computed by <xref linkend="ST_Centroid"/> may be outside.
zh_hans: <emphasis role="bold">示例：</emphasis>ST_PointOnSurface 的结果保证位于多边形内，而 <xref linkend="ST_Centroid"/>计算的点可能位于多边形外。

source: Red: point on surface; Green: centroid
zh_hans: 红色：表面上的点； 绿色：质心

source: Computes a collection of polygons formed from the linework of a set of geometries.
zh_hans: 计算由一组几何图形的线条形成的多边形集合。

source: Creates a GeometryCollection containing the polygons formed by the linework of a set of geometries. If the input linework does not form any polygons, an empty GeometryCollection is returned.
zh_hans: 创建一个 GeometryCollection，其中包含由一组几何图形的线条形成的多边形。 如果输入线条未形成任何多边形，则返回空的 GeometryCollection。

source: This function creates polygons covering all delimited areas. If the result is intended to form a valid polygonal geometry, use <xref linkend="ST_BuildArea"/> to prevent holes being filled.
zh_hans: 此函数创建覆盖所有分隔区域的多边形。 如果结果旨在形成有效的多边形几何体，请使用 <xref linkend="ST_BuildArea"/> 来防止填充孔。

source: The input linework must be correctly noded for this function to work properly. To ensure input is noded use <xref linkend="ST_Node"/> on the input geometry before polygonizing.
zh_hans: 输入线条必须正确节点才能使该功能正常工作。 为了确保输入已节点化，请在多边形化之前在输入几何体上使用 <xref linkend="ST_Node"/>。

source: GeometryCollections can be difficult to handle with external tools. Use <xref linkend="ST_Dump"/> to convert the polygonized result into separate polygons.
zh_hans: 使用外部工具可能很难处理几何集合。 使用<xref linkend="ST_Dump"/> 将多边形结果转换为单独的多边形。

source: Availability: 1.0.0RC1
zh_hans: 可用性： 1.0.0RC1

source: Polygonized result
zh_hans: 多边形化结果

source: Polygonizing a table of linestrings:
zh_hans: 多边形线串表：

source: Returns a valid geometry with points rounded to a grid tolerance.
zh_hans: 返回有效的几何图形，其点舍入到网格公差。

source: Returns a valid geometry with all points rounded to the provided grid tolerance, and features below the tolerance removed.
zh_hans: 返回有效的几何图形，其中所有点均舍入到提供的网格公差，并删除低于公差的要素。

source: Unlike <xref linkend="ST_SnapToGrid"/> the returned geometry will be valid, with no ring self-intersections or collapsed components.
zh_hans: 与<xref linkend="ST_SnapToGrid"/> 不同，返回的几何图形将是有效的，没有环自相交或折叠组件。

source: Precision reduction can be used to:
zh_hans: 精度降低可用于：

source: match coordinate precision to the data accuracy
zh_hans: 将坐标精度与数据精度相匹配

source: reduce the number of coordinates needed to represent a geometry
zh_hans: 减少表示几何图形所需的坐标数量

source: ensure valid geometry output to formats which use lower precision (e.g. text formats such as WKT, GeoJSON or KML when the number of output decimal places is limited).
zh_hans: 确保有效的几何输出为使用较低精度的格式（例如，当输出小数位数有限时，WKT、GeoJSON 或 KML 等文本格式）。

source: export valid geometry to systems which use lower or limited precision (e.g. SDE, Oracle tolerance value)
zh_hans: 将有效几何图形导出到使用较低或有限精度的系统（例如 SDE、Oracle 公差值）

source: Precision reduction can reduce number of vertices
zh_hans: 降低精度可以减少顶点数量

source: Precision reduction splits polygons if needed to ensure validity
zh_hans: 如果需要的话，精度降低会分割多边形以确保有效性

source: Returns a simplified version of a geometry, using the Douglas-Peucker algorithm.
zh_hans: 使用 Douglas-Peucker 算法返回几何的简化版本。

source: The "preserve collapsed" flag will retain objects that would otherwise be too small given the tolerance. For example, a 1m long line simplified with a 10m tolerance. If <varname>preserveCollapsed</varname> argument is specified as true, the line will not disappear. This flag is useful for rendering engines, to avoid having large numbers of very small objects disappear from a map leaving surprising gaps.
zh_hans: “保留折叠”标志将保留在给定容差的情况下太小的对象。 例如，将 1m 长的线简化为 10m 公差。 如果将<varname> preserveCollapsed </varname>参数指定为 true，则该线不会消失。 该标志对于渲染引擎很有用，可以避免大量非常小的对象从地图上消失，留下令人惊讶的间隙。

source: Returns a simplified and valid version of a geometry, using the Douglas-Peucker algorithm.
zh_hans: 使用 Douglas-Peucker 算法返回几何的简化且有效的版本。

source: Computes a simplifed topology-preserving outer or inner hull of a polygonal geometry.
zh_hans: 计算多边形几何的简化的保留拓扑的外部或内部外壳。

source: Computes a simplified topology-preserving outer or inner hull of a polygonal geometry. An outer hull completely covers the input geometry. An inner hull is completely covered by the input geometry. The result is a polygonal geometry formed by a subset of the input vertices. MultiPolygons and holes are handled and produce a result with the same structure as the input.
zh_hans: 计算多边形几何的简化的保留拓扑的外部或内部外壳。 外壳完全覆盖输入几何体。 内部外壳完全被输入几何体覆盖。 结果是由输入顶点的子集形成的多边形几何体。 处理多重多边形和孔并产生与输入结构相同的结果。

source: The reduction in vertex count is controlled by the <varname>vertex_fraction</varname> parameter, which is a number in the range 0 to 1. Lower values produce simpler results, with smaller vertex count and less concaveness. For both outer and inner hulls a vertex fraction of 1.0 produces the orginal geometry. For outer hulls a value of 0.0 produces the convex hull (for a single polygon); for inner hulls it produces a triangle.
zh_hans: 顶点数的减少由<varname> vertex_fraction </varname>参数控制，该参数是 0 到 1 范围内的数字。值越低，结果越简单，顶点数越少，凹度也越小。 对于外壳和内壳，顶点分数 1.0 生成原始几何形状。 对于外壳，值 0.0 生成凸包（对于单个多边形）； 对于内壳，它会生成一个三角形。

source: The simplification process operates by progressively removing concave corners that contain the least amount of area, until the vertex count target is reached. It prevents edges from crossing, so the result is always a valid polygonal geometry.
zh_hans: 简化过程通过逐步删除包含最少面积的凹角来进行，直到达到顶点数目标。 它可以防止边交叉，因此结果始终是有效的多边形几何体。

source: To get better results with geometries that contain relatively long line segments, it might be necessary to "segmentize" the input, as shown below.
zh_hans: 为了获得包含相对较长线段的几何图形的更好结果，可能需要“分段”输入，如下所示。

source: Availability: 3.3.0.
zh_hans: 可用性：3.3.0。

source: Requires GEOS &gt;= 3.11.0.
zh_hans: 需要GEOS &gt;= 3.11.0。

source: Outer hull of a Polygon
zh_hans: 多边形的外壳

source: Inner hull of a Polygon
zh_hans: 多边形的内壳

source: Outer hull simplification of a MultiPolygon, with segmentization
zh_hans: MultiPolygon 的外壳简化，具有分段功能

source: Returns a simplified version of a geometry, using the Visvalingam-Whyatt algorithm
zh_hans: 使用 Visvalingam-Whyatt 算法返回几何的简化版本

source: Sets the effective area for each vertex, using the Visvalingam-Whyatt algorithm.
zh_hans: 使用 Visvalingam-Whyatt 算法设置每个顶点的有效区域。

source: Computes the constrained Delaunay triangulation of polygons
zh_hans: 计算多边形的约束 Delaunay 三角剖分

source: Computes the constrained Delaunay triangulation of polygons. Holes and Multipolygons are supported.
zh_hans: 计算多边形的约束 Delaunay 三角剖分。 支持孔和多边形。

source: The "constrained Delaunay triangulation" of a polygon is a set of triangles formed from the vertices of the polygon, and covering it exactly, with the maximum total interior angle over all possible triangulations. It provides the "best quality" triangulation of the polygon.
zh_hans: 多边形的“约束 Delaunay 三角剖分”是由多边形的顶点形成的一组三角形，并精确地覆盖它，并且在所有可能的三角剖分上具有最大总内角。 它提供了多边形的“最佳质量”三角测量。

source: Triangulation of a square.
zh_hans: 正方形的三角剖分。

source: Triangulation of the letter P.
zh_hans: 字母 P 的三角剖分。

source: Polygon Triangulation
zh_hans: 多边形三角剖分

source: Returns the boundaries of the Voronoi diagram of the vertices of a geometry.
zh_hans: 返回几何体顶点的 Voronoi 图的边界。

source: Computes a two-dimensional <link xlink:href="https://en.wikipedia.org/wiki/Voronoi_diagram">Voronoi diagram</link> from the vertices of the supplied geometry and returns the boundaries between cells in the diagram as a MultiLineString. Returns null if input geometry is null. Returns an empty geometry collection if the input geometry contains only one vertex. Returns an empty geometry collection if the <varname>extend_to</varname> envelope has zero area.
zh_hans: 根据提供的几何图形的顶点计算二维<link xlink:href="https://en.wikipedia.org/wiki/Voronoi_diagram"> Voronoi 图</link>，并将图中单元格之间的边界作为 MultiLineString 返回。 如果输入几何图形为 null，则返回 null。 如果输入几何图形仅包含一个顶点，则返回一个空几何图形集合。 如果<varname>extend_to</varname>最小外接矩形的面积为零，则返回空几何集合。

source: <varname>tolerance</varname>: The distance within which vertices will be considered equivalent. Robustness of the algorithm can be improved by supplying a nonzero tolerance distance. (default = 0.0)
zh_hans: <varname>容差</varname>：顶点被视为相等的距离。 通过提供非零容差距离可以提高算法的稳健性。 （默认 = 0.0）

source: <varname>extend_to</varname>: If present, the diagram is extended to cover the envelope of the supplied geometry, unless smaller than the default envelope (default = NULL, default envelope is the bounding box of the input expanded by about 50%).
zh_hans: <varname>extend_to</varname>：如果存在，图表将扩展以覆盖所提供几何图形的最小外接矩形，除非小于默认最小外接矩形（默认 = NULL，默认最小外接矩形是输入扩展约 50% 的边界框）。

source: Voronoi diagram lines, with tolerance of 30 units
zh_hans: Voronoi 图线，容差为 30 个单位

source: Returns the cells of the Voronoi diagram of the vertices of a geometry.
zh_hans: 返回几何体顶点的 Voronoi 图的单元格。

source: Computes a two-dimensional <link xlink:href="https://en.wikipedia.org/wiki/Voronoi_diagram">Voronoi diagram</link> from the vertices of the supplied geometry. The result is a GEOMETRYCOLLECTION of POLYGONs that covers an envelope larger than the extent of the input vertices. Returns null if input geometry is null. Returns an empty geometry collection if the input geometry contains only one vertex. Returns an empty geometry collection if the <varname>extend_to</varname> envelope has zero area.
zh_hans: 根据提供的几何图形的顶点计算二维<link xlink:href="https://en.wikipedia.org/wiki/Voronoi_diagram"> Voronoi 图</link>。 结果是 POLYGON 的 GEOMETRYCOLLECTION，其覆盖的包络大于输入顶点的范围。 如果输入几何图形为 null，则返回 null。 如果输入几何图形仅包含一个顶点，则返回一个空几何图形集合。 如果<varname>extend_to</varname>最小外接矩形的面积为零，则返回空几何集合。

source: Voronoi diagram, with tolerance of 30 units
zh_hans: Voronoi 图，容差为 30 个单位
