Repository: postgis/postgis
Catalog: doc/po/*/reference_processing.xml.po
Languages: de, ja, ko_kr, zh_hans

source: Return a <ulink url="http://en.wikipedia.org/wiki/Delaunay_triangulation">Delaunay triangulation</ulink> around the vertices of the input geometry. Output is a COLLECTION of polygons (for flags=0) or a MULTILINESTRING (for flags=1) or TIN (for flags=2). The tolerance, if any, is used to snap input vertices togheter.
de: Gibt eine <ulink url="http://en.wikipedia.org/wiki/Delaunay_triangulation">Delaunay-Triangulierung</ulink> rund um die Knoten der Eingabegeometrie zurück. Die Ausgabe ist eine COLLECTION von Polygonen (flags=0), ein MultiLineString (flags=1) oder ein TIN (flags=2). Die Toleranz, sofern angegeben, wird zum Zusammenfangen von Knoten verwendet.
ja: 入力ジオメトリの頂点の周りの<ulink url="http://ja.wikipedia.org/wiki/%E3%83%89%E3%83%AD%E3%83%8D%E3%83%BC%E5%9B%B3">ドロネー三角形</ulink>を返します。出力はポリゴンのコレクション (flags=0の場合)、MULTILINESTRING (flags=1の場合)、TIN(flags=2の場合)のいずれかになります。いずれの場合も、入力の頂点を一緒にスナップするために許容誤差が使われます。
ko_kr: 입력 도형의 꼭짓점들을 둘러싼 <ulink url="http://en.wikipedia.org/wiki/Delaunay_triangulation">들로네 삼각망</ulink> 을 반환합니다. 폴리곤 집합(flags=0인 경우), 멀티라인스트링(flags=1인 경우), 또는 TIN(flags=2인 경우)을 출력합니다. 허용 오차가 있을 경우, 입력 꼭짓점들을 서로 스냅시키는 데 이용합니다.

source: Availability: 2.1.0 - requires GEOS &gt;= 3.4.0.
de: Verfügbarkeit: 2.1.0 - benötigt GEOS &gt;= 3.4.0.
ja: Availability: 2.1.0 - GEOS 3.4.0以上が必要です。
ko_kr: 2.1.0 버전부터 사용할 수 있습니다. GEOS 3.4.0 이상 버전이 필요합니다.

source: 2D Examples
de: 2D Beispiele
ja: 2次元の例
ko_kr: 2차원 예시

source: Original polygons
de: Ursprüngliche Polygone
ja: 元のポリゴン
ko_kr: 원본 폴리곤
zh_hans: 原始多边形

source: -- our original geometry -- ST_Union(ST_GeomFromText('POLYGON((175 150, 20 40, 50 60, 125 100, 175 150))'), ST_Buffer(ST_GeomFromText('POINT(110 170)'), 20) )
de: -- Unsere ursprüngliche Geometrie -- ST_Union(ST_GeomFromText('POLYGON((175 150, 20 40, 50 60, 125 100, 175 150))'), ST_Buffer(ST_GeomFromText('POINT(110 170)'), 20) )
ja: -- 元のジオメトリ -- ST_Union(ST_GeomFromText('POLYGON((175 150, 20 40, 50 60, 125 100, 175 150))'), ST_Buffer(ST_GeomFromText('POINT(110 170)'), 20) )
ko_kr: -- 원본 도형 -- ST_Union(ST_GeomFromText('POLYGON((175 150, 20 40, 50 60, 125 100, 175 150))'), ST_Buffer(ST_GeomFromText('POINT(110 170)'), 20) )

source: ST_DelaunayTriangles of 2 polygons: delaunay triangle polygons each triangle themed in different color
de: ST_DelaunayTriangles von 2 Polygonen: delaunay triangulierte Polygone, jedes der Dreiecke ist in einer eigenen Farbe dargestellt
ja: 二つのポリゴンのST_DelaunayTriangles: ポリゴンごとに異なる色をつけたドロネー三角形ポリゴン
ko_kr: 두 폴리곤의 ST_DelaunayTriangles: 각 삼각형이 서로 다른 색으로 칠해진 들로네 삼각형 폴리곤
zh_hans: 2 个多边形的 ST_DelaunayTriangles：delaunay 三角形多边形，每个三角形以不同颜色为主题

source: -- geometries overlaid multilinestring triangles SELECT ST_DelaunayTriangles( ST_Union(ST_GeomFromText('POLYGON((175 150, 20 40, 50 60, 125 100, 175 150))'), ST_Buffer(ST_GeomFromText('POINT(110 170)'), 20) )) As dtriag;
ja: -- マルチラインストリングによる三角形を載せたジオメトリ -- SELECT ST_DelaunayTriangles( ST_Union(ST_GeomFromText('POLYGON((175 150, 20 40, 50 60, 125 100, 175 150))'), ST_Buffer(ST_GeomFromText('POINT(110 170)'), 20) )) As dtriag;
ko_kr: -- 멀티라인스트링 삼각형과 중첩한 도형 SELECT ST_DelaunayTriangles( ST_Union(ST_GeomFromText('POLYGON((175 150, 20 40, 50 60, 125 100, 175 150))'), ST_Buffer(ST_GeomFromText('POINT(110 170)'), 20) )) As dtriag;

source: -- delaunay triangles as multilinestring
de: -- Delaunay-Dreiecke als MultiLinestring
ja: マルチラインストリングにしたドロネー三角形
ko_kr: -- 멀티라인스트링인 들로네 삼각형
zh_hans: -- delaunay 三角形作为多线串

source: -- delaunay triangles of 45 points as 55 triangle polygons
de: -- Delaunay Dreiecke von 45 Punkten als 55 Dreieckspolygone
ja: 45個のポイントから生成した55個のドロネー三角形
ko_kr: -- 삼각형 폴리곤 55개인 포인트 45개의 들로네 삼각형
zh_hans: -- 45 个点的 delaunay 三角形作为 55 个三角形多边形

source: -- this produces a table of 42 points that form an L shape SELECT (ST_DumpPoints(ST_GeomFromText( 'MULTIPOINT(14 14,34 14,54 14,74 14,94 14,114 14,134 14, 150 14,154 14,154 6,134 6,114 6,94 6,74 6,54 6,34 6, 14 6,10 6,8 6,7 7,6 8,6 10,6 30,6 50,6 70,6 90,6 110,6 130, 6 150,6 170,6 190,6 194,14 194,14 174,14 154,14 134,14 114, 14 94,14 74,14 54,14 34,14 14)'))).geom INTO TABLE l_shape; -- output as individual polygon triangles SELECT ST_AsText((ST_Dump(geom)).geom) As wkt FROM ( SELECT ST_DelaunayTriangles(ST_Collect(geom)) As geom FROM l_shape) As foo; ---wkt --- POLYGON((6 194,6 190,14 194,6 194)) POLYGON((14 194,6 190,14 174,14 194)) POLYGON((14 194,14 174,154 14,14 194)) POLYGON((154 14,14 174,14 154,154 14)) POLYGON((154 14,14 154,150 14,154 14)) POLYGON((154 14,150 14,154 6,154 14)) : :
de: -- erzeugt eine Tabelle mit 42 Punkten die eine L-Form bilden SELECT (ST_DumpPoints(ST_GeomFromText( 'MULTIPOINT(14 14,34 14,54 14,74 14,94 14,114 14,134 14, 150 14,154 14,154 6,134 6,114 6,94 6,74 6,54 6,34 6, 14 6,10 6,8 6,7 7,6 8,6 10,6 30,6 50,6 70,6 90,6 110,6 130, 6 150,6 170,6 190,6 194,14 194,14 174,14 154,14 134,14 114, 14 94,14 74,14 54,14 34,14 14)'))).geom INTO TABLE l_shape; -- Ausgabe als einzelne Dreieckspolygone SELECT ST_AsText((ST_Dump(geom)).geom) As wkt FROM ( SELECT ST_DelaunayTriangles(ST_Collect(geom)) As geom FROM l_shape) As foo; ---wkt --- POLYGON((6 194,6 190,14 194,6 194)) POLYGON((14 194,6 190,14 174,14 194)) POLYGON((14 194,14 174,154 14,14 194)) POLYGON((154 14,14 174,14 154,154 14)) POLYGON((154 14,14 154,150 14,154 14)) POLYGON((154 14,150 14,154 6,154 14)) : :
ja: -- L字型に42個のポイントを持つテーブルを生成 SELECT (ST_DumpPoints(ST_GeomFromText( 'MULTIPOINT(14 14,34 14,54 14,74 14,94 14,114 14,134 14, 150 14,154 14,154 6,134 6,114 6,94 6,74 6,54 6,34 6, 14 6,10 6,8 6,7 7,6 8,6 10,6 30,6 50,6 70,6 90,6 110,6 130, 6 150,6 170,6 190,6 194,14 194,14 174,14 154,14 134,14 114, 14 94,14 74,14 54,14 34,14 14)'))).geom INTO TABLE l_shape; -- 個別の三角形ポリゴンとして出力 SELECT ST_AsText((ST_Dump(geom)).geom) As wkt FROM ( SELECT ST_DelaunayTriangles(ST_Collect(geom)) As geom FROM l_shape) As foo; -- wkt -- POLYGON((6 194,6 190,14 194,6 194)) POLYGON((14 194,6 190,14 174,14 194)) POLYGON((14 194,14 174,154 14,14 194)) POLYGON((154 14,14 174,14 154,154 14)) POLYGON((154 14,14 154,150 14,154 14)) POLYGON((154 14,150 14,154 6,154 14)) : :
ko_kr: -- 이 쿼리는 L 형상을 이루고 있는 포인트 42개의 테이블을 생성합니다. SELECT (ST_DumpPoints(ST_GeomFromText( 'MULTIPOINT(14 14,34 14,54 14,74 14,94 14,114 14,134 14, 150 14,154 14,154 6,134 6,114 6,94 6,74 6,54 6,34 6, 14 6,10 6,8 6,7 7,6 8,6 10,6 30,6 50,6 70,6 90,6 110,6 130, 6 150,6 170,6 190,6 194,14 194,14 174,14 154,14 134,14 114, 14 94,14 74,14 54,14 34,14 14)'))).geom INTO TABLE l_shape; -- 개별 삼각형 폴리곤으로 출력 SELECT ST_AsText((ST_Dump(geom)).geom) As wkt FROM ( SELECT ST_DelaunayTriangles(ST_Collect(geom)) As geom FROM l_shape) As foo; -- WKT -- POLYGON((6 194,6 190,14 194,6 194)) POLYGON((14 194,6 190,14 174,14 194)) POLYGON((14 194,14 174,154 14,14 194)) POLYGON((154 14,14 174,14 154,154 14)) POLYGON((154 14,14 154,150 14,154 14)) POLYGON((154 14,150 14,154 6,154 14)) : :

source: 3D Examples
de: 3D Beispiele
ja: 3次元の例
ko_kr: 3차원 예시

source: -- 3D multipoint -- SELECT ST_AsText(ST_DelaunayTriangles(ST_GeomFromText( 'MULTIPOINT Z(14 14 10, 150 14 100,34 6 25, 20 10 150)'))) As wkt; -----wkt---- GEOMETRYCOLLECTION Z (POLYGON Z ((14 14 10,20 10 150,34 6 25,14 14 10)) ,POLYGON Z ((14 14 10,34 6 25,150 14 100,14 14 10)))
ja: -- 3次元マルチポイント -- SELECT ST_AsText(ST_DelaunayTriangles(ST_GeomFromText( 'MULTIPOINT Z(14 14 10, 150 14 100,34 6 25, 20 10 150)'))) As wkt; ----- WKT ---- GEOMETRYCOLLECTION Z (POLYGON Z ((14 14 10,20 10 150,34 6 25,14 14 10)) ,POLYGON Z ((14 14 10,34 6 25,150 14 100,14 14 10)))
ko_kr: -- 3D 멀티포인트 -- SELECT ST_AsText(ST_DelaunayTriangles(ST_GeomFromText( 'MULTIPOINT Z(14 14 10, 150 14 100,34 6 25, 20 10 150)'))) As wkt; -- WKT -- GEOMETRYCOLLECTION Z (POLYGON Z ((14 14 10,20 10 150,34 6 25,14 14 10)) ,POLYGON Z ((14 14 10,34 6 25,150 14 100,14 14 10)))

source: Returns a geometry that represents that part of geometry A that does not intersect with geometry B.
de: Gibt eine Geometrie zurück, die jenen Teil der Geometrie A abbildet, der sich nicht mit der Geometrie B überschneidet.
ja: ジオメトリBにインタセクトしないジオメトリAの部分を表現するジオメトリを返します。
ko_kr: 도형 A에서 도형 B와 교차하지 않는 부분을 표현하는 도형을 반환합니다.

source: Returns a geometry that represents that part of geometry A that does not intersect with geometry B. One can think of this as GeometryA - ST_Intersection(A,B). If A is completely contained in B then an empty geometry collection is returned.
de: Gibt eine Geometrie zurück, die jenen Teil der Geometrie A abbildet, der sich nicht mit der Geometrie B überschneidet. Man kann sich das als GeometryA - ST_Intersection(A,B) vorstellen. Wenn A zur Gänze in B enthalten ist wird eine leere GeometryCollection zurückgegeben.
ja: ジオメトリBにインタセクトしないジオメトリAの部分を表現するジオメトリを返します。これは、ジオメトリA - ST_Intersection(A,B)と見ることができます。Aが完全にBに含まれる場合に、空ジオメトリコレクションが返されます。
ko_kr: 도형 A에서 도형 B와 교차하지 않는 부분을 표현하는 도형을 반환합니다. 도형 A에서 ST_Intersection(A,B)를 빼고 남은 부분이라고 생각할 수 있습니다. 도형 A가 도형 B에 완전히 담겨 있을 경우 텅 빈 도형 집합을 반환합니다.

source: Note - order matters. B - A will always return a portion of B
de: Anmerkung: Die Reihenfolge spielt eine Rolle. B - A gibt immer einen Teil von B zurück
ja: 順序の問題に注意が必要です。B-Aでは常にBの部分が返ります。
ko_kr: 주의: 순서가 중요합니다. B에서 A를 빼면 언제나 B의 일부분을 반환할 것입니다.

source: Do not call with a GeometryCollection as an argument
de: Nicht mit einer GeometryCollection als Übergabewert aufrufen
ja: ジオメトリコレクションを引数として呼ばないでください。
ko_kr: 도형 집합을 인수로 호출하지 마십시오.

source: &Z_support; However it seems to only consider x y when doing the difference and tacks back on the Z-Index
de: &Z_support; Allerdings scheint nur x y bei der Berechnung der Differenz herangezogen und anschließend an den Z-Index zurückgeheftet zu werden
ja: &Z_support; ただし、差を取ってZインデクスを戻す時に、X Yのみ考慮に入れているように見えます。
ko_kr: &Z_support; 하지만 이 함수는 빼기 작업시 XY만 고려하고 작업후 Z-인덱스를 다시 붙이는 것으로 보입니다.

source: The original linestrings shown together.
de: Die ursprünglichen Linienzüge zusammen.
ja: 元のラインストリングと一緒に表示
ko_kr: 함께 표출된 원본 라인스트링들

source: The difference of the two linestrings
de: Die Differenz der beiden Linienzüge
ja: 二つのラインストリングの差
ko_kr: 두 라인스트링의 차(difference)

source: --Safe for 2d. This is same geometries as what is shown for st_symdifference SELECT ST_AsText( ST_Difference( ST_GeomFromText('LINESTRING(50 100, 50 200)'), ST_GeomFromText('LINESTRING(50 50, 50 150)') ) ); st_astext --------- LINESTRING(50 150,50 200)
de: --Sicher bei 2D. Dies sind dieselben Geometrien als bei st_symdifference angezeigt SELECT ST_AsText( ST_Difference( ST_GeomFromText('LINESTRING(50 100, 50 200)'), ST_GeomFromText('LINESTRING(50 50, 50 150)') ) ); st_astext --------- LINESTRING(50 150,50 200)
ja: -- 2次元では安全です。これは同じST_SymDifferenceで示したのと同じジオメトリです。 SELECT ST_AsText( ST_Difference( ST_GeomFromText('LINESTRING(50 100, 50 200)'), ST_GeomFromText('LINESTRING(50 50, 50 150)') ) ); st_astext --------- LINESTRING(50 150,50 200)
ko_kr: -- 2D 도형에 대해 안전합니다. ST_SymDifference 에서 보여주는 것과 동일한 도형입니다. SELECT ST_AsText( ST_Difference( ST_GeomFromText('LINESTRING(50 100, 50 200)'), ST_GeomFromText('LINESTRING(50 50, 50 150)') ) ); st_astext --------- LINESTRING(50 150,50 200)

source: --When used in 3d doesn't quite do the right thing SELECT ST_AsEWKT(ST_Difference(ST_GeomFromEWKT('MULTIPOINT(-118.58 38.38 5,-118.60 38.329 6,-118.614 38.281 7)'), ST_GeomFromEWKT('POINT(-118.614 38.281 5)'))); st_asewkt --------- MULTIPOINT(-118.6 38.329 6,-118.58 38.38 5)
de: --verhält sich bei 3D nicht richtig SELECT ST_AsEWKT(ST_Difference(ST_GeomFromEWKT('MULTIPOINT(-118.58 38.38 5,-118.60 38.329 6,-118.614 38.281 7)'), ST_GeomFromEWKT('POINT(-118.614 38.281 5)'))); st_asewkt --------- MULTIPOINT(-118.6 38.329 6,-118.58 38.38 5)
ja: -- 3次元では正しく動作しません SELECT ST_AsEWKT(ST_Difference(ST_GeomFromEWKT('MULTIPOINT(-118.58 38.38 5,-118.60 38.329 6,-118.614 38.281 7)'), ST_GeomFromEWKT('POINT(-118.614 38.281 5)'))); st_asewkt --------- MULTIPOINT(-118.6 38.329 6,-118.58 38.38 5)
ko_kr: -- 3차원 도형 입력시 제대로 동작하지 않습니다. SELECT ST_AsEWKT(ST_Difference(ST_GeomFromEWKT('MULTIPOINT(-118.58 38.38 5,-118.60 38.329 6,-118.614 38.281 7)'), ST_GeomFromEWKT('POINT(-118.614 38.281 5)'))); st_asewkt --------- MULTIPOINT(-118.6 38.329 6,-118.58 38.38 5)

source: Returns a set of geometry_dump (geom,path) rows, that make up a geometry g1.
de: Gibt einen Satz an geometry_dump (geom,path) Zeilen zurück, aus denen die Geometrie g1 zusammengesetzt ist.
ja: ジオメトリg1から作られたgeometry_dump(geom, path)行の集合を返します。
ko_kr: 도형 g1을 구성하고 있는 geometry_dump(도형, 경로) 행들의 집합을 반환합니다.

source: This is a set-returning function (SRF). It returns a set of geometry_dump rows, formed by a geometry (geom) and an array of integers (path). When the input geometry is a simple type (POINT,LINESTRING,POLYGON) a single record will be returned with an empty path array and the input geometry as geom. When the input geometry is a collection or multi it will return a record for each of the collection components, and the path will express the position of the component inside the collection.
de: Dies ist eine Funktion mit Ergebnismege (set-returning function, SRF). Sie gibt eine Menge an geometry_dump Zeilen zurück, welche aus einer Geometrie (geom) und einem Feld aus Ganzzahlen (path) gebildet werden. Wenn die Eingabegeometrie ein einfacher Typ (POINT,LINESTRING,POLYGON) ist, wird ein einzelner Datensatz, mit einem leeren path-Feld und der Eingabegeometrie als geom, zurückgegeben. Falls die Eingabegeometrie eine COLLECTION oder eine MULTI* ist, wird für jede Komponente der COLLECTION ein Datensatz ausgegeben, wobei der path die Lage der Komponente in der COLLECTION angibt.
ja: これは集合を返す関数 (SRF=set-returning function)です。ジオメトリ (<varname>geom</varname>)と整数配列 (<varname>path</varname>)で作られる<varname>geometry_dump</varname>行を返します。入力ジオメトリが単純型 (POINT,LINESTRING,POLYGON)の場合は、単一の行で返り、pathには空配列、geomには入力ジオメトリが入ります。入力ジオメトリがジオメトリコレクションまたはMULTI系の場合は、要素ごとの行で返り、pathはコレクション内の要素位置を表します。
ko_kr: 집합을 반환하는 함수(SRF; set-returning function)입니다. 이 함수는 도형(geom) 및 정수 배열(경로)로 이루어진 geometry_dump 행들의 집합을 반환합니다. 입력 도형이 단순 유형(포인트, 라인스트링, 폴리곤)일 경우 텅 빈 경로 배열과 geom으로 입력 도형을 가진 단일 레코드를 반환할 것입니다. 입력 도형이 도형 집합 또는 멀티 유형일 경우, 각 집합 구성 요소 및 집합 내에서 해당 요소의 위치를 표현하는 경로로 이루어진 레코드를 반환할 것입니다.

source: ST_Dump is useful for expanding geometries. It is the reverse of a GROUP BY in that it creates new rows. For example it can be use to expand MULTIPOLYGONS into POLYGONS.
de: ST_Dump ist nütlich beim Ausladen von Geometrien. Es ist das Gegenteil von GROUP BY, insofern als neue Zeilen erzeugt werden. Es kann zum Beispiel verwendet werden um MultiPolygone in Polygone überzuführen.
ja: ST_Dumpはジオメトリを展開するのに使えます。新しい行を作る点では、GROUP BYの逆です。たとえば、MULTIPOLYGONをPOLYGONに展開するために使われます。
ko_kr: ST_Dump는 도형들을 확장하는 데 유용합니다. 새 행들을 생성한다는 점에서 GROUP BY의 역함수라고 할 수 있습니다. 예를 들어 멀티폴리곤을 폴리곤으로 확장하는 데 이 함수를 쓸 수 있습니다.

source: Enhanced: 2.0.0 support for Polyhedral surfaces, Triangles and TIN was introduced.
de: Erweiterung: 2.0.0 Unterstützung für polyedrische Oberflächen, Dreiecke und TIN eingeführt.
ja: Enhanced: 2.0.0 多面体サーフェス対応、三角対応、TIN対応が導入されました。
ko_kr: 개선 사항: 2.0.0 버전부터 다면체 표면, 삼각형 및 TIN을 지원하기 시작했습니다.

source: Availability: PostGIS 1.0.0RC1. Requires PostgreSQL 7.3 or higher.
de: Verfügbarkeit: PostGIS 1.0.0RC1. Benötigt PostgreSQL 7.3 oder höher.
ja: Availability: PostGIS 1.0.0RC1 PostgreSQL 7.3以上が必要です。
ko_kr: PostGIS 1.0.0RC1 버전부터 사용할 수 있습니다. PostgreSQL 7.3 이상 버전이 필요합니다.

source: Prior to 1.3.4, this function crashes if used with geometries that contain CURVES. This is fixed in 1.3.4+
de: Vor 1.3.4 ist diese Funktion abgestürzt, wenn die Geometrien KURVEN/CURVES enthalten. Dies wurde mit 1.3.4+ behoben
ja: 1.3.4より前では、曲線を含むジオメトリで使用すると、この関数はクラッシュします。これは1.3.4以上で訂正されています。
ko_kr: 1.3.4 미만 버전에서 이 함수에 만곡 도형(curve)을 담고 있는 도형을 입력하면 충돌이 일어났습니다. 1.3.4 버전부터 이 버그가 해결됐습니다.

source: Standard Examples
de: Standardbeispiele
ja: 標準的な例
ko_kr: 표준 예시

source: SELECT sometable.field1, sometable.field1, (ST_Dump(sometable.the_geom)).geom AS the_geom FROM sometable; -- Break a compound curve into its constituent linestrings and circularstrings SELECT ST_AsEWKT(a.geom), ST_HasArc(a.geom) FROM ( SELECT (ST_Dump(p_geom)).geom AS geom FROM (SELECT ST_GeomFromEWKT('COMPOUNDCURVE(CIRCULARSTRING(0 0, 1 1, 1 0),(1 0, 0 1))') AS p_geom) AS b ) AS a; st_asewkt | st_hasarc -----------------------------+---------- CIRCULARSTRING(0 0,1 1,1 0) | t LINESTRING(1 0,0 1) | f (2 rows)
de: SELECT sometable.field1, sometable.field1, (ST_Dump(sometable.the_geom)).geom AS the_geom FROM sometable; -- Einen zusammengesetzten Bogen in seine Linienzüge und Kreisbögen aufbrechen SELECT ST_AsEWKT(a.geom), ST_HasArc(a.geom) FROM ( SELECT (ST_Dump(p_geom)).geom AS geom FROM (SELECT ST_GeomFromEWKT('COMPOUNDCURVE(CIRCULARSTRING(0 0, 1 1, 1 0),(1 0, 0 1))') AS p_geom) AS b ) AS a; st_asewkt | st_hasarc -----------------------------+---------- CIRCULARSTRING(0 0,1 1,1 0) | t LINESTRING(1 0,0 1) | f (2 rows)
ja: SELECT sometable.field1, sometable.field1, (ST_Dump(sometable.the_geom)).geom AS the_geom FROM sometable; -- COMPOUNDCURVEをLINESTRINGとCIRCULARSTRINGとに分けます SELECT ST_AsEWKT(a.geom), ST_HasArc(a.geom) FROM ( SELECT (ST_Dump(p_geom)).geom AS geom FROM (SELECT ST_GeomFromEWKT('COMPOUNDCURVE(CIRCULARSTRING(0 0, 1 1, 1 0),(1 0, 0 1))') AS p_geom) AS b ) AS a; st_asewkt | st_hasarc -----------------------------+---------- CIRCULARSTRING(0 0,1 1,1 0) | t LINESTRING(1 0,0 1) | f (2 rows)
ko_kr: SELECT sometable.field1, sometable.field1, (ST_Dump(sometable.the_geom)).geom AS the_geom FROM sometable; -- 복심곡선을 그 구성 요소인 라인스트링과 원호 스트링으로 분해합니다. SELECT ST_AsEWKT(a.geom), ST_HasArc(a.geom) FROM ( SELECT (ST_Dump(p_geom)).geom AS geom FROM (SELECT ST_GeomFromEWKT('COMPOUNDCURVE(CIRCULARSTRING(0 0, 1 1, 1 0),(1 0, 0 1))') AS p_geom) AS b ) AS a; st_asewkt | st_hasarc -----------------------------+---------- CIRCULARSTRING(0 0,1 1,1 0) | t LINESTRING(1 0,0 1) | f (2 rows)

source: Polyhedral Surfaces, TIN and Triangle Examples
de: Beispiele für polyedrische Oberflächen, TIN und Dreiecke
ja: 多面体サーフェス、TIN、三角形の例
ko_kr: 다면체 표면, TIN 및 삼각형 예시

source: -- Polyhedral surface example -- Break a Polyhedral surface into its faces SELECT (a.p_geom).path[1] As path, ST_AsEWKT((a.p_geom).geom) As geom_ewkt FROM (SELECT ST_Dump(ST_GeomFromEWKT('POLYHEDRALSURFACE( ((0 0 0, 0 0 1, 0 1 1, 0 1 0, 0 0 0)), ((0 0 0, 0 1 0, 1 1 0, 1 0 0, 0 0 0)), ((0 0 0, 1 0 0, 1 0 1, 0 0 1, 0 0 0)), ((1 1 0, 1 1 1, 1 0 1, 1 0 0, 1 1 0)), ((0 1 0, 0 1 1, 1 1 1, 1 1 0, 0 1 0)), ((0 0 1, 1 0 1, 1 1 1, 0 1 1, 0 0 1)) )') ) AS p_geom ) AS a; path | geom_ewkt ------+------------------------------------------ 1 | POLYGON((0 0 0,0 0 1,0 1 1,0 1 0,0 0 0)) 2 | POLYGON((0 0 0,0 1 0,1 1 0,1 0 0,0 0 0)) 3 | POLYGON((0 0 0,1 0 0,1 0 1,0 0 1,0 0 0)) 4 | POLYGON((1 1 0,1 1 1,1 0 1,1 0 0,1 1 0)) 5 | POLYGON((0 1 0,0 1 1,1 1 1,1 1 0,0 1 0)) 6 | POLYGON((0 0 1,1 0 1,1 1 1,0 1 1,0 0 1))
de: -- Beispiel für eine polyedrische Oberfläche -- Eine polyedrische Oberfläche in Einzelflächen zerlegen SELECT (a.p_geom).path[1] As path, ST_AsEWKT((a.p_geom).geom) As geom_ewkt FROM (SELECT ST_Dump(ST_GeomFromEWKT('POLYHEDRALSURFACE( ((0 0 0, 0 0 1, 0 1 1, 0 1 0, 0 0 0)), ((0 0 0, 0 1 0, 1 1 0, 1 0 0, 0 0 0)), ((0 0 0, 1 0 0, 1 0 1, 0 0 1, 0 0 0)), ((1 1 0, 1 1 1, 1 0 1, 1 0 0, 1 1 0)), ((0 1 0, 0 1 1, 1 1 1, 1 1 0, 0 1 0)), ((0 0 1, 1 0 1, 1 1 1, 0 1 1, 0 0 1)) )') ) AS p_geom ) AS a; path | geom_ewkt ------+------------------------------------------ 1 | POLYGON((0 0 0,0 0 1,0 1 1,0 1 0,0 0 0)) 2 | POLYGON((0 0 0,0 1 0,1 1 0,1 0 0,0 0 0)) 3 | POLYGON((0 0 0,1 0 0,1 0 1,0 0 1,0 0 0)) 4 | POLYGON((1 1 0,1 1 1,1 0 1,1 0 0,1 1 0)) 5 | POLYGON((0 1 0,0 1 1,1 1 1,1 1 0,0 1 0)) 6 | POLYGON((0 0 1,1 0 1,1 1 1,0 1 1,0 0 1))
ja: -- 多面体サーフェスの例 -- 多面体サーフェスを面に分解 SELECT (a.p_geom).path[1] As path, ST_AsEWKT((a.p_geom).geom) As geom_ewkt FROM (SELECT ST_Dump(ST_GeomFromEWKT('POLYHEDRALSURFACE( ((0 0 0, 0 0 1, 0 1 1, 0 1 0, 0 0 0)), ((0 0 0, 0 1 0, 1 1 0, 1 0 0, 0 0 0)), ((0 0 0, 1 0 0, 1 0 1, 0 0 1, 0 0 0)), ((1 1 0, 1 1 1, 1 0 1, 1 0 0, 1 1 0)), ((0 1 0, 0 1 1, 1 1 1, 1 1 0, 0 1 0)), ((0 0 1, 1 0 1, 1 1 1, 0 1 1, 0 0 1)) )') ) AS p_geom ) AS a; path | geom_ewkt ------+------------------------------------------ 1 | POLYGON((0 0 0,0 0 1,0 1 1,0 1 0,0 0 0)) 2 | POLYGON((0 0 0,0 1 0,1 1 0,1 0 0,0 0 0)) 3 | POLYGON((0 0 0,1 0 0,1 0 1,0 0 1,0 0 0)) 4 | POLYGON((1 1 0,1 1 1,1 0 1,1 0 0,1 1 0)) 5 | POLYGON((0 1 0,0 1 1,1 1 1,1 1 0,0 1 0)) 6 | POLYGON((0 0 1,1 0 1,1 1 1,0 1 1,0 0 1))
ko_kr: -- 다면체 표면 예시 -- 다면체 표면을 각 면으로 분해 SELECT (a.p_geom).path[1] As path, ST_AsEWKT((a.p_geom).geom) As geom_ewkt FROM (SELECT ST_Dump(ST_GeomFromEWKT('POLYHEDRALSURFACE( ((0 0 0, 0 0 1, 0 1 1, 0 1 0, 0 0 0)), ((0 0 0, 0 1 0, 1 1 0, 1 0 0, 0 0 0)), ((0 0 0, 1 0 0, 1 0 1, 0 0 1, 0 0 0)), ((1 1 0, 1 1 1, 1 0 1, 1 0 0, 1 1 0)), ((0 1 0, 0 1 1, 1 1 1, 1 1 0, 0 1 0)), ((0 0 1, 1 0 1, 1 1 1, 0 1 1, 0 0 1)) )') ) AS p_geom ) AS a; path | geom_ewkt ------+------------------------------------------ 1 | POLYGON((0 0 0,0 0 1,0 1 1,0 1 0,0 0 0)) 2 | POLYGON((0 0 0,0 1 0,1 1 0,1 0 0,0 0 0)) 3 | POLYGON((0 0 0,1 0 0,1 0 1,0 0 1,0 0 0)) 4 | POLYGON((1 1 0,1 1 1,1 0 1,1 0 0,1 1 0)) 5 | POLYGON((0 1 0,0 1 1,1 1 1,1 1 0,0 1 0)) 6 | POLYGON((0 0 1,1 0 1,1 1 1,0 1 1,0 0 1))

source: -- TIN -- SELECT (g.gdump).path, ST_AsEWKT((g.gdump).geom) as wkt FROM (SELECT ST_Dump( ST_GeomFromEWKT('TIN ((( 0 0 0, 0 0 1, 0 1 0, 0 0 0 )), (( 0 0 0, 0 1 0, 1 1 0, 0 0 0 )) )') ) AS gdump ) AS g; -- result -- path | wkt ------+------------------------------------- {1} | TRIANGLE((0 0 0,0 0 1,0 1 0,0 0 0)) {2} | TRIANGLE((0 0 0,0 1 0,1 1 0,0 0 0))
ja: -- TIN -- SELECT (g.gdump).path, ST_AsEWKT((g.gdump).geom) as wkt FROM (SELECT ST_Dump( ST_GeomFromEWKT('TIN ((( 0 0 0, 0 0 1, 0 1 0, 0 0 0 )), (( 0 0 0, 0 1 0, 1 1 0, 0 0 0 )) )') ) AS gdump ) AS g; -- 結果 -- path | wkt ------+------------------------------------- {1} | TRIANGLE((0 0 0,0 0 1,0 1 0,0 0 0)) {2} | TRIANGLE((0 0 0,0 1 0,1 1 0,0 0 0))
ko_kr: -- TIN -- SELECT (g.gdump).path, ST_AsEWKT((g.gdump).geom) as wkt FROM (SELECT ST_Dump( ST_GeomFromEWKT('TIN ((( 0 0 0, 0 0 1, 0 1 0, 0 0 0 )), (( 0 0 0, 0 1 0, 1 1 0, 0 0 0 )) )') ) AS gdump ) AS g; -- 결과 -- path | wkt ------+------------------------------------- {1} | TRIANGLE((0 0 0,0 0 1,0 1 0,0 0 0)) {2} | TRIANGLE((0 0 0,0 1 0,1 1 0,0 0 0))

source: Returns a set of geometry_dump (geom,path) rows of all points that make up a geometry.
de: Gibt eine Menge von geometry_dump (geom,path) Zeilen aller Punkte zurück, aus denen die Geometrie zusammengesetzt ist.
ja: ジオメトリを作る全ての点のgometry_dump(geom,path)行の集合を返します。
ko_kr: 도형을 구성하는 모든 포인트의 geometry_dump(도형, 경로) 행들의 집합을 반환합니다.

source: This set-returning function (SRF) returns a set of <varname>geometry_dump</varname> rows formed by a geometry (<varname>geom</varname>) and an array of integers (<varname>path</varname>).
de: Diese Funktion mit Ergebnismenge (set-returning function, SRF) gibt eine Menge an <varname>geometry_dump</varname> Zeilen zurück, die aus einer Geometrie (<varname>geom</varname>) und einem Feld aus Ganzzahlen (<varname>path</varname>) aufgebaut ist.
ja: この集合を返す関数 (SRF=set-returning function)は、ジオメトリ (<varname>geom</varname>)と整数配列 (<varname>path</varname>)で作られる<varname>geometry_dump</varname>行を返します。
ko_kr: 이 집합 반환 함수(SRF)는 도형(<varname>geom</varname>) 및 정수 배열(<varname>path</varname>)로 이루어진 <varname>geometry_dump</varname> 행들의 집합을 반환합니다.

source: The <parameter>geom</parameter> component of <varname>geometry_dump</varname> are all the <varname>POINT</varname>s that make up the supplied geometry
de: Die <parameter>geom</parameter> Komponente des <varname>geometry_dump</varname> besteht aus allen <varname>POINT</varname>s aus denen die eingegebene Geometrie besteht
ja: <varname>geometry_dump</varname>の<parameter>geom</parameter>要素は全て、与えられたジオメトリを作る<varname>POINT</varname>です。
ko_kr: <varname>geometry_dump</varname> 의 <parameter>geom</parameter> 구성 요소는 모두 입력 도형을 구성하는 <varname>POINT</varname> 들입니다.
