Repository: postgis/postgis
Catalog: doc/po/*/using_postgis_app.xml.po
Languages: de, es, ja

source: Using PostGIS Geometry: Building Applications
ja: PostGISを使う: アプリケーションを構築する

source: Using MapServer
de: Verwendung von MapServer
es: Usando Mapserver
ja: MapServerを使う

source: The Minnesota MapServer is an internet web-mapping server which conforms to the OpenGIS Web Mapping Server specification.
ja: Minnesota MapServerはOpenGIS Web Mapping Server仕様を満たすウェブマッピングサーバです。

source: The MapServer homepage is at <ulink url="http://mapserver.org">http://mapserver.org</ulink>.
de: Die MapServer Homepage finden Sie unter <ulink url="http://mapserver.org">http://mapserver.org</ulink>.
es: La página principal de MapServer está en <ulink url="http://mapserver.org">http://mapserver.org</ulink>.
ja: MapServerのウェブサイトは<ulink url="http://mapserver.org/">http://mapserver.org/</ulink>です。

source: The OpenGIS Web Map Specification is at <ulink url="http://www.opengeospatial.org/standards/wms">http://www.opengeospatial.org/standards/wms</ulink>.
ja: The OpenGIS Web Map Specificationは<ulink url="http://www.opengeospatial.org/standards/wms">http://www.opengeospatial.org/standards/wms</ulink>にあります。

source: Basic Usage
de: Grundlegende Handhabung
es: Uso Básico
ja: 基本的な使い方

source: To use PostGIS with MapServer, you will need to know about how to configure MapServer, which is beyond the scope of this documentation. This section will cover specific PostGIS issues and configuration details.
ja: MapServerでPostGISを使うには、MapServerのコンフィギュレーション方法についての知識が必要ですが、この文書の範囲外です。この節では、PostGIS特有の問題とコンフィギュレーション詳細について記載します。

source: To use PostGIS with MapServer, you will need:
de: Um PostGIS mit MapServer zu verwenden, benötigen Sie:
es: Para usar PostGIS con MapServer, necesitará:
ja: PostGISをMapServerで使うには、次のものが必要です。

source: Version 0.6 or newer of PostGIS.
de: Die PostGIS Version 0.6, oder höher.
es: La versión 0.6 o posterior de PostGIS.
ja: PostGIS 0.6以上

source: Version 3.5 or newer of MapServer.
de: Die MapServer Version 3.5, oder höher.
es: La versión 3.5 o posterior de MapServer.
ja: MapServer 3.5以上

source: MapServer accesses PostGIS/PostgreSQL data like any other PostgreSQL client -- using the <filename>libpq</filename> interface. This means that MapServer can be installed on any machine with network access to the PostGIS server, and use PostGIS as a source of data. The faster the connection between the systems, the better.
ja: MapServerは、他のクライアントのように、<filename>libpq</filename>インタフェースを使って、PostGIS/PostgreSQLデータにアクセスします。よってMapServerはPostGISサーバにアクセスするネットワークを持つ計算機にインストールでき、PostGISをデータソースとして使用することができます。システム間の接続は速いほど良いです。

source: Compile and install MapServer, with whatever options you desire, including the "--with-postgis" configuration option.
de: Es spielt keine Rolle, mit welchen Optionen Sie MapServer kompilieren, solange sie bei der Konfiguration die "--with-postgis"-Option angeben.
es: Compile e instale MapServer con las opciones que desee, incluyendo la opción de configuración "--with-postgis".
ja: "--with-postgis"と好きなconfigureオプションを付けてMpaServerのコンパイルとインストールを行います。

source: In your MapServer map file, add a PostGIS layer. For example:
de: Fügen Sie einen PostGIS Layer zu der MapServer *.map Datei hinzu. Zum Beispiel:
es: En el fichero de mapas de MapServer agregue una capa PostGIS. Por ejemplo:
ja: Mapserverのmapファイルの中に、PostGISレイヤを追加します。たとえば次のようになります。

source: In the example above, the PostGIS-specific directives are as follows:
de: Im oberen Beispiel werden folgende PostGIS-spezifische Anweisungen verwendet:
es: En el ejemplo de arriba, las directivas específicas de PostGIS son:
ja: 上の例におけるPostGIS特有のディれ句ティ部は次の通りです。

source: For PostGIS layers, this is always "postgis".
de: Für PostGIS Layer ist dies immer "postgis".
es: Para las capas PostGIS, es siempre "postgis".
ja: PostGISレイヤでは常に"postgis"とします。

source: The database connection is governed by the a 'connection string' which is a standard set of keys and values like this (with the default values in &lt;&gt;):
de: Die Datenbankverbindung wird durch einen "Connection String" bestimmt, welcher aus einer standardisierten Menge von Schlüsseln und Werten zusammengesetzt ist (Standardwerte zwischen &lt;&gt;):
es: La conexión a la base de datos se rige por una 'cadena de conexión' que se compone de un conjunto estándar de claves y valores como (con los valores por defecto en &lt;&gt;):
ja: データベース接続は「接続文字列」によって制御されます。接続文字列は、次に示すような標準的なキーと値からなります(&lt;&gt;内はデフォルト値)。

source: user=&lt;username&gt; password=&lt;password&gt; dbname=&lt;username&gt; hostname=&lt;server&gt; port=&lt;5432&gt;
ja: user=&lt;ユーザ名&gt; password=&lt;パスワード&gt; dbname=&lt;ユーザ名&gt; hostname=&lt;サーバ&gt; port=&lt;5432&gt;

source: An empty connection string is still valid, and any of the key/value pairs can be omitted. At a minimum you will generally supply the database name and username to connect with.
de: Ein leerer "Connection String" ist ebenfalls gültig, sodass jedes Key/Value Paar weggelassen werden kann. Üblicherweise wird man zumindest den Datenbanknamen und den Benutzernamen, mit dem man sich verbinden will, angeben.
es: Cualquier par clave/valor puede omitirse, incluso es válida una cadena de conexión vacía. Como mínimo generalmente se proporcionará el nombre de la base de datos y el del usuario con el que conectarse.
ja: 空の接続文字列も妥当とされますし、あらゆるキーと値のペアは省略できます。接続するためには一般的にはdbnameとusernameとが最少で与えるものとなります。

source: The form of this parameter is "&lt;geocolumn&gt; from &lt;tablename&gt; using srid=&lt;srid&gt; using unique &lt;primary key&gt;" where the column is the spatial column to be rendered to the map, the SRID is SRID used by the column and the primary key is the table primary key (or any other uniquely-valued column with an index).
de: Dieser Parameter hat die Form "&lt;geocolumn&gt; from &lt;tablename&gt; using srid=&lt;srid&gt; using unique &lt;primary key&gt;", wobei "geocolumn" dem räumlichen Attribut entspricht, mit dem die Bildsynthese/rendern durchgeführt werden soll. "srid" entspricht der SRID des räumlichen Attributs und "primary key" ist der Primärschlüssel der Tabelle (oder ein anderes eindeutiges Attribut mit einem Index).
es: Este parámetro toma la forma "&lt;geocolumn&gt; from &lt;tablename&gt; using srid=&lt;srid&gt; using unique &lt;primary key&gt;" donde 'geocolumn' es la columna espacial a representar en el mapa, el 'srid' es el identificador del sistema de referencia utilizado por dicha columna y la 'primary key' es la clave primaria de la tabla (o cualquier otra columna con valores únicos y un índice).
ja: このパラメータの形式は "&lt;カラム名&gt; from &lt;テーブル名&gt; using srid=&lt;SRID&gt; using unique &lt;主キー&gt;"となります。ここで、カラム名は地図に描画したい空間カラムを指し、SRIDはそのカラムで使われるSRIDで、主キーはそのテーブルの主キー (またはインデクスを伴う一意の値を持つカラム)です。

source: You can omit the "using srid" and "using unique" clauses and MapServer will automatically determine the correct values if possible, but at the cost of running a few extra queries on the server for each map draw.
de: Sie können sowohl "using srid" als auch "using unique" weglassen. Wenn möglich, bestimmt MapServer die korrekten Werte dann automatisch, allerdings zu den Kosten einiger zusätzlichen serverseitigen Abfragen, die bei jedem Kartenaufruf ausgeführt werden.
es: Se pueden omitir las cláusulas "using srid" y "using unique" y MapServer determinará automáticamente los valores correctos si ello es posible, pero al precio de ejecutar unas pocas consultas extra al servidor cada vez que se dibuje el mapa.
ja: "using srid"と"using unique"節は省略できます。MapServerは可能なら自動的に正しい値を判断しますが、地図を描画するサーバ上で余分なクエリを若干実行するコストがかかります。

source: Putting in a CLOSE_CONNECTION=DEFER if you have multiple layers reuses existing connections instead of closing them. This improves speed. Refer to for <ulink url="http://blog.cleverelephant.ca/2008/10/mapserverpostgis-performance-tips.html">MapServer PostGIS Performance Tips</ulink> for a more detailed explanation.
de: Wenn Sie mehrere Layer darstellen wollen, fügen Sie CLOSE_CONNECTION=DEFER ein, dadurch wird eine bestehende Verbindung wiederverwendet anstatt geschlossen. Dies erhöht die Geschwindigkeit. Unter <ulink url="http://blog.cleverelephant.ca/2008/10/mapserverpostgis-performance-tips.html">MapServer PostGIS Performance Tips</ulink> findet sich eine detailierte Erklärung.
es: Si tenemos múltiples capas, el poner CLOSE_CONNECTION=DEFER hace que se reutilicen conexiones existentes en vez de cerrarlas. Esto mejora la velocidad. Para una explicación más detallada se puede consultar <ulink url="http://blog.cleverelephant.ca/2008/10/mapserverpostgis-performance-tips.html">MapServer PostGIS Performance Tips</ulink>.
ja: 接続を閉じずに複数のレイヤで再利用する場合にCLOSE_CONNECTION=DEFERとします。速度が改善します。詳細な説明については<ulink url="http://blog.cleverelephant.ca/2008/10/mapserverpostgis-performance-tips.html">MapServer PostGIS Performance Tips</ulink>を参照して下さい。

source: The filter must be a valid SQL string corresponding to the logic normally following the "WHERE" keyword in a SQL query. So, for example, to render only roads with 6 or more lanes, use a filter of "num_lanes &gt;= 6".
de: Der Filter muss ein gültiger SQL-Text sein, welcher der Logik, die normalerweise dem "WHERE" Schlüsselwort in der SQL-Abfrage folgt, entspricht. Z.B.: um nur die Straßen mit 6 oder mehr Spuren zu rendern, können Sie den Filter "num_lanes &gt;= 6" verwenden.
es: El filtro debe ser una cadena SQL correcta que corresponda a lo que sigue habitualmente a la palabra clave "WHERE" en una consulta SQL. Así que, por ejemplo, para representar solamente carreteras con 6 o más carriles usaremos un filtro con "num_lanes &gt;= 6".
ja: フィルタは、妥当なSQL文字列でなければなりません。この文字列は、通常はSQLクエリにおける"WHERE"に続く論理式に対応します。たとえば、6レーン以上の道路だけを描画する場合には、"num_lanes &gt;= 6"というフィルタを使います。

source: In your spatial database, ensure you have spatial (GiST) indexes built for any the layers you will be drawing.
de: Stellen Sie bitte sicher, das für alle zu zeichnenden Layer, ein räumlicher Index (GIST) in der Geodatenbank angelegt ist.
es: Asegúrese de haber generado índices espaciales (GIST) en su base de datos espacial para cualquiera de las capas a ser dibujadas.
ja: 空間データベースにおいては、空間 (GiST)インデクスを、マップに描かれるレイヤ全てに構築していることを保証して下さい。

source: CREATE INDEX [indexname] ON [tablename] USING GIST ( [geometrycolumn] );
de: CREATE INDEX [indexname] ON [tabellenname] USING GIST ( [geometry_spalte] );
es: CREATE INDEX [nombreindice] ON [nombretabla] USING GIST ( [columnageometria] );
ja: CREATE INDEX [インデクス名] ON [テーブル名] USING GIST ( [ジオメトリカラム] );

source: If you will be querying your layers using MapServer you will also need to use the "using unique" clause in your DATA statement.
de: Wenn Sie Ihre Layer über MapServer abfragen wollen, benötigen Sie auch die "using unique" Klausel in Ihrer "DATA" Anweisung.
es: Si va a hacer consultas de las capas usando MapServer necesitará también usar la cláusula "using unique" en el enunciado DATA.
ja: MapServerを使用するレイヤのクエリを実行する場合には、"using unique"節もDATAステートメントに追加しなければなりません。

source: MapServer requires unique identifiers for each spatial record when doing queries, and the PostGIS module of MapServer uses the unique value you specify in order to provide these unique identifiers. Using the table primary key is the best practice.
de: MapServer benötigt für jeden räumlichen Datensatz, der abgefragt werden soll, eindeutige Identifikatoren. Das PostGIS Modul von MapServer benützt den von Ihnen festgelegten, eindeutigen Wert, um diese eindeutige Identifikatoren zur Verfügung zu stellen. Den Primärschlüssel zu verwenden gilt als Erfolgsrezept.
es: MapServer requiere identificadores únicos para cada registro espacial cuando realiza las consultas, y el módulo PostGIS de MapServer utiliza el valor único especificado para proporcionar esos identificadores únicos. La mejor práctica es el uso de la clave primaria.
ja: MapServerでは、クエリ実行の際には、それぞれの空間レコードを識別するための一意な識別子が必要です。MapServerのPostGISモジュールは、一意な識別子を提供するために、ユーザ指定の一意な値を使います。テーブルの主キーを使うのが最も良い方法です。

source: Frequently Asked Questions
de: Häufig gestellte Fragen
es: Preguntas frecuentes
ja: よくある質問

source: When I use an <varname>EXPRESSION</varname> in my map file, the condition never returns as true, even though I know the values exist in my table.
de: Wenn Ich <varname>EXPRESSION</varname> in meiner *.map Datei verwende, gibt die WHERE Bedingung niemals TRUE zurück, obwohl Ich weiß, dass sich die Werte in meiner Tabelle befinden.
es: Cuando uso una <varname>EXPRESSION</varname> en mi fichero de mapas, la condición nunca se devuelve como verdadera, aunque sé que los valores existen en mi tabla.
ja: <varname>EXPRESSION</varname>をマップファイルで使う時に、値がテーブルにあるのを確認しているのに条件がtrueになりません。

source: Unlike shape files, PostGIS field names have to be referenced in EXPRESSIONS using <emphasis>lower case</emphasis>.
de: Anders als bei Shapefiles müssen die PostGIS-Feldnamen in EXPRESSION mit <emphasis>Kleinbuchstaben</emphasis> eingetragen werden.
es: A diferencia de los ficheros 'shape' los nombres de campo en PostGIS tienen que estar referenciados en EXPRESSIONS utilizando <emphasis>minúsculas</emphasis>.
ja: EXPRESIONで使うフィールド名は、シェープファイルと違ってPostGISの場合<emphasis>小文字</emphasis>になります。

source: The FILTER I use for my Shape files is not working for my PostGIS table of the same data.
ja: シェープファイルで使っているFILTERが、同じデータを持つPostGISテーブルでは動作しません。

source: Unlike shape files, filters for PostGIS layers use SQL syntax (they are appended to the SQL statement the PostGIS connector generates for drawing layers in MapServer).
de: Anders als bei Shapefiles, nutzen die Filter bei PostGIS-Layern die SQL Syntax (sie werden an die SQL-Anweisung, die vom PostGIS Konnektor für die Darstellung der Layer im Mapserver erzeugt wird, angehängt).
es: A diferencia de los ficheros 'shape', los filtros de capas PostGIS usan la sintaxis SQL (se añaden a la instrucción SQL que el conector PostGIS genera para dibujar las capas en MapServer).
ja: シェープファイルと違い、PostGISレイヤのフィルタはSQL構文を使います (PostGISコネクタがMapServerでレイヤを描画するために生成するSQLステートメントに追加されます)。

source: My PostGIS layer draws much slower than my Shape file layer, is this normal?
ja: PostGISレイヤの描画がシェープファイルより遅くなりますが、これが普通なのでしょうか?

source: In general, the more features you are drawing into a given map, the more likely it is that PostGIS will be slower than Shape files. For maps with relatively few features (100s), PostGIS will often be faster. For maps with high feature density (1000s), PostGIS will always be slower.
ja: 一般的に、地図に描画されるフィーチャーが多くなると、PostGISはシェープファイルより遅くなります。比較的少ないフィーチャー (100件台)ではPostGISの方が早く、フィーチャー密度が高くなる (1000件台)と、PostGISの方が遅くなります。

source: If you are finding substantial draw performance problems, it is possible that you have not built a spatial index on your table.
de: Falls erhebliche Probleme mit der Zeichenperformance auftreten, haben Sie eventuell keinen räumlichen Index auf die Tabelle gelegt.
es: Si está experimentando sustanciales problemas de ejecución, es posible que no haya generado un índice espacial en su tabla.
ja: 重大な描画性能の問題があるようでしたら、テーブルにある空間インデクスを構築していないというのがありそうです。

source: My PostGIS layer draws fine, but queries are really slow. What is wrong?
de: Mein PostGIS Layer wird ausgezeichnet dargestellt, aber die Abfragen sind sehr langsam. Was läuft falsch?
es: Mi capa PostGIS se dibuja bien, pero las consultas son realmente lentas. ¿Cuál es el problema?
ja: PostGISレイヤはちゃんと描けましたが、クエリが本当に遅いです。何が問題なのですか?

source: For queries to be fast, you must have a unique key for your spatial table and you must have an index on that unique key.
de: Damit Abfragen schnell gehen, müssen Sie einen eindeutigen Schlüssel in Ihrer Tabelle haben und einen Index auf diesen eindeutigen Schlüssell legen.
es: Para que las consultas sean rápidas, debe tener una clave única para su tabla espacial y un índice sobre esa clave única.
ja: クエリを早くするには、空間テーブルに一意なキーを持たせ、そのキーにインデクスを持たせなければなりません。

source: You can specify what unique key for mapserver to use with the <varname>USING UNIQUE</varname> clause in your <varname>DATA</varname> line:
de: Sie können den von MapServer zu verwendenden eindeutigen Schlüssel mit der <varname>USING UNIQUE</varname> Klausel in Ihrer <varname>DATA</varname> Zeile angeben:
es: Puede especificar qué clave única debe usar MapServer con la cláusula <varname>USING UNIQUE</varname> en la línea <varname>DATA</varname>:
ja: <varname>DATA</varname>行の<varname>USING UNIQUE</varname>節で、MapServerで使用する一意なキーをどれにするか指定することができます。

source: Can I use "geography" columns (new in PostGIS 1.5) as a source for MapServer layers?
de: Kann Ich "Geography" Spalten (neu in PostGIS 1.5) als Quelle für MapServer Layer verwenden?
es: ¿Puedo utilizar las columnas "geography" (nuevas en PostGIS 1.5) como fuente para las capas de MapServer?
ja: ジオグラフィカラム (PostGIS 1.5で機能追加)をMapServerのレイヤのソースとして使用できますか?

source: Yes! MapServer understands geography columns as being the same as geometry columns, but always using an SRID of 4326. Just make sure to include a "using srid=4326" clause in your <varname>DATA</varname> statement. Everything else works exactly the same as with geometry.
de: Ja! Für MapServer sind "Geography" Attribute und "Geometry" Attriute dasselbe. Es kann allerdings nur die SRID 4325 verwendet werden. Stellen Sie bitte sicher, dass sich eine "using srid=4326" Klausel in Ihrer <varname>DATA</varname> Anweisung befindet. Alles andere funktioniert genau so wie bei "Geometry".
es: ¡Sí! MapServer acepta las columnas 'geography' como si fueran columnas 'geometry', pero si se usa el SRID número 4326. Asegúrese de incluir una cláusula "using srid=4326" en su instrucción <varname>DATA</varname> . Todo funciona igual que con 'geometry'.
ja: できます!MapServerはジオグラフィカラムをジオメトリカラムと同じに認識します。しかし、常にSRIDを4326とします。"using srid=4326"節を<varname>DATA</varname>ステートメントに入れて下さい。他の部分はジオメトリの場合と同じです。

source: Advanced Usage
de: Erweiterte Verwendung
es: Uso avanzado
ja: 踏み込んだ使用法

source: The <varname>USING</varname> pseudo-SQL clause is used to add some information to help mapserver understand the results of more complex queries. More specifically, when either a view or a subselect is used as the source table (the thing to the right of "FROM" in a <varname>DATA</varname> definition) it is more difficult for mapserver to automatically determine a unique identifier for each row and also the SRID for the table. The <varname>USING</varname> clause can provide mapserver with these two pieces of information as follows:
de: Die SQL-Pseudoklausel <varname>USING</varname> wird verwendet, um MapServer zusätzliche Information über komplexere Abfragen zukommen zu lassen. Genauer gesagt, wenn entweder ein View oder ein Subselect als Ursprungstabelle verwendet wird (der Ausdruck rechts von "FROM" bei einer <varname>DATA</varname> Definition) ist es für MapServer schwieriger einen eindeutigen Identifikator für jede Zeile und die SRID der Tabelle automatisch zu bestimmen. Die <varname>USING</varname>Klausel kann MapServer die Information über diese beiden Teile wie folgt zukommen lassen:
es: Se usa la cláusula pseudo-SQL <varname>USING</varname> para añadir alguna información que ayude a MapServer a comprender los resultados de consultas más complejas. Más específicamente, cuando se usa bien una vista o una subselección como la tabla origen (lo que está a la derecha de "FROM" en una definición <varname>DATA</varname>) es más difícil para MapServer determinar automáticamente un identificador único para cada fila y también el SRID para la tabla. La cláusula <varname>USING</varname> puede proporcionar a MapServer estas dos piezas de información de la siguiente manera:
ja: <varname>USING</varname>疑似SQL節を使ってMapServerがより複雑なクエリの結果を理解できるようにするための情報を追加します。より詳しく言うと、ビューまたは副問い合わせが元テーブル (<varname>DATA</varname>定義で"FROM"の右にあるもの)として使われる時、MapServerが自動的に一意な識別子がそれぞれの行にあるか、また、SRIDがテーブルにあるかを判別するのは困難です。<varname>USING</varname>節によって、MapServerがこれらの情報を得ることができます。例を次に挙げます。

source: MapServer requires a unique id for each row in order to identify the row when doing map queries. Normally it identifies the primary key from the system tables. However, views and subselects don't automatically have an known unique column. If you want to use MapServer's query functionality, you need to ensure your view or subselect includes a uniquely valued column, and declare it with <varname>USING UNIQUE</varname>. For example, you could explicitly select nee of the table's primary key values for this purpose, or any other column which is guaranteed to be unique for the result set.
de: MapServer benötigt eine eindeutige ID für jede Zeile um die Zeile bei Kartenabfragen identifizieren zu können. Normalerweise wird der Primärschlüssel aus den Systemtabellen ermittelt. Views und Subselects haben jedoch nicht automatisch eine bekannte eindeutige Spalte. Wenn Sie MapServer's Abfragefunktionalität nutzen wollen, müssen Sie sicherstellen, dass Ihr View oder Subselect eine mit eindeutigen Werten versehene Spalte enthält und diese mit <varname>USING UNIQUE</varname> gekennzeichnet ist. Zum Beispiel können Sie hierfür die Werte des Primärschlüssels verwenden, oder irgendeine andere Spalte bei der sichergestellt ist dass sie eindeutige Werte für die Ergebnismenge aufweist.
es: MapServer requiere un identificador único para poder identificar la fila cuando se hacen consultas al mapa. Normalmente identifica la clave primaria de las tablas del sistema. Sin embargo, vistas y subconsultas no tienen automáticamente una columna única conocida. Si quiere usar la funcionalidad de consultas de MapServer debe asegurarse de que la vista o subconsulta incluye una columna de valores únicos, y declararla con <varname>USING UNIQUE</varname>. Por ejemplo, podría seleccionar explícitamente valores de la clave primaria de la tabla para este propósito, o cualquier otra columna que garantice ser única para el conjunto de resultados.
ja: MapServerは、マップクエリを実行する際、行識別のために、それぞれの行に一意な識別子を求めます。通常ならシステムテーブルから主キーを識別しますが、ビューや副問い合わせでは、一意性のあるカラムを自動的に知ることができません。MapServerのクエリ機能を使いたいなら、一意性のあるカラムをビューまたは副問い合わせに追加する必要があり、<varname>USING UNIQUE</varname>宣言を付ける必要があります。たとえば、この目的のための主キー値のテーブルでのカラム名や、結果セットで一意性が保障されたカラムを明示的にSELECTに入れることができます。

source: "Querying a Map" is the action of clicking on a map to ask for information about the map features in that location. Don't confuse "map queries" with the SQL query in a <varname>DATA</varname> definition.
de: "eine Karte abfragen" ist jene Aktion, bei der man auf die Karte klickt und nach Information über Kartenfeatures an dieser Stelle fragt. Verwechseln Sie bitte nicht "Kartenabfragen" mit der SQL Abfrage in der <varname>DATA</varname> Definition.
es: "Consultar un mapa" es la acción de hacer click sobre un mapa para obtener información acerca de los elementos del mapa en esa posición. No confundir con "consultas al mapa" con la petición SQL en una definición <varname>DATA</varname>.
ja: 「マップクエリ」はマップ上でクリックして、その場所におけるフィーチャーに関する情報を問い合わせる動作です。「マップクエリ」と<varname>DATA</varname>定義におけるSQLクエリと混同しないで下さい。
