Repository: postgis/postgis
Catalog: doc/po/*/using_postgis_app.xml.po
Languages: de, es, ja

source: PostGIS needs to know which spatial referencing system is being used by the geometries in order to return the correct data back to MapServer. Normally it is possible to find this information in the "geometry_columns" table in the PostGIS database, however, this is not possible for tables which are created on the fly such as subselects and views. So the <varname>USING SRID=</varname> option allows the correct SRID to be specified in the <varname>DATA</varname> definition.
de: PostGIS muss wissen, welches Koordinatenreferenzsystem von der Geometrie verwendet wird, um korrekte Daten an MapServer zurückzugeben. Üblicherweise kann man diese Information in der Tabelle "geometry_columns" in der PostGIS Datenbank finden. Dies ist jedoch nicht möglich bei Tabellen die On-the-fly erzeugt wurden, wo wie bei Subselects oder Views. Hierfür erlaubt die Option <varname>USING SRID=</varname> die Festlegung der richtigen SRID in der <varname>DATA</varname> Definition.
es: PostGIS necesita saber qué sistema de referencia espacial están usando las geometrías para poder devolver los datos correctos a MapServer. Normalmente es posible encontrar esta información en la tabla 'geometry_columns' de la base de datos PostGIS, sin embargo esto no es posible con tablas que se crean al vuelo tal como subconsultas y vistas. Así que la opción <varname>USING SRID=</varname> permite indicar el SRID correcto en la definición <varname>DATA</varname>.
ja: PostGISは、MapServerに正しいデータを返すために、ジオメトリがどの空間参照系を使っているかを知る必要があります。通常は、この情報はPostGISデータベースの"geometry_columns"テーブルから得ることができます。しかし、副問い合わせやビューのような一時テーブルでは、この方法は不可能です。そこで、 <varname>USING SRID=</varname>オプションを使って、正しいSRIDが<varname>DATA</varname>定義で使われるように指定します。

source: Examples
de: Beispiele
es: Ejemplos
ja: 例

source: Lets start with a simple example and work our way up. Consider the following MapServer layer definition:
de: Beginnen wir mit einem einfachen Beispiel und arbeiten uns dann langsam vor. Betrachten Sie die nachfolgende MapServer Layerdefinition:
es: Comencemos con un ejemplo sencillo. Consideremos la siguiente definición de capa en MapServer:
ja: 簡単な例から始めて、ステップアップしていきましょう。次のMapServerレイヤ定義を考えて下さい。

source: This layer will display all the road geometries in the roads table as black lines.
de: Dieser Layer stellt alle Straßengeometrien der "roads"-Tabelle schwarz dar.
es: Esta capa visualizará todas las geometrías de carreteras de la tabla carreteras 'roads' como líneas negras.
ja: このレイヤは"roads"テーブルにある道路ジオメトリの全部を黒線で表示するものです。

source: Now lets say we want to show only the highways until we get zoomed in to at least a 1:100000 scale - the next two layers will achieve this effect:
de: Angenommen, wir wollen bis zu einem Maßstab von 1:100000 nur die Autobahnen anzeigen - die nächsten zwei Layer erreichen diesen Effekt:
es: Ahora, digamos que queremos mostrar sólo las autopistas cuando hagamos un zoom al menos de una escala 1:100000. Las siguientes dos capas conseguirán este efecto:
ja: では、少なくとも1:100000にズームするまでは高速道路だけを表示したい、としましょう。次の二つのレイヤで、その効果が実現できます。

source: The first layer is used when the scale is greater than 1:100000, and displays only the roads of type "highway" as black lines. The <varname>FILTER</varname> option causes only roads of type "highway" to be displayed.
de: Der erste Layer wird verwendet, wenn der Maßstab größer als 1:100000 ist und es werden nur die Straßen vom Typ "highway"/Autobahn als schwarze Linien dargestellt. Die Option <varname>FILTER</varname> bedingt, dass nur Straßen vom Typ "highway" angezeigt werden.
es: La primera capa se usa cuando la escala es superior a 1:100000 y muestra sólo las carreteras de tipo "highway" como líneas negras. La opción <varname>FILTER</varname> hace que sólo se visualicen las carreteras de tipo "highway".
ja: 一つ目のレイヤはスケールが1:100000以上であるときに使われ、道路タイプが"highway"である道路のみ黒線で表示されます。<varname>FILTER</varname>オプションによって、道路タイプが"highway"の場合のみ表示することになります。

source: The second layer is used when the scale is less than 1:100000, and will display highways as double-thick red lines, and other roads as regular black lines.
de: Der zweite Layer wird angezeigt, wenn der Maßstab kleiner als 1:100000 ist. Er zeigt die Autobahnen als doppelt so dicke rote Linien an, die anderen Straßen als normale schwarze Linien.
es: La segunda capa se usa cuando la escala es menor de 1:100000 y mostrará las autopistas como líneas rojas de doble grueso, y las otras carreteras como líneas negras de grosor normal.
ja: 二つ目のレイヤはスケールが1:100000未満である時に使われ、"highway"は赤い二重細線で表示され、他の道路は黒線で表示されます。

source: So, we have done a couple of interesting things using only MapServer functionality, but our <varname>DATA</varname> SQL statement has remained simple. Suppose that the name of the road is stored in another table (for whatever reason) and we need to do a join to get it and label our roads.
de: Wir haben eine Reihe von interessanten Aufgaben lediglich mit der von MapServer zur Verfügung gestellten Funktionalität durchgeführt, und unsere SQL-Anweisung unter <varname>DATA</varname> ist trotzdem einfach geblieben. Angenommen, die Namen der Straßen sind in einer anderen Tabelle gespeichert (wieso auch immer) und wir müssen einen Join ausführen, um sie für die Straßenbeschriftung verwenden zu können.
es: Así que, hemos hecho un par de cosas interesantes usando sólo la funcionalidad de MapServer, pero nuestra sentencia SQL <varname>DATA</varname> ha seguido siendo sencilla. Supongamos que el nombre de las carreteras está almacenado en otra tabla (por la razón que sea) y necesitamos hacer una unión (join) para obtenerlo y etiquetar nuestras carreteras.
ja: さて、MapServerの機能を使うだけで、二つのおもしろいことを実行しました。しかし、<varname>DATA</varname>のSQLステートメントは、単純なままです。道路名が (どういう理由かは知りませんが)他のテーブルに収められていて、それのデータを取得するためにテーブルを連結して、道路のラベルを取る必要がある、とします。

source: This annotation layer adds green labels to all the roads when the scale gets down to 1:20000 or less. It also demonstrates how to use an SQL join in a <varname>DATA</varname> definition.
de: Dieser Beschriftungslayer fügt grüne Beschriftungen zu allen Straßen hinzu, wenn der Maßstab 1:20000 oder weniger wird. Es zeigt auch wie man einen SQL-Join in einer <varname>DATA</varname> Definition verwenden kann.
es: Esta capa de anotaciones añade etiquetas verdes a todas las carreteras cuando la escala baje a 1:20000 o menos. También demuestra como usar una unión (join) SQL en una definición <varname>DATA</varname>.
ja: このANNOTAIONレイヤでは、縮尺が1:20000以下のときに、全ての道路に緑色のラベルを表示します。また、この例は、 <varname>DATA</varname>定義で、SQLのJOINを使用する方法も示しています。

source: Java Clients (JDBC)
es: Clientes Java (JDBC)
ja: Javaクライアント (JDBC)

source: Java clients can access PostGIS "geometry" objects in the PostgreSQL database either directly as text representations or using the JDBC extension objects bundled with PostGIS. In order to use the extension objects, the "postgis.jar" file must be in your CLASSPATH along with the "postgresql.jar" JDBC driver package.
de: Java Clients können auf die PostGIS Geoobjekte in der PostgreSQL Datenbank entweder direkt über die Textdarstellung zugreifen oder über die Objekte der JDBC Erweiterung, die mit PostGIS gebündelt sind. Um die Objekte der Erweiterung zu nutzen, muss sich die Datei "postgis.jar" zusammen mit dem JDBC Treiberpaket "postgresql.jar" in Ihrem CLASSPATH befinden.
es: Los clientes java pueden acceder a los objetos 'geometry' de PostGIS en la base de datos PostgreSQL bien directamente como representaciones en texto o usando los objetos de extensión JDBC incluídos con PostGIS. Para poder usar los objetos de extensión, el fichero "postgis.jar" debe estar en su CLASSPATH así como el paquete controlador JDBC "postgresql.jar".
ja: Javaクライアントは、直接的にテキスト表現として、またはPostGISにバンドルされているJDBC拡張オブジェクトを使用して、PostgreSQLデータベース内にある、PostGISの"geometry"オブジェクトにアクセスできます。JDBC拡張オブジェクトを使うためには、"postgis.jar"ファイルを、JDBCドライバパッケージの"postgresql.jar"とともに、 CLASSPATHに置く必要があります。

source: The "PGgeometry" object is a wrapper object which contains a specific topological geometry object (subclasses of the abstract class "Geometry") depending on the type: Point, LineString, Polygon, MultiPoint, MultiLineString, MultiPolygon.
de: Das Objekt "PGgeometry" ist ein Adapter, der abhängig vom Datentyp ein bestimmtes topologisches Geoobjekt (Unterklassen der abstrakten Klasse "Geometry") enthält: Point, LineString, Polygon, MultiPoint, MultiLineString, MultiPolygon.
es: El objeto "PGeometry" es un objeto envoltorio que contiene un objeto geométrico de topología específica (subclase de la clase abstracta "Geometry") dependiendo del tipo: Point, LineString, Polygon, MultiPoint, MultiLineString, MultiPolygon.
ja: "PGeometry"オブジェクトは、Point、LineString、Polygon、MultiPoint、MultiLineString、MultiPolygonの各型に依存する、特定のトポロジカルジオメトリオブジェクト ("Geometory"抽象クラスの子クラス)を持つラッパオブジェクトです。

source: The JavaDoc for the extension objects provides a reference for the various data accessor functions in the geometric objects.
de: Das JavaDoc der Erweiterung liefert eine Referenz für die verschiedenen Zugriffsfunktionen auf die Geoobjekte.
es: JavaDoc proporciona una referencia para los objetos extensión para las diferentes funciones de acceso a datos en los objetos geométricos.
ja: 幾何オブジェクトのさまざまなデータアクセサ関数に関する参照情報については、拡張オブジェクトのJavaDocをご覧下さい。

source: C Clients (libpq)
es: Clientes C (libpq)
ja: Cクライアント (libpq)

source: Text Cursors
de: Text Cursor
es: Cursores de Texto
ja: テキストカーソル

source: Binary Cursors
de: Binäre Cursor
es: Cursores Binarios
ja: バイナリカーソル

source: LAYER CONNECTIONTYPE postgis NAME "widehighways" # Connect to a remote spatial database CONNECTION "user=dbuser dbname=gisdatabase host=bigserver" PROCESSING "CLOSE_CONNECTION=DEFER" # Get the lines from the 'geom' column of the 'roads' table DATA "geom from roads using srid=4326 using unique gid" STATUS ON TYPE LINE # Of the lines in the extents, only render the wide highways FILTER "type = 'highway' and numlanes &gt;= 4" CLASS # Make the superhighways brighter and 2 pixels wide EXPRESSION ([numlanes] &gt;= 6) STYLE COLOR 255 22 22 WIDTH 2 END END CLASS # All the rest are darker and only 1 pixel wide EXPRESSION ([numlanes] &lt; 6) STYLE COLOR 205 92 82 END END END
de: LAYER CONNECTIONTYPE postgis NAME "widehighways" # Verbindung zu einer remote Geodatenbank CONNECTION "user=dbuser dbname=gisdatabase host=bigserver" PROCESSING "CLOSE_CONNECTION=DEFER" # Um die Zeilen der 'geom'-Spalte aus der 'roads'-Tabelle zu erhalten DATA "geom from roads using srid=4326 using unique gid" STATUS ON TYPE LINE # Von den im Ausschnitt vorhandenen Linien nur die breiten Hauptstraßen/Highways FILTER "type = 'highway' and numlanes &gt;= 4" CLASS # Autobahnen heller und 2Pixel stark machen EXPRESSION ([numlanes] &gt;= 6) STYLE COLOR 255 22 22 WIDTH 2 END END CLASS # Der ganze Rest ist dunkler und nur 1 Pixel stark EXPRESSION ([numlanes] &lt; 6) STYLE COLOR 205 92 82 END END END

source: import java.sql.*; import java.util.*; import java.lang.*; import org.postgis.*; public class JavaGIS { public static void main(String[] args) { java.sql.Connection conn; try { /* * Load the JDBC driver and establish a connection. */ Class.forName("org.postgresql.Driver"); String url = "jdbc:postgresql://localhost:5432/database"; conn = DriverManager.getConnection(url, "postgres", ""); /* * Add the geometry types to the connection. Note that you * must cast the connection to the pgsql-specific connection * implementation before calling the addDataType() method. */ ((org.postgresql.PGConnection)conn).addDataType("geometry",Class.forName("org.postgis.PGgeometry")); ((org.postgresql.PGConnection)conn).addDataType("box3d",Class.forName("org.postgis.PGbox3d")); /* * Create a statement and execute a select query. */ Statement s = conn.createStatement(); ResultSet r = s.executeQuery("select geom,id from geomtable"); while( r.next() ) { /* * Retrieve the geometry as an object then cast it to the geometry type. * Print things out. */ PGgeometry geom = (PGgeometry)r.getObject(1); int id = r.getInt(2); System.out.println("Row " + id + ":"); System.out.println(geom.toString()); } s.close(); conn.close(); } catch( Exception e ) { e.printStackTrace(); } } }
de: import java.sql.*; import java.util.*; import java.lang.*; import org.postgis.*; public class JavaGIS { public static void main(String[] args) { java.sql.Connection conn; try { /* * Den JDBC Treiber laden und eine Verbindung herstellen. */ Class.forName("org.postgresql.Driver"); String url = "jdbc:postgresql://localhost:5432/database"; conn = DriverManager.getConnection(url, "postgres", ""); /* * Die geometrischen Datentypen zu der Verbindung hinzufügen. Beachten Sie bitte, * dass Sie die Verbindung in eine pgsql-specifische Verbindung umwandeln * bevor Sie die Methode addDataType() aufrufen. */ ((org.postgresql.PGConnection)conn).addDataType("geometry",Class.forName("org.postgis.PGgeometry")); ((org.postgresql.PGConnection)conn).addDataType("box3d",Class.forName("org.postgis.PGbox3d")); /* * Eine Anweisung erzeugen und eine Select Abfrage ausführen. */ Statement s = conn.createStatement(); ResultSet r = s.executeQuery("select geom,id from geomtable"); while( r.next() ) { /* * Die Geometrie als Objekt abrufen und es in einen geometrischen Datentyp umwandeln. * Ausdrucken. */ PGgeometry geom = (PGgeometry)r.getObject(1); int id = r.getInt(2); System.out.println("Row " + id + ":"); System.out.println(geom.toString()); } s.close(); conn.close(); } catch( Exception e ) { e.printStackTrace(); } } }
